{
  "movieId": "youtube-ZWyjTllTvmA",
  "title": "Jungle Fantasy! Blonde Savage (1947) Gale Sherwood | Colorized Full Movie",
  "year": 1947,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ZWyjTllTvmA",
      "id": "ZWyjTllTvmA",
      "title": "Jungle Fantasy! Blonde Savage (1947) Gale Sherwood | Colorized Full Movie",
      "description": "Blonde Goddess - ruler of a primitive paradise! For her---and her secret---men dared death! \nA pilot and his partner set out to find an African village and stumble upon a surprising discovery: a blonde girl living with the native tribe\n\nOriginal title: Blonde Savage (1947)\n\nBlack & White version: https://youtu.be/igyVO77IpVs\n\n\nDirector: Steve Sekely \nWriter: Gordon Bache \nStars: Leif Erickson, Gale Sherwood, Veda Ann Borg \nGenres: Colorized, Action, Adventure, Fantasy\n\n\n00:00 Full Movie\n02:09  A man named Steve Blake visits a lawyer, Mr. Bennett, and reveals his plan to potentially kill Mark Harper, the owner of the Harper Diamond Mine, if the police let him go.\n07:30  A man named Mark is suspicious of a handsome stranger named Blake and hires Steve and Hoppy to locate a native tribe in the jungle.\n12:45  Two men find themselves in a dangerous situation in the African jungle.\n21:27  Two men find themselves in a remote village and try to uncover the truth about a mysterious girl and their employer, Harper.\n28:04  A man teaches English to Meelah and Tonga while uncovering a dark secret involving murder and a diamond mine.\n38:55  Connie wants to leave the jungle and strike a deal with Steve for information about Mark.\n42:15  A tense confrontation occurs between the characters, resulting in the revelation of important information.\n48:31  A group of people discuss their plans to protect themselves and confront someone named Harper.\n56:13  Blake confronts Harper and his men, who are surrounded and forced to drop their guns.\n\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:40:07.580Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/ZWyjTllTvmA/maxresdefault.webp?v=657ffd07",
      "duration": 3560,
      "language": "en",
      "year": 1947,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:40:07.698Z"
}