{
  "imdbId": "youtube-quGxJu3xhfU",
  "title": "Wahnsinnig Verliebt (PSYCHOTHRILLER mit AUDREY TAUTOU, Krimi Filme in voller Länge auf Deutsch)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=quGxJu3xhfU",
      "id": "quGxJu3xhfU",
      "title": "Wahnsinnig Verliebt (PSYCHOTHRILLER mit AUDREY TAUTOU, Krimi Filme in voller Länge auf Deutsch)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 AUDREY TAUTOU (\"Amelie\"): Angélique ist verliebt – in den verheirateten Herzchirurgen Loïc. Während sie auf ein gemeinsames Glück hofft, wird sie mit Einsamkeit und Enttäuschung konfrontiert. Doch plötzlich nimmt alles eine unerwartete Wendung…\n\nWAHNSINNIG VERLIEBT (2002)\nOriginaltitel: À la folie... pas du tout\nMit: Audrey Tautou, Samuel Le Bihan, Isabelle Carré\nRegie: Laetitia Colombani\nFSK: Freigegeben ab 12 Jahren\n\nINHALTSANGABE:\nAngelique liebt Loic, den smarten Herzchirurgen, aber dieser ist unglücklicherweise mit einer anderen verheiratet und zu allem Überfluss wird er auch noch Vater. Die Gefühle der jungen hübschen Kunststudentin werden auf eine harte Probe gestellt. Heimliche Treffen, einsame Nächte und tagelanges Warten sind offenbar alles, worauf Angelique hoffen darf - so hat es den Anschein. Nach einer Fehlgeburt verlässt Loics Frau Mann und Haus, nichts steht der Verwirklichung von Angeliques Träumen nun mehr im Wege. Aber warum läuft in Loics bisher so wohl geordnetem Leben plötzlich alles schief? Eine Patientin, die ihm erfolglos Avancen macht, verklagt ihn des tätlichen Angriffs. Mysteriöse Anrufe, anonyme Briefe und makabre Päckchen versetzen den Arzt in Angst und Schrecken. Und dann gibt es eine Tote: Die liebestolle Patientin wird erschlagen aufgefunden...\n#Netzkino #ganzerFilm #audreytautou\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:46:47.765Z",
      "thumbnail": "https://i.ytimg.com/vi/quGxJu3xhfU/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBI0juL2HIh-C2uPlopJwWdR2f76w",
      "duration": 5494,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.127Z"
}