{
  "imdbId": "youtube-BwbQgeavk-Y",
  "title": "The Seashore Village (Gaenma-eul)(1965)",
  "year": 1965,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=BwbQgeavk-Y",
      "id": "BwbQgeavk-Y",
      "title": "The Seashore Village (Gaenma-eul)(1965)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/01240\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/01240\n\n영화글 : https://www.kmdb.or.kr/story/10/5259\n\n감독(Director) : 김수용(Kim Su-Yong)\n출연 : 신영균(상수),고은아(해순),이민자,황정순(성구어머니),전계현(순임),이낙훈(성칠),조용수,김정옥,김옥,정득순,문미봉,추봉,박철,노강,윤양일,석운아,윤식옥,신상근,이영식,김귀화,이군자,조순미,정지양,김수연,유혜경,김성환,김동민,이형환,이귀동\n\n줄거리 : 바닷가 갯마을, 해순(고은아)의 남편 성구(조용수)와 동생 성칠(이낙훈), 순임(전계현)의 남편 등 마을 남자들을 태운 고깃배가 출항한다. 배가 돌아올 무렵, 거센 폭풍우가 불자 마을 아낙들은 성황당에 모여 기도를 올린다. 하지만 살아 돌아온 성칠은 형 성구가 죽었다고 전하고, 어머니(황정순)와 해순은 무당(전옥)을 통해 혼백을 건진다. 한편 상수(신영균)는 과부가 된 해순을 끈질기게 쫓아다니다 결국 관계를 맺는다. 상수가 주막에서 해순이 자기 여자\n라고 마을 남자들에게 떠벌리는 것을 본 성칠은 어머니에게 해순을 개가시키자고 한다.\n해순은 상수와 함께 마을을 떠나 채석장에서 일하다, 힘든 채석장 일 대신 주막에서 일하게 된다. 해순을 빌미로 주막에서 살인사건이 일어나자 상수는 해순을 데리고 다시 산속으로 들어가 나무일을 하게 된다. 사냥꾼이 해순을 겁탈하려 하자 상수가 그를 죽이고 해순의 목을 조른다. 그녀가 기절하자 상수는 약을 구하러 내려간다. 그 사이 깨어난 해순이 상수를 찾는 소리에 상수가 뛰어오다가 절벽 밑으로 떨어져 죽는다. 혼자 장례를 지낸 해순은 다시 갯마을로 돌아오고, 아낙들과 시어머니는 그녀를 반갑게 맞는다.\n\nCasts : Shin Young-Kyun, Ko Eun-Ah, Hwang Jeong-Sun, Lee Nak-Hun, Lee Min-Ja\n\nSYNOPSIS : A lot of widows live in the seaside village because many men met wild storms in the ocean and never returned. Widows in the village are dependent on one another as they work and live in the village. Haesoon (Ko Eun-ah) is newly married and her husband also leaves for fishing. He meets a strong wind on the water and eventually dies and Haesoon also becomes a widow. Sangsu (Shin Young-kyun) follows young and beautiful Haesoon around and eventually gets to spend a night with her. He begins to spread the word about him having slept with Haesoon around the village and Haesoon's mother-in-law (Hwang Jung-soon) and sister-in-law (Lee Nak-hoon) help Haesoon and Sangsoon leave the village. Haesoon and Sangsoo wander around the country and work at quarries and live in the mountains. However, Haesoon's beauty attracts men and Sangsoo's obsession with her worsens. Once, a hunter had his eyes on Haesoon and Sangsoo killed him. Haesoon is shocked from the incident and loses consciousness. Sangsoo tries to leave the mountain to get medicine for Haesoon but falls off a cliff and dies. In the end, Haesoon returns to the seaside village to be with her fellow widows in the village and her mother-in-law welcomes her back.",
      "addedAt": "2025-12-26T00:24:52.667Z",
      "thumbnail": "https://i.ytimg.com/vi/BwbQgeavk-Y/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBo3RpGjaVl60h-z2rkk5FLDUUDug",
      "duration": 5612,
      "language": "ko",
      "year": 1965,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:24:52.704Z"
}