{
  "imdbId": "youtube-u_dvb1UFMJA",
  "title": "Assassin of the Tsar | MYSTIC DRAMA",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=u_dvb1UFMJA",
      "id": "u_dvb1UFMJA",
      "title": "Assassin of the Tsar | MYSTIC DRAMA",
      "description": "The story is about a psychiatrist Smirnov who came to replace the retiring head doctor of a local mental hospital. His attention was drawn to Timofeev, a longtime clinic patient, an ex-convict suffering from an alternating personality. During periods of exacerbation of this disease, the patient considers himself a murderer of Alexander II and Nicholas II, Emperors of Russia. Doctor Smirnov takes an interest in this unique case and begins to actively study the unusual patient. Smirnov’s predecessor believed that “there are things in the human mind that are better never to be touched,” but the new doctor advocates a different treatment. \n\nHow will conversations with the patient and the revelation of the circumstances of the historical execution affect the doctor? And where will such shock therapy lead to in the end?\n\nParticipant in the Main Competition at the Cannes Film Festival (1991). A psychological drama with mystical elements. \n\nOne of the few contemporary films about the Russian Revolution, the tragic end of the Romanov dynasty, the last Russian emperor, and the royal family’s execution. \n\nYear of production: 1991\n\nDirected by: Karen Shakhnazarov\nWritten by: Aleksandr Borodyansky, Karen Shakhnazarov\nDirector of photography: Nikolay Nemolyaev\nMusic: Vladislav Shut\nProduction designer: Lyudmila Kusakova\nStarring: Malcolm McDowell, Oleg Yankovsky, Armen Dzhigarkhanyan\n\nThe film was digitally restored by Mosfilm Cinema Concern\nFind out more: https://cg.mosfilm.ru/en\nSubscribe to our YouTube channel, and be sure to click the bell so that you won’t miss the best Soviet movies! \n\n#russia #empire #revolution",
      "addedAt": "2025-12-23T03:45:53.059Z",
      "thumbnail": "https://i.ytimg.com/vi/u_dvb1UFMJA/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCba3T3yAKbtmk2-EnYgcKqu8484A",
      "duration": 6266,
      "language": "ru",
      "channelName": "Mosfilm",
      "channelId": "UCm5U4zqpahzyNXBv5ZT51Jw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-23T03:45:53.059Z"
}