{
  "imdbId": "youtube-2_qWCVOnWKE",
  "title": "Marlon Brando | One-Eyed Jacks (1961) Western Movie | Remastered",
  "year": 1961,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2_qWCVOnWKE",
      "title": "Marlon Brando | One-Eyed Jacks (1961) Western Movie | Remastered",
      "description": "The motion picture that starts its own tradition of greatness.\nAfter being betrayed and captured following a bank robbery in Mexico, Kid Rio escapes prison and embarks on a quest for revenge against his former partner, Dad Longworth. Years later, Rio tracks down Longworth, who has since settled into a comfortable life as sheriff in Monterey, California. To settle the score, Rio plans to seduce Longworth's stepdaughter, rob the town's bank, and kill Dad. However, as Rio's elaborate revenge unfolds, the lines between right and wrong blur, and both men must face the consequences of their actions.\n\nOriginal title: One-Eyed Jacks (1961) \n\n\nThis film is available in English, and dubbed French, German, Italian, Portuguese & Spanish audio.  Also subtitled in many more language options.\n\nDirector: Marlon Brando\nWriters: Guy Trosper, Calder Willingham, Charles Neider\nStars: Marlon Brando, Karl Malden, Pina Pellicer, Katy Jurado & Slim Pickens\nGenres: Drama, Western\n\nFUN FACT: Initially, the renowned Stanley Kubrick signed on to direct the film. Many script rewrites & disagreements over casting choices, resulted in Kubrick's dismissal from the project. Brando took over as director, leading to a tumultuous and costly production and post-production process. \n\n\n00:00 Full Movie (with dubbed audio & subtitles).\n00:21 Revenge, betrayal, and redemption unfold in the Mexican desert as a man seeks justice after five years in prison.\n23:17 Rio seeks out Dad Longworth in Monterrey, California.\n38:25 Reunion between Dad and Kid after five years, reminiscing about past adventures and discussing future plans.\n46:36 Drama unfolds at a lively fiesta as relationships are tested and secrets are revealed.\n58:33 Betrayal, lies, and heartbreak unfold as secrets are revealed in a dramatic Western movie scene.\n1:26:37 A tale of revenge unfolds as Rio plans to kill Longworth for past grievances in a Western movie.\n1:35:34 A showdown in a Western setting involving a man seeking justice for his friend's betrayal in Mexico.\n1:52:08 Betrayal, revenge unfold in a tale of love, deceit, and justice in the Wild West.\n2:06:00 Betrayal, revenge, and escape unfold in a Western drama as characters face life-threatening situations and make difficult decisions.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "2_qWCVOnWKE",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:35:30.727Z"
}