{
  "imdbId": "youtube-R8oc-b-3SF4",
  "title": "MEG RYAN & HUGH JACKMAN are KATE & LEOPOLD (COMEDY full movie, comedy movies German complete)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=R8oc-b-3SF4",
      "title": "MEG RYAN & HUGH JACKMAN are KATE & LEOPOLD (COMEDY full movie, comedy movies German complete)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Wundervoll romantische Komödie mit HUGH JACKMAN (\"Les Misérables\" & \"Logan\") & MEG RYAN (\"Harry und Sally\" & \"e-m@il für Dich\") um einen Zeitreisenden aus dem 19. Jahrhundert, der im 21. Jahrhundert versucht, das Herz seiner Angebeteten mit dem Charme alter Schule zu gewinnen...\n\nKATE & LEOPOLD (2001)\nOriginaltitel: Kate & Leopold\nMit: Meg Ryan, Hugh Jackman, Liev Schreiber, Bradley Whitford, Breckin Meyer\nRegie: James Mangold\nFSK: Freigegeben ab 0 Jahren\n\nINHALTSANGABE:\nSie ist eine wahre Powerfrau. Kate McKay lebt im New York des 21. Jahrhunderts. Sie ist ehrgeizig, erfolgreich und will ganz hoch hinaus. Er ist ein viktorianischer Gentleman. Leopold, dritter Baron von Albany, lebt im New York des 19. Jahrhunderts und ist gefangen in gesellschaftlichen Konventionen. Zwei Menschen, die unterschiedlicher gar nicht sein könnten. Doch durch einen Wink des Schicksals, einen Zeitsprung im Raum- und Zeitkontinuum, kreuzen sich ihre beiden Wege. Anfangs hält Kate den merkwürdig gekleideten und seltsam anmutenden Kavalier alter Schule für einen Spinner. Doch mit der Zeit verfällt sie seinem unwiderstehlichen Charme. Nach einem romantischen Candle-Light-Dinner, einem Ritt durch den Central Park und einem gefühlvollen Liebesbrief gewinnt Leopold Kates Herz für sich. Doch das Glück scheint nur von kurzer Dauer zu sein, denn Leopold muss zurück in sein Jahrhundert...\n#ganzerFilm #HughJackman #MegRyan\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "R8oc-b-3SF4",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:55:16.124Z"
}