{
  "imdbId": "youtube-rd85GRE2CuU",
  "title": "Outlaw Women (1952 Western Movie) Directed by Sam Newfield | Starring Marie Windsor",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=rd85GRE2CuU",
      "title": "Outlaw Women (1952 Western Movie) Directed by Sam Newfield | Starring Marie Windsor",
      "description": "SHE-DEVILS! No man could resist! Six-gun sirens who shoot to thrill!\nMeet the babes who shoot to thrill and make the coyotes howl! In this offbeat Western yarn, the town of Las Mujertes is run by women and controlled by saloon owner Marie Windsor, but male visitors (including Jackie Coogan as a gunslinger!) create complications.   Kiss or kill -- they never miss!\n\n\nDirectors: Sam Newfield, Ron Ormond\nWriter: Orville H. Hampton\nStars: Marie Windsor, Richard Rober, Allan Nixon, Carla Belinda, Jackie Coogan, Tom Tyler\nGenre: Western\n\n\n00:00 - Full Movie with subtitles\n01:26 - The narrator introduces the fierce women of the Wild West, setting the stage for Silver Creek's tale.\n5:28 - A tense duel between Peyote Bill and Chilawaka Charlie escalates, showcasing the town's lawless nature.\n13:41 - Dr. Bob Ridgeway is forcibly taken to Las Mujeres, a town run entirely by women.\n33:14 - Iron Mae asserts her dominance in Las Mujeres, revealing her sharp wit and control over the town.\n46:04 - Mae devises a plan to outsmart Frank Slater and his gang, protecting the town's assets.\n57:17 - A daring heist unfolds as Mae and her women intercept a stagecoach carrying a fortune.\n67:06 - A climactic shootout erupts between Mae's forces and Sam Bass's gang, testing alliances.\n73:35 - Woody wins the election, bringing law and order to Las Mujeres, as Mae contemplates a new chapter.\n\n\n@CultCinemaClassics",
      "id": "rd85GRE2CuU",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:33:07.889Z"
}