{
  "imdbId": "youtube-Plr9g5tjbkI",
  "title": "The Big Shots (1972 Crime film) French Movie by Serge Reggiani, Juliet Berto, Patrick Bouchitey",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Plr9g5tjbkI",
      "id": "Plr9g5tjbkI",
      "title": "The Big Shots (1972 Crime film) French Movie by Serge Reggiani, Juliet Berto, Patrick Bouchitey",
      "description": "Thia and Murelli make a living from car stunt shows, but also supplement their income by carrying out small burglaries. One day, Thia comes across a scene of jealousy where Jock kills his wife and her lover. Instead of reporting the crime, Thia decides to help Jock escape and takes him in. Jock falls in love with Celia, the gangster Nino Murelli's daughter, and the young couple assists the two friends in one last big heist. However, nothing goes as planned.\n\nOriginal title: Les caïds (1972) AKA: The Big Shots / The Hell Below\n\nThis film has French audio, and subtitles in many languages.\n\nDirector: Robert Enrico\nWriters: M.G. Braun, Robert Enrico, Pierre Pelegri\nStars: Serge Reggiani, Juliet Berto, Jean Bouise, Patrick Bouchitey\nGenres: French cinema, Crime, Drama, Literary\n\n\n00:00 Full Movie (with subtitles)\n02:23 A series of events involving a group of people and a tragic incident at a bistro.\n12:17 Intrigue and drama unfold as characters navigate through relationships and criminal activities.\n19:39 Tense crime plot unfolds with police and criminals clashing over keys to a bank in a university setting.\n33:38 Drama unfolds as characters navigate a dangerous situation with betrayal and uncertainty.\n48:56 Intriguing events unfold as characters navigate accusations, confessions, and unexpected visits in a crime film.\n1:00:39 Intriguing French crime film involving hidden identities, a chase, and a risky escape plan.\n1:15:21 A dramatic story unfolds as two individuals navigate through challenges and uncertainties in their pursuit of a better future.\n\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:36:18.371Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/Plr9g5tjbkI/maxresdefault.webp?v=6666a555",
      "duration": 5824,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:18.511Z"
}