{
  "imdbId": "youtube-4eoNfxLOMyY",
  "title": "Böses Blut (SPANNENDER THRILLER ganzer Film auf Deutsch NEU, Thriller in voller Länge kostenlos)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4eoNfxLOMyY",
      "title": "Böses Blut (SPANNENDER THRILLER ganzer Film auf Deutsch NEU, Thriller in voller Länge kostenlos)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Laurens Leben verläuft positiv, bis sie fälschlicherweise des Mordes beschuldigt wird. Sie entdeckt, dass ein besessener Serienmörder, dessen DNA genau mit ihrer übereinstimmt, sie wissentlich in alle seine Verbrechen verwickelt hat...\n\nBÖSES BLUT (2015)\nOriginaltitel: Bad Blood\nMit: Taylor Cole, Billy Miller, Carly Chaikin, Jeff Kober\nRegie: Adam Silver\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nEinst hat sie mit ihrem Daddy Autos geklaut und saß dafür im Jugendknast. Jetzt macht Lauren, die sexy Bikerlady und Mechanikerin, den feschen Hilfssheriff Garret verrückt. Nicht nur der ist total geplättet, als Lauren des Mordes an einer alten Dame beschuldigt wird. Deren Schoßhund hat nämlich Laurens Blut am Schnäuzchen - oder nicht? Hinter der Tat steckt in Wahrheit der leukämiekranke Serienmörder Oscar - der Lauren mit Gewalt aus dem Polizeigewahrsam befreit und verschleppt...\n#Netzkino #ganzerFilm #Thriller\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "4eoNfxLOMyY",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:55:16.126Z"
}