{
  "imdbId": "youtube-k_SHyCr9opk",
  "title": "Heartbeat (1946, Drama) Directed by Sam Wood | with Ginger Rogers | Colorized Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=k_SHyCr9opk",
      "id": "k_SHyCr9opk",
      "title": "Heartbeat (1946, Drama) Directed by Sam Wood | with Ginger Rogers | Colorized Movie",
      "description": "A young female escapee from a reform school joins a pickpocket academy in Paris. She is caught red-handed on her first attempt at stealing by an upper class man. He recruits her to do him a favor at a society party where she meets and falls in love with a young, handsome, rich diplomat. Whether or not she can land him is another story.\n\nBlack and white version: https://youtu.be/YgLYpBcbZc8\n\n\nOriginal title: Heartbeat (1946)\nThis film is available with English & Spanish audio, and also subtitled in many languages.\n\nDirector: Sam Wood\nWriters: Morrie Ryskind, Hans Wilhelm \nStars: Ginger Rogers, Jean-Pierre Aumont, Adolphe Menjou & Basil Rathbone\nGenres: Colorized, Classics, Drama, Comedy, Romance\n\n\n00:00 Full Movie (with dubbed audio and subtitles)\n02:25 A drama unfolds in a classroom as a professor teaches pickpocketing skills and tests students' abilities.\n11:33 A young woman seeks guidance on avoiding trouble and considers a white marriage for safety.\n19:50 A courtroom drama unfolds as a thief faces consequences for stealing, leading to a secret mission at a ball.\n29:45 A series of events unfold at an embassy ball involving a stolen watch and favors asked.\n40:02 A young woman attends her first ball, receives praise for her work, and shares a special moment with a gentleman.\n50:27 A series of events unfold involving theft, deceit, and a reform school escapee at a school and an embassy ball.\n1:02:32 A man offers a solution to a friend's financial troubles through marriage to a charming girl.\n1:04:57 A man proposes a marriage of convenience to a woman, buying her clothes and expressing loneliness.\n1:14:26 Marriage dilemma unfolds as loyalty is tested and love is questioned.\n1:24:48 A woman rejects a marriage proposal, causing a stir at a courthouse wedding and leading to a romantic dilemma.\n1:37:59 Complicated relationships unfold at a ball, leading to a proposal and emotional revelation.\n\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:36:32.259Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/k_SHyCr9opk/maxresdefault.webp",
      "duration": 6045,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:32.369Z"
}