{
  "movieId": "youtube-5Vf6YXEsV1Q",
  "title": "Grenzgänger - Gefangen im Eis - Ganzen Film kostenlos in HD schauen bei Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5Vf6YXEsV1Q",
      "id": "5Vf6YXEsV1Q",
      "title": "Grenzgänger - Gefangen im Eis - Ganzen Film kostenlos in HD schauen bei Moviedome",
      "description": "*GANZER FILM – Thriller - Überlebenskampf in der eiskalten Natur*\n\nDen Spielfilm „Grenzgänger - Gefangen im Eis“ kostenlos und in voller Länge auf Moviedome schauen.\n\n*So bewerten Filmfans* „Grenzgänger - Gefangen im Eis“:\nIMDb: *5,6* von 10\nAmazon: *3,8* von 5\n\n*Die Handlung von „Grenzgänger - Gefangen im Eis“*\nNach einer Familientragödie wollen Mateusz und seine beiden Teenager-Söhne einen gemeinsamen Neustart wagen. Sie reisen zu einer kleinen Berghütte an der Polnisch-Ukrainischen Grenze, um sich wieder näherzukommen und die Vergangenheit hinter sich zu lassen. Als ein verirrter Wanderer zu dem Trio stößt, wird der abenteuerliche Männertrip jedoch zum Überlebenskampf.\n\n►Mehr ganze Filme auf Moviedome entdecken! http://bit.ly/MoviedomeAbo\nJetzt den ganzen Spielfilm „“ kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo\n►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzerFilm #ThrillerFilm #Actionfilm #FilmeKostenlos #MoviedomeFilm\n\nOriginaltitel: Na granicy\nLaufzeit: 98\nRegie: Wojciech Kasperski\nFSK: 16\nErstveröffentlichung: 2016\n\n\n*Das sind die Schauspieler*\nMarcin Dorocinski (bekannt aus „Anthropoid“, „Jack Strong“)\nin der Rolle des Konrad\nAndrzej Chyra (bekannt aus „Im Namen des…\", „Schuld“)\nin der Rolle des Mateusz\nAndrzej Grabowski (bekannt aus \"Der Tag eines Spinners\", “Pitbull“)\nin der Rolle des Lechu\nBartosz Bielenia (bekannt aus „Corpus Christi“, „Ondyna“)\nin der Rolle des Janek\n\n\n*Die Handlung und Szenen von „Grenzgänger - Gefangen im Eis“* \nDie Zeit heilt ja bekanntlich alle Wunden. Das erhofft sich auch Mateusz (Andrzej Chyra), der sich nach einer Familientragödie in einem schwierigen Heilungsprozess befindet. Doch nun will er mit seinen beiden Söhnen Janek (Bartosz Bielenia) und Tomek (Kuba Henriksen) den Neuanfang wagen. Zusammen reisen sie zu einer kleinen abgelegenen Berghütte an der polnisch-ukrainischen Grenze, wo sie die Gegend etwas erkunden und vor allem wieder zueinander finden wollen. Dass es sich dabei um ein ehemaliges Gefängnis handeln soll, stört sie zunächst nicht. Doch schnell merken sie, dass sie nicht die einzigen in der eiskalten und verschneiten Landschaft sind. Ein Unbekannter fällt durch die Tür erzählt etwas davon, jemanden zurückgelassen zu haben. Mateusz will der Sache auf den Grund gehen und zieht los, während die Jungs ein wachsames Auge auf den Fremden haben sollen – doch die Trennung voneinander könnte sich als fataler Fehler herausstellen…\n\n\nJetzt ganze Filme bei #Moviedome anschauen\nFinde Movies in ganzer Länge diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \nJetzt den Spielfilm „Grenzgänger - Gefangen im Eis“ in voller Länge auf deutsch ansehen.",
      "addedAt": "2025-12-26T00:33:19.412Z",
      "thumbnail": "https://i.ytimg.com/vi/5Vf6YXEsV1Q/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLA1jnmIr49SX0vA6AE6sEMPghP_ww",
      "duration": 5757,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:33:19.493Z"
}