{
  "imdbId": "youtube-eYf6KJUluW4",
  "title": "Supernova - Wenn die Sonne explodiert - Teil 1 von 2 - Ganzer Film kostenlos in HD bei Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=eYf6KJUluW4",
      "title": "Supernova - Wenn die Sonne explodiert - Teil 1 von 2 - Ganzer Film kostenlos in HD bei Moviedome",
      "description": "*GANZER FILM - Explosiver Katastrophenkracher mit Luke Perry und Peter Fonda*\n\nDen Spielfilm „Supernova - Wenn die Sonne explodiert“ kostenlos und in voller Länge auf Moviedome schauen.\n\n*So bewerten Filmfans* „Supernova - Wenn die Sonne explodiert“:\nIMDb: *3,7* von 10\nAmazon: *4,6* von 5\n\n*Die Handlung von „Supernova - Wenn die Sonne explodiert“*\nDer renommierte Astrophysiker Dr. Austin Shepard verschwindet spurlos und hinterlässt seinem Kollegen Christopher Richardson schockierende Entdeckungen. Die mysteriösen Sonnenstürme, die seit einiger Zeit die Wissenschaftler beunruhigen, sind eindeutig für eine Reihe globaler Phänomene verantwortlich: elektrostatische Stürme, massive Stromausfälle und erhöhte Strahlungswerte. Shepards Verschwinden zieht auch die Aufmerksamkeit der Sicherheitsbehörden auf sich. NSA-Agentin Lisa Delgado vermutet zunächst, dass er die geheimen Forschungsergebnisse an den Höchstbietenden verkauft hat, um sich mit dem Geld abzusetzen. In Wahrheit hat sich Shepard jedoch mit seiner großen Liebe auf ein Inselparadies zurückgezogen, da er bereits erkannt hat, was bald alle erfahren werden: Die Sonne, die seit Millionen von Jahren die Quelle allen Lebens ist, wird innerhalb von sieben Tagen als Supernova explodieren. Das Ende der Welt scheint unvermeidlich.\n\n►Mehr ganze Filme auf Moviedome entdecken! http://bit.ly/MoviedomeAbo\nJetzt den ganzen Spielfilm „Supernova - Wenn die Sonne explodiert“ kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo\n►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzerFilm #Katatrophenfilm #FilmeKostenlos #MoviedomeFilm\n\nOriginaltitel: Supernova\nRegie: John Harrison\nLaufzeit: 90\nFSK: 12\nErstveröffentlichung: 2005\n\n\n*Das sind die Schauspieler von „Supernova - Wenn die Sonne explodiert“*\nLuke Perry (bekannt aus „Das fünfte Element“, „Riverdale“)\nin der Rolle des Dr. Chris Richardson\nTia Carrere (bekannt aus „Relic Hunters - Die Schatzjägerin“)\nin der Rolle der Lisa Delgado\nPeter Fonda (bekannt aus „Easy Rider“, „Todeszug nach Yuma“)\nin der Rolle des Dr. Austin Shepard\n\n\n*Die Handlung und Szenen von „Supernova - Wenn die Sonne explodiert“* \nDer renommierte Astrophysiker Dr. Austin Shepard verschwindet spurlos und hinterlässt seinem Kollegen Christopher Richardson schockierende Entdeckungen. Die mysteriösen Sonnenstürme, die seit einiger Zeit die Wissenschaftler beunruhigen, sind eindeutig für eine Reihe globaler Phänomene verantwortlich: elektrostatische Stürme, massive Stromausfälle und erhöhte Strahlungswerte. Shepards Verschwinden zieht auch die Aufmerksamkeit der Sicherheitsbehörden auf sich. NSA-Agentin Lisa Delgado vermutet zunächst, dass er die geheimen Forschungsergebnisse an den Höchstbietenden verkauft hat, um sich mit dem Geld abzusetzen. In Wahrheit hat sich Shepard jedoch mit seiner großen Liebe auf ein Inselparadies zurückgezogen, da er bereits erkannt hat, was bald alle erfahren werden: Die Sonne, die seit Millionen von Jahren die Quelle allen Lebens ist, wird innerhalb von sieben Tagen als Supernova explodieren. Das Ende der Welt scheint unvermeidlich.\n\n\nJetzt ganze Filme bei #Moviedome anschauen\nFinde Movies in ganzer Länge diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \nJetzt den Spielfilm „Supernova - Wenn die Sonne explodiert“ in voller Länge auf deutsch ansehen.",
      "id": "eYf6KJUluW4",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:31:45.146Z"
}