{
  "imdbId": "youtube-PkOExw6yU8s",
  "title": "Bloodline ( Hyeol-maek )(1963)",
  "year": 1963,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=PkOExw6yU8s",
      "id": "PkOExw6yU8s",
      "title": "Bloodline ( Hyeol-maek )(1963)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00930\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00930\n\n영화글 : https://www.kmdb.or.kr/story/10/1983\n\n감독(Director) : 김수용(Kim Su-Yong)\n출연 : 김승호(김덕삼),황정순(복순 어머니),신성일(거북),엄앵란(복순),김지미(옥희),최남현(복순 아버지),신영균(형),최무룡(동생),조미령(벙어리),주선태,이경희\n\n줄거리 : 이북에서 내려온 월남 동포들이 모여 사는 해방촌 산비탈. 홀아버지 김덕삼(김승호)은 아들 거북(신성일)에게 미군부대에 들어가라고 강권하고, 옆집에 사는 함흥댁(황정순)은 딸 복순(엄앵란)에게 억지로 타령을 가르쳐 기생을 시키려 한다. 또 다른 이웃인 젊은 원팔(신영균)은 어린 딸과 담배꽁초를 모아 하루하루를 연명하는데, 아내가 병으로 죽어가지만 병원에 한 번 데려가지 못하는 형편이다. 그의 동생 원칠(최무룡)은 일본에서 대학까지 나왔음에도 소설을 쓰겠다며 취직을 하지 않다가 건설 현장에서 막노동을 한다. 부모의 방식을 자식 세대들에까지 전수하려는 부모들에게 반발하여 집을 뛰쳐나온 거북과 복순은 영등포에 있는 방직공장에 함께 취직한다. 자식들을 보러 온 두 아버지(김승호, 최남현)는 “애비들은 못나서 이러고 있지만 너희들은 쭉쭉 뻗어나가야지”라면서 서로 사랑하는 두 사람의 혼인을 허락하고, 네 사람은 행복한 모습으로 함께 걸어간다.\n\nCasts : Kim Seung-Ho, Hwang Jeong-Sun, Kim Jee-Mi, Choi Nam-Hyeon\n\nSYNOPSIS : The story takes place on a mountain slope where defectors from North Korea live. These families sell cheap things such as socks and pens to make a living and there is a serious gap between the parents and their children. A widower Kim Duk-sam (Kim Seung-ho) nags his son Geo-buk (Shin Seong-il) to join the American army. Hwang Jung-soon who lives next door teaches her daughter Bok-soon (Um Aing-ran) traditional Korean folksongs and forces her to become a giseng (Korean geisha). Another neighbor Shin Young-kyun lives with her young daughter and makes a living by collecting cigarette butts. His wife is dying of illness but he has no money to take her to the hospital. His younger brother Choi Moo-ryong is a Japanese university graduate. But wanting to become a novelist, he refuses to get a job. Eventually, he begins to work as a laborer at a construction site. Geo-buk and Bok-soon are sick of their parents who would go on with their god-forsaken lives and run away from them. They did not wish to live as their parents did. Together, they find a job at a textile factory in Youngdeungpo. Sometime later, Geo-buk and Bok-soon's father (Kim Seung-ho and Choi Nam-hyun) come to visit their children. They agree with their children that they have not tried to change themselves for better lives. But now they understand and agree that their children should be different and try to look for better lives. Then they approve of the marriage of the couple and the four of them happily take a walk together.",
      "addedAt": "2025-12-26T00:25:34.126Z",
      "thumbnail": "https://i.ytimg.com/vi/PkOExw6yU8s/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCpVDi7a8YJJmDbL9gJY4wp_1qQ1g",
      "duration": 4961,
      "language": "ko",
      "year": 1963,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:25:34.150Z"
}