{
  "movieId": "youtube-Vv2WUewBx8U",
  "title": "The Last Man on Earth 1964 (Horror, Drama) Vincent Price, Franca Bettoia, Emma Danieli",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Vv2WUewBx8U",
      "id": "Vv2WUewBx8U",
      "title": "The Last Man on Earth 1964 (Horror, Drama) Vincent Price, Franca Bettoia, Emma Danieli",
      "description": "Dr. Robert Morgan is the only survivor of a devastating world-wide plague due to a mysterious immunity he acquired to the bacterium while working in Central America years ago. He is all alone now... or so it seems. As night falls, plague victims begin to leave their graves, part of a hellish undead army that''s thirsting for blood...his!\nBased on the 1954 novel by Richard Matheson titled \"I Am Legend\", this original film adaptation is the truest to the original story (The Omega Man in 1971, and I Am Legend with Will Smith in 2007).\n\nColorized version: https://youtu.be/ovXE-vdSAL4\n\n\nOriginal title: The Last Man on Earth (1964)\n\nThis film is available with English & French, Italian and Spanish audio, and subtitled in many languages.\n\nDirectors: Ubaldo Ragona, Sidney Salkow\nWriters: Richard Matheson, William F. Leicester\nStars: Vincent Price, Franca Bettoia, Emma Danieli\nGenre: Drama, Horror, Science Fiction & Fantasy\nBudget: $300,000\n\n\n00:00 Full Movie (with dubbed audio & subtitles)\n01:45 Survival of the last man in a post-apocalyptic world against bloodthirsty creatures.\n29:35 Scientists investigate a mysterious airborne disease with no known cure, causing a global epidemic.\n36:08 A man questions the existence of vampires during a national disaster with infected people and burnt bodies.\n41:31 A man struggles to survive in a post-apocalyptic world where most of the population has turned into vampires.\n57:14 Survivor encounters infected individuals and struggles to trust, leading to tension and fear.\n1:08:51 Survivor discovers group with potential cure plans to reorganize society amid impending danger.\n1:16:11 A man discovers a cure for a deadly virus, but faces hostility and fear from the survivors.\n\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:36:13.320Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/Vv2WUewBx8U/maxresdefault.webp?v=66865b1e",
      "duration": 5206,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:13.461Z"
}