{
  "movieId": "youtube-d_Z2mI8ZOCA",
  "title": "The Barefooted Young ( Maenbal-ui Cheongchun )(1964)",
  "year": 1964,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=d_Z2mI8ZOCA",
      "id": "d_Z2mI8ZOCA",
      "title": "The Barefooted Young ( Maenbal-ui Cheongchun )(1964)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00984\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00984\n\n영화글 : https://www.kmdb.or.kr/story/10/5128\n\n감독(Director) : 김기덕(Kim Ki-Deok)\n출연 : 신성일(두수),엄앵란(요안나),이예춘(달이파 두목),윤일봉(덕태),이민자(요안나 모),주증녀(오여사),장민호,김웅,변영,최장호,이창식,김한섭(아가리),박재희,문미봉,한소야,김정선,김자영,심상우,이정엽,김하일,이민철,이호,강성태,김미애,주연(신인),전계현(은혜)\n\n줄거리 : 깡패인 두수(신성일)는 건달 두목(이예춘)의 지시로 밀수한 시계를 운반하다 불량배들로부터 곤란을 겪고 있는 두 여대생을 구해준다. 차에서 칼을 들고 내린 우두머리 불량배는 두수와 격투 끝에 자기 칼에 찔려 죽고, 두수는 도망가다 시계를 하나 흘린다. 살인사건의 용의자로 두수가 지목되자, 덕태(윤일봉)는 두수에게 자수를 권한다. 두수는 형사들에게 취조당하지만 그가 구해주었던 엄대사의 딸 요안나(엄앵란)의 증언으로 풀려난다. 외교관의 딸로 상류층의 생활에 젖어 있던 요안나와 고아 출신으로 조직의 하수인 노릇이나 하며 세월을 보내던 조두수는 서로 다른 생활환경과 분위기에 놓인 상대에게 호감을 느끼고 급속도로 가까워진다. 독실한 기독교인인 요안나는 두수도 맘을 고쳐먹으면 새사람이 될 수 있다고 믿고, 어머니에게 두수의 일자리를 알아봐달라고 부탁한다. 그러나 이들의 연애를 단호하게 반대하는 어머니는 요안나를 태국으로 보내려고 한다. 이에 요안나는 두수와 함께 도피하며 시골 방앗간에서 슬프지만 즐거운 시간을 보낸다. 다음날 아침, 한 노인이 정사(情死)한 두 사람을 발견해 경찰에 신고한다. 요안나의 호화로운 장례식에 비해, 고아인 두수는 아가리(트위스트 김)가 수레에 실어갈 뿐이다. 아가리는 두수의 맨발에 자신의 구두를 신겨준다.\n\nCasts : Shin Seong-Il, Eom Aeng-Ran, Kim Mi-Hye, Twist Kim\n\nSYNOPSIS : Jo Doo-soo (Shin Seong-il), a member of a gang, comes across and helps Joanna (Um Aing-ran), a college student who is about to have her handbag robbed by the bullies on her way home. Joanna is a diplomat's daughter and living the life of the upper class; whereas, Jo Doo-soo wastes his days serving the gang. Attracted to one another because of their opposite lives, Doo-soo and Joanna quickly fall in love. Being a devout Christian, Joanna believes that if only Doo-soo changed his thoughts about the way he lives, he could be a new person and asks her mother to help Doo-soo find a place to work. However, Joanna's mother is strongly opposed to Joanna dating Doo-soo and tries to send her to her father in the U.S. At this, Joanna goes on a trip with Doo-soo to a rural area. There, they find an old stable where they commit suicide together.",
      "addedAt": "2025-12-26T00:25:15.212Z",
      "thumbnail": "https://i.ytimg.com/vi/d_Z2mI8ZOCA/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBRLBeXZRWbSgFd5330TZfkigDlUQ",
      "duration": 7050,
      "language": "ko",
      "year": 1964,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:25:15.367Z"
}