{
  "imdbId": "youtube-iqYpk5zGUxk",
  "title": "NEW HD RESTORATION 🍕Flight to Mars (1951) 🍕SCI-FI CLASSIC 🍕CAMERON MITCHELL🍕 FULL MOVIE",
  "year": 1951,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=iqYpk5zGUxk",
      "id": "iqYpk5zGUxk",
      "title": "NEW HD RESTORATION 🍕Flight to Mars (1951) 🍕SCI-FI CLASSIC 🍕CAMERON MITCHELL🍕 FULL MOVIE",
      "description": "It's Friday @PizzaFLIX \nStars: Cameron Mitchell, Marguerite Chapman, Arthur Franz \nDirector: Lesley Selander\nhttps://www.youtube.com/playlist?list=PLmHgXUJMN1TXEBMtSqYpWfok-xg95KXao\n🍕NEW BRILLIANT HD RESTORATION🍕\nBlast off into vintage sci-fi adventure with this rare 1950s gem from Monogram Pictures! Directed by Lesley Selander and produced by Walter Mirisch, this early color science fiction film captures Cold War-era anxieties and space-age wonder as a team of Earth scientists ventures to the red planet. \n\nFeaturing strong performances from Marguerite Chapman, Cameron Mitchell, and Arthur Franz, the story explores themes of survival, trust, and interplanetary diplomacy.\n\nFilmed in Cinecolor and released in 1951, this film stands out for its imaginative set design and bold visual style—hallmarks of Monogram’s transition from low-budget fare to more ambitious productions. The screenplay by Arthur Strawn adds suspense and intrigue as the Martians’ true intentions are gradually revealed.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\n🍕 Don’t forget to like, comment, and subscribe for more rare, vintage films every Friday on PizzaFLIX.\n\nIdeal for fans of retro sci-fi, space exploration cinema, and mid-century genre filmmaking, this classic continues to spark fascination with its blend of adventure and atomic-era tension. Discover a cornerstone of 1950s science fiction that helped shape the future of space movies.\n \n#fullmovie FlightToMars #1950sSciFi #ClassicSciFiMovies #RetroScienceFiction #MonogramPictures #LesleySelander #CameronMitchell #MargueriteChapman #ArthurFranz #GoldenAgeOfSciFi#Friday@PizzaFLIX #pizzaflix",
      "addedAt": "2025-12-24T01:03:08.042Z",
      "thumbnail": "https://i.ytimg.com/vi/iqYpk5zGUxk/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAW431abbuCVWEW25fUVPu8dVjPIw",
      "duration": 4317,
      "language": "en",
      "year": 1951,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T01:03:08.042Z"
}