{
  "imdbId": "youtube-7YJX3XNIeyc",
  "title": "Born to Be Sold (1981, Thriller) Lynda Carter, Harold Gould, Dean Stockwell | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7YJX3XNIeyc",
      "title": "Born to Be Sold (1981, Thriller) Lynda Carter, Harold Gould, Dean Stockwell | Movie",
      "description": "A social worker tries to break up a ring of crooks who buy newborn babies from teenaged mothers and sell them to couples who can't obtain them through legal adoption channels.\n\nOriginal title: Born to Be Sold (1981) AKA: Baby Broker\nThis film has subtitles in many language options.\n\nDirector: Burt Brinckerhoff\nWriters: Lynne McTaggart, Karen Harris \nStars: Lynda Carter, Harold Gould, Philip Sterling, Dean Stockwell\nGenres: Drama, Thriller, TV Movie\n\n\n00:00 Full Movie (with subtitles)\n01:17 A woman seeks help from a social worker after being evicted and facing a difficult situation involving her children.\n12:03 A teenage girl goes into labor unexpectedly, with her mother and social worker assisting in the delivery.\n21:51 A teenage girl's baby is sold without her knowledge, leading to emotional turmoil and legal intervention.\n24:40 Illegal private adoptions orchestrated by a slick broker exploiting vulnerable mothers and wealthy couples.\n32:53 A woman seeks justice after a baby is switched at birth, leading to a series of mysterious events.\n37:17 A woman navigates through the complexities of illegal baby trafficking and personal relationships.\n47:08 A story of a mother fighting for her baby against a deceitful couple and corrupt practices.\n58:51 A lawyer faces threats and challenges while trying to protect a young mother and her baby.\n1:10:50 Drama unfolds in a courtroom as Cindy considers giving up her baby for adoption, facing pressure from various parties.\n1:16:33 A teenage girl struggles with pregnancy and emotional turmoil, seeking justice and closure.\n1:23:15 A couple is caught in an illegal adoption scheme, leading to their arrest during a meeting.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "7YJX3XNIeyc",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:31.765Z"
}