{
  "imdbId": "youtube-NZdxOdfh2SQ",
  "title": "Fire Alarm (Romance, 1932) by Karl Brown | Colorized Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=NZdxOdfh2SQ",
      "title": "Fire Alarm (Romance, 1932) by Karl Brown | Colorized Movie",
      "description": "Fearless firefighter Charlie Jones struggles to romance Pat, the blonde whose cat he rescued, but eventually succeeds in kindling warmth in her heart.\n\nOriginal title: Flames (1932) AKA: Fire Alarm / Fatal Alarm\nThis film is subtitled in many languages.\n\nBlack & White version: https://youtu.be/UPOtgP_sQoI\n\n\nDirector: Karl Brown\nWriters: Karl Brown, Lee Chadwick \nStars: Johnny Mack Brown, George Cooper, Noel Francis \nGenres: Classics, Drama, Action, Adventure, Romance\n\n\n00:00 Full Movie (with subtitles)\n01:24 Fire alarm mishap leads to unexpected romantic encounter and humorous misunderstandings.\n13:27 A young woman starts a new job as a secretary and catches the eye of her wealthy boss.\n15:57 Drama unfolds as relationships and misunderstandings arise in a workplace setting.\n23:48 Unexpected romance leads to tragic consequences in a fire emergency.\n29:23 A fire emergency in a ten-story building, leading to emotional interactions and a sense of impending danger.\n35:31 Unexpected visit leads to confusion and misunderstandings in a romantic setting.\n42:22 Romantic drama unfolds as misunderstandings lead to chaos and confrontation at a party.\n46:18 Betrayal and deception unfold as relationships are tested in a small town setting.\n52:24 A dramatic rescue unfolds in a building on fire, leading to a heartfelt apology and gratitude.\n\n\n@CultCinemaClassics\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "NZdxOdfh2SQ",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:38:30.049Z"
}