{
  "imdbId": "youtube-JvudhelWYXQ",
  "title": "Space-Age Sci-Fi | The Phantom Planet (Adventure, 1961) by William Marshall | Colorized Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=JvudhelWYXQ",
      "title": "Space-Age Sci-Fi | The Phantom Planet (Adventure, 1961) by William Marshall | Colorized Movie",
      "description": "It Begins Where Others End! On the Moon!\nAfter an invisible asteroid draws an astronaut and his ship to its surface, he is miniaturized by the phantom planet's exotic atmosphere.\n\nBlack & White version: https://youtu.be/MTkOud2MBso\n\n\nAvailable with English, French, Italian, & Spanish audio options.  And subtitled in many more languages.\n\nOriginal title: The Phantom Planet (1961) \nDirector: William Marshall\nWriters: William Telaak, Fred De Gorter\nStars: Dean Fredericks, Coleen Gray, Anthony Dexter \nGenres: Colorized classics, Action, Adventure, Sci-Fi\n\n00:00 Full Movie.\n00:20 Mysterious planet phenomena disrupt space missions, leaving no trace. Military investigates the unexplained events.\n07:08 Unexpected events unfold as a space mission encounters a mysterious planet, leading to changes in course and uncertainty about their next move.\n11:55 A space mission encounters unexpected challenges, including a malfunctioning spaceship, approaching asteroids, and a mysterious giant being from another world.\n27:53 In a courtroom on the planet Rayton, Frank Chapman, a US Air Force captain, is accused of causing injury to a Raytonian. Despite being found guilty, he is released and taken to meet Liara, who explains that their planet's gravitational control has returned him to normal size.\n32:49 Challenges and cultural differences arise as Frank Chapman navigates life on Rayton, a primitive planet in the distant future.\n37:30 Unexpected events unfold as a spaceship is pulled towards a small planet, leading to a mysterious disappearance of the crew.\n43:33 In a space adventure, a discussion about controlling gravity and potential espionage unfolds, revealing the danger of sudden heat concentration on the planet Rayton.\n49:35 Intense space duel with unexpected bond and plan for escape.\n57:15 Intense battle against Solarites, who control gravity, threatens the survival of the team on a distant planet.\n1:12:39 Interstellar romance, mission to the moon, and a mysterious asteroid encounter unfold in this space adventure.\n1:16:17 A space crew encounters a mysterious planet, leading to confusion and disbelief as they prepare to take off.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=PL2gsu7VGzgdab9LsjsyqpseqaKefjzFvQ",
      "id": "JvudhelWYXQ",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:38:45.064Z"
}