{
  "imdbId": "youtube--5_Af0uuyjw",
  "title": "Film-Noir | I'll See You in Hell (1960) directed by Piero Regnoli | Colorized Movie",
  "year": 1960,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-5_Af0uuyjw",
      "id": "-5_Af0uuyjw",
      "title": "Film-Noir | I'll See You in Hell (1960) directed by Piero Regnoli | Colorized Movie",
      "description": "Haunted by greed, their heist turns into a nightmare!\nA trio of criminals successfully execute a daring diamond robbery. Tensions rise at their hideout in a wilderness cabin when a mysterious woman arrives, and the surviving gang members become increasingly paranoid, believing their deceased comrade is haunting them.\n\nOriginal title: Ti aspetterò all’inferno (1960) AKA: I'll See You in Hell \n\nBlack & White version: https://youtu.be/oydhhLp3OEg\n\n\nThis film has English audio and is subtitled in many languages.\n\nDirector: Piero Regnoli\nWriters: Arpad DeRiso, Dario Ferra, Piero Regnoli\nStars: Eva Bartok, John Drew Barrymore, Massimo Serato\nGenres: Colorized, Italian Cinema, Crime, Drama, Thriller, Film-noir\n\n\n00:00 Full Movie (with subtitles).\n01:14 Mystery and suspense unfold as a group navigates through a series of criminal activities and alibis.\n12:25 A tale of betrayal and greed unfolds as a group of individuals embark on a dangerous journey for diamonds.\n25:21 A chance encounter leads to a mysterious woman seeking shelter in a small town, sparking tension and intrigue.\n29:25 Encounter between two individuals leads to a mysterious exchange and discussion about a past incident in a stormy night.\n52:08 Betrayal, greed, and escape plans unravel in a criminal underworld, leading to tension and confrontation.\n54:15 Tense conversation about sharing diamonds and trust issues.\n1:16:39 A tale of revenge unfolds as a woman seeks justice for her husband's murder involving diamonds and deception.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:37:15.485Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/-5_Af0uuyjw/maxresdefault.webp",
      "duration": 4974,
      "language": "en",
      "year": 1960,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:37:15.589Z"
}