{
  "imdbId": "youtube-iNLCI74gzRk",
  "title": "Nylon Noose (1963 Mystery film) Laya Raki, Richard Goodman, Helga Sommerfeld",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=iNLCI74gzRk",
      "title": "Nylon Noose (1963 Mystery film) Laya Raki, Richard Goodman, Helga Sommerfeld",
      "description": "Tangled secrets and twisted desires!\nA company's stockholders hold their meeting at a spooky mansion, where a mad doctor is also conducting experiments in the mansion. Meanwhile bodies keep showing up with nylon noose strangulation marks as the cause of death... It leave you breathless!\n\nOriginal Title: Die Nylonschlinge (1963)\n\nColorized version: https://youtu.be/Ru1PX5yMho0\n\n\nDirector: Rudolf Zehetgruber\nWriters:  Fred Ignor, Thomas Engel\nStars: Richard Goodman, Helga Sommerfeld, Laya Raki, Ady Berber\nGenres: German cinema, Crime, Drama, Mystery\n\n\n00:00 Full Movie\n01:47 A detective investigates a murder at a bar and uncovers a complex web of deception and danger.\n13:23 A mysterious meeting at Elford Manor leads to unexpected revelations and suspicious activities.\n18:22 A detective interviews multiple people in a murder investigation, uncovering a potential suspect.\n23:34 A detective investigates a mysterious death at Elford Manor, where unusual scientific experiments are being conducted on ancient corpses.\n30:41 A murder mystery unfolds at Elford Manor, involving a golf game and a mysterious figure named Henry.\n37:50 A detective investigates a mysterious case involving a missing person and hidden secrets.\n47:09 A mysterious conversation unfolds, involving a strong suspect, a potential financial deal, and a looming threat.\n53:03 A complex web of deceit, murder, and intrigue unfolds at Elford Manor.\n1:03:19 A detective uncovers a web of deceit, murder, and betrayal as he solves a case involving stolen diamonds and a series of murders.\n\n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.tiktok.com/@cultcinemaclassics\nhttps://www.instagram.com/cultcinemaclassics",
      "id": "iNLCI74gzRk",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:39:52.384Z"
}