{
  "imdbId": "youtube-8B1EOJ61F4A",
  "title": "Perfect Strangers (ROMANTIC CHRISTMAS MOVIE in German complete)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8B1EOJ61F4A",
      "title": "Perfect Strangers (ROMANTIC CHRISTMAS MOVIE in German complete)",
      "description": "🎄 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 An Heiligabend stranden zwei frisch Getrennte in den schottischen Highlands. Wegen starken Schneefalls teilen sie sich notgedrungen eine Hütte – und ein Zimmer.\n\nLOST AT CHRISTMAS (2020)\nOriginaltitel: Perfect Strangers\nMit: Natalie Clark, Kenny Boyle, Sylvester McCoy\nRegie: Ryan Hendrick\nFSK: Freigegeben ab 12 Jahren\n\nINHALTSANGABE:\nEs ist Heiligabend im schottischen Fort William, als die beiden frisch gebackenen Singles Jen (Natalie Clark) und Rob (Kenny Boyle) im Schneesturm aufeinandertreffen. Sie fassen den Entschluss, sich gemeinsam auf den rund 100 Meilen umfassenden Weg nach Hause zu machen. Während das Wetter jedoch immer bedrohlicher wird, durchstreifen die beiden streitend die einsame Landschaft und erreichen irgendwann ein abgelegenes Gästehaus, in dem nur noch ein einziges Zimmer frei ist. Widerwillig erkennen Jen und Rob nach und nach, dass sie gezwungen sind, den Weihnachtsabend wohl oder übel zusammen verbringen zu müssen.\n#Netzkino #ganzerFilm #weihnachten\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@netzkino_official\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "8B1EOJ61F4A",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-23T23:49:05.338Z"
}