{
  "imdbId": "youtube-UtDHc881l34",
  "title": "길소뜸(1985) / Gilsotteum (Kilsodeum)",
  "year": 1985,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=UtDHc881l34",
      "id": "UtDHc881l34",
      "title": "길소뜸(1985) / Gilsotteum (Kilsodeum)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/...\n(English) https://www.kmdb.or.kr/eng/db/kor/det...\n\n영화글 \nhttps://www.kmdb.or.kr/story/10/1827\nhttps://www.kmdb.or.kr/story/10/1754\n\n감독(Director) : 임권택(Im Kwon-Taek)\n출연 : 김지미(민화영),신성일(김동진),한지일(맹석철),김지영(맹석철의 아내),이상아(어린 민화영),김정석(어린 김동진),오미연(김동진의 아내),김기수,김복희,진봉진,김설하,주상호,이인옥,허기호(음악선생님),전숙,이석구,손부,김애라,권일정,조학자,오세장,홍명구,신동욱,오용섭,고앤이,이중수,김진희,권경아,박상영,임성일,이영임,박광민,최불암(의사),전무송(민화영의 남편)\n\n줄거리 : 이산가족 찾기가 한창인 1983년 여름, 화목하고 부유한 가족을 꾸려나가던 화영(김지미)은 남편(전무송)의 권유로 방송국에 아들을 찾으러 가다가 회상에 젖는다. 화영은 해방과 함께 황해도의 작은 마을 길소뜸으로 이사를 가서 고아(이상아-어린 화영)가 되고, 아버지 친구 김병도와 함께 살다가 자신을 따뜻하게 감싸주는 김 씨의 아들 동진(김정석-어린 동진)과 사랑하게 된다. 비 오던 날 둘은 사랑을 나누고 화영은 아이를 낳지만, 한국전쟁이 일어나고 운명이 서로 엇갈리며 만날 수 없게 된다. 화영은 우연히 여의도 만남의 광장에서 아들을 찾다가, 자신의 목숨을 구해준 사람의 딸(오미연)과 결혼하고서도 가족을 버려두다시피 하고 화영을 기다리며 살아온 동진(신성일)을 만나게 된다. 둘은 자신의 부모를 찾고 있던 석철(한지일)을 만나고 그가 자신들의 아들임을 감지한다. 화영과 동진은 석철을 찾아가지만 화영은 바닥 인생을 살아온 석철의 무례한 행동에 이질감을 느낀다. 석철의 흉터와 유전자 친자 확인으로 석철이 아들임이 거의 확실해지지만, 화영은 완전한 확증이 아니라면 믿지 못하겠다며 이를 거부하고 돌아선다. 화영이 준 남편의 명함을 쓰레기통에 버리며 동진 역시 힘없이 돌아선다. 차를 타고 달리던 화영은 잠시 멈춰 서서 눈물을 흘리지만 다시 제 갈 길로 떠난다.\n\nCasts : Kim Jee-Mi, Shin Seong-Il, Han So-Ryong, Choi Bul-Am\n\nSYNOPSIS : In the summer of 1983, many were searching for family members who were separated during the Korean War. At her husband's urging, Hwa-young goes to a meeting place to see if she can find her son when she gets caught up in memories. With the liberation of the nation, she goes to the town of Kilsodeum and becomes an orphan. Hwa-young goes on to live with her father's friend, Kim Byung-do and falls in love with his son. In Yeouido, at the meeting spot, Hwa-young meets Dong-jin. Though he is married to another woman, he had been waiting for her. With him is Hwa-young's son, Seok-chul. Meeting Seok-chul, Hwa-young feels the distance of 33 years between her and her son. However, she weeps tears as she identifies Seok-chul as her son.",
      "addedAt": "2025-12-26T00:23:11.333Z",
      "thumbnail": "https://i.ytimg.com/vi/UtDHc881l34/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAftXbRB9rszunCyXM6e3H3i1X3dw",
      "duration": 6081,
      "language": "ko",
      "year": 1985,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw",
      "regionRestriction": {
        "blocked": [
          "JP"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:23:11.345Z"
}