{
  "imdbId": "youtube-QY-6f08USVg",
  "title": "All the Colors of Life (STAR-STARRED FILM in German, moving films, full movie)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QY-6f08USVg",
      "title": "All the Colors of Life (STAR-STARRED FILM in German, moving films, full movie)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Ein berührendes und humorvolles Porträt einer modernen Familie, die Liebe und Zusammenhalt über traditionelle Rollen stellt. Susan Sarandon („Thelma & Louise“) und Elle Fanning bringen drei Generationen von Frauen mit unterschiedlichen Träumen und Meinungen zum Leben, die trotz aller Unterschiede zusammenhalten.\n\nALLE FARBEN DES LEBENS (2015)\nOriginaltitel: 3 Generations\nMit: Naomi Watts, Elle Fanning, Susan Sarandon\nRegie: Gaby Dellal\nFSK: Freigegeben ab 6 Jahren\n\nINHALTSANGABE:\nEin Haus, drei Generationen, vier außergewöhnliche Menschen. Auf den ersten Blick erscheinen sie wie eine typische, moderne New Yorker Familie: Das Haus gehört Großmutter Dolly (Susan Sarandon), die in den unteren Etagen mit ihrer Lebensgefährtin Frances (Linda Emons) ihren nicht ganz so stillen Ruhestand genießt. Oben wohnt Dollys Tochter Maggie (Naomi Watts) zusammen mit der 16-jährigen Enkelin Ramona (Elle Fanning), die sich jedoch selbst Ray nennt und bereits seit Jahren als Junge lebt. Nun möchte Ray den entscheidenden Schritt machen und eine Hormontherapie beginnen. Dazu benötigt er jedoch die Zustimmung beider Eltern, was auch Maggie vor weitreichende Probleme stellt. Sie muss Rays Entscheidung nicht nur unterstützen, sondern auch wieder Kontakt zu ihrem Ex (Tate Donovan) aufnehmen, den sie eigentlich komplett aus ihrem Leben gestrichen hat. Und auch Dolly hat Schwierigkeiten zu akzeptieren, dass sie von nun an endgültig einen Enkelsohn haben soll. Alle drei Generationen müssen plötzlich existentielle Entscheidungen treffen und Veränderung als Chance erkennen, damit sie als Familie wieder neu zusammenfinden können.\n#Netzkino #ganzerFilm #ellefanning #susansarandon #drama\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "QY-6f08USVg",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "DE",
          "LI"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.125Z"
}