{
  "imdbId": "youtube-DbyjVWDzjeE",
  "title": "In from the Cold? A Portrait of Richard Burton (Documentary, 1988) Subtitles available",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=DbyjVWDzjeE",
      "id": "DbyjVWDzjeE",
      "title": "In from the Cold? A Portrait of Richard Burton (Documentary, 1988) Subtitles available",
      "description": "Drunk, uncontrollable, infinitely generous, and larger than life - director Tony Palmer lays bare the life of legendary actor Richard Burton.\n\nRichard Burton was a renowned Welsh actor known for his charismatic presence, deep voice, and commanding performances on stage and screen. Additionally, Burton's highly publicized romance and marriages to Elizabeth Taylor added to his legend. \n\nDirector & Editor: Tony Palmer\n\n\n00:00 Full Documentary (with subtitles)\n04:11 Exploration of the life of a renowned actor from Wales, Richard Burton, including his humble beginnings and rise to fame.\n12:19 The life and relationships of Richard Burton, including his upbringing, education, and legal guardianship.\n19:23 Exploration of Richard Burton's life, career, and influences through personal anecdotes and reflections.\n28:22 Richard Burton's early career and personal anecdotes from colleagues and friends.\n36:49 Insight into the personal and professional life of Richard Burton through anecdotes and observations.\n45:27 Richard Burton's career in Hollywood and Old Vic, struggles with fame, and personal reflections.\n55:16 The complex relationship between Michael and Richard during their acting career.\n1:04:05 Exploration of the tumultuous relationship between Elizabeth Taylor and Richard Burton.\n1:14:17 Exploration of Richard Burton's life, career, and impact on Shakespearean theatre.\n1:21:31 Richard Burton's personal struggles and achievements in the entertainment industry.\n1:32:07 Exploration of Richard Burton's career, relationships, and struggles with fame and isolation.\n1:41:27 Insight into the life and personality of Richard Burton, a versatile and private individual.\n1:49:24 Exploration of Richard Burton's complex persona, relationships, and impact on others.\n\n@CultCinemaClassics\n\nFor more Hollywood Star Biographies: https://www.youtube.com/playlist?list=PL2gsu7VGzgdY9GgX3x1bZ5pdYigrO6uyS\n\n\n https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:37:58.937Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/DbyjVWDzjeE/maxresdefault.webp?v=65f7e77f",
      "duration": 7270,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:37:59.061Z"
}