{
  "imdbId": "youtube-MCAEErEhDHQ",
  "title": "돌아온 외다리(1974) / Returned Single-legged Man (Dol-a-on oedali) (1974)",
  "year": 1974,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MCAEErEhDHQ",
      "id": "MCAEErEhDHQ",
      "title": "돌아온 외다리(1974) / Returned Single-legged Man (Dol-a-on oedali) (1974)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/02786\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/02786\n\n영화글 : https://www.kmdb.or.kr/story/145/3120\n\n감독(Director) : 이두용(Lee Doo-yong)\n출연 : 한용철 , 권영문 , 정애정 , 이소영 , 김문주\n\n줄거리 :  1930년대 중국 하르빈 암흑가에서 발의 명수로 이름을 떨치던 용철은 애인 향숙의 간청으로 어두운 생활을 청산한다. 이에 보스 왕해림이 심복 야마모도 일당과 함께 황금을 운반하는 마차를 털어 줄 것을 요구하자 용철은 수락하고 만다. 그러나 그 마차의 주인이 향숙의 오빠임이 밝혀지고 죄의식에 빠진 용철은 자신의 다리를 못쓰게 만든 뒤 향숙의 곁을 떠나 술로 세월을 보낸다. 한편 야마모도는 왕해림을 없애고 향숙까지 손에 넣는다. 이 사실을 알고 분노한 용철은 독립군 김승과 함께 야마모도 일당을 무찌르고 그의 수중에 있는 황금을 찾아 조선독립군 본부를 향한다.\n\nCast : Han Yong-cheol , Gwon Yeong-mun , Jeong Ae-jeong , Lee So-yeong , Kim Mun-ju\n\nSYNOPSIS (CONTAINS SPOILERS) : In 1930s, Yong-Cheol is widely known as an expert to use his leg among the gangster world in Harbin, China but he decides to bury his dark past at his girl friend Hyang-Suk's earnest request. For his last operation, his boss Wang Hae-Rim demands him to rob a gold-carrying carriage with the boss' right hand Yamamoto. He receives this proposal. However he finds that the owner of the carriage is Hyang-Suk's brother. He leaves her due to guilty conscience and spends his days addicted in drinking after he himself broke one of his leg. Meanwhile Yamamoto removes Wang Hae-Rim and even possesses Hyang-Suk. Knowing this Yong-Cheol is furious and defeats Yamamoto and his gang with Kim Seung, a soldier of the Independence Army. He regains the gold which is under possession of Yamamoto and leaves for the Headquarter of Cho Sun Independence Army.",
      "addedAt": "2025-12-26T00:22:29.713Z",
      "thumbnail": "https://i.ytimg.com/vi/MCAEErEhDHQ/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLD7D3zzSDMy2O1OA8WIQg4Dsa4H8A",
      "duration": 5130,
      "language": "ko",
      "year": 1974,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:22:29.738Z"
}