{
  "movieId": "youtube-0Z2bScHfSHE",
  "title": "The Invisible Avenger (1958) [Action] [Drama]",
  "year": 1958,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0Z2bScHfSHE",
      "id": "0Z2bScHfSHE",
      "title": "The Invisible Avenger (1958) [Action] [Drama]",
      "description": "Pablo Ramirez is an expatriate from the Caribbean nation of Santa Cruz that is under control of a military dictator called the Generalissimo. From New Orleans, Ramirez plots a revolution and his return to Santa Cruz. To assist in this and to protect him from the Santa Cruz secret police who are in New Orleans he seeks the help of Lamont Cranston through a mutual friend, jazz trumpeter Tony Alcade. In the midst of a telephone call to Cranston Tony is murdered by the secret police. Cranston and his metaphysical mentor Jogendra come to New Orleans to bring Tony's murderers to justice and freedom to Santa Cruz.\n\nThough no one knows the identity of the crime fighting trouble shooter The Shadow who has telephatic powers, everyone knows that he can be contacted for help through Lamont Cranston. As Cranston protects Pablo from secret police assassination and kidnapping attemps, the Generalissimo broadcasts the execution of Pablo's twin brother that is shown on television in the United States in a scheme to draw Pablo into the open.\n\n---\n\nDirected by James Wong Howe, Ben Parker and John Sledge, produced by Emanuel Demby and Eric Sayers, written by George Bellak and Walter B. Gibson, starring Richard Derr as Lamont Cranston, Mark Daniels as Jogendra, Helen Westcott as Tara O'Neill, Jack Doner as Billy Sanchez, Jeanne Neher as Felicia Ramirez, Steve Dano as Tony Alcalde, Dan Mullin as Pablo Ramirez/Victor Ramirez, Leo Bruno as Ramon \"Rocco\" Martinez, Lee Edwards as The Colonel and Sam Page as Charlie (airport thug).\n\n---\n\nSource: \"Invisible Avenger\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 15 June 2013. Web. 29 December 2013. http://en.wikipedia.org/wiki/Invisible_Avenger.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe",
      "addedAt": "2025-12-23T22:41:02.170Z",
      "thumbnail": "https://i.ytimg.com/vi/0Z2bScHfSHE/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCdHOpNfSX7dV1l675RaEvW_TJjYw",
      "duration": 3403,
      "language": "en",
      "year": 1958,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-23T22:41:02.170Z"
}