{
  "imdbId": "youtube-YqqWa4ILWro",
  "title": "BRADLEY COOPER in AMERICAN EVIL (Horrorfilm auf Deutsch, Drama Filme in voller Länge, ganzer Film)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YqqWa4ILWro",
      "title": "BRADLEY COOPER in AMERICAN EVIL (Horrorfilm auf Deutsch, Drama Filme in voller Länge, ganzer Film)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 In diesem düsteren Thriller deckt eine Frau mit traumatischen Visionen die grausamen Taten eines katholischen Priesters auf. Bradley Cooper \"American Sniper\" spielt in dem Drama mit, das die Schrecken der Vergangenheit unheimlich lebendig macht.\n\nAMERICAN EVIL (2008)\nOriginaltitel: Older Than America\nMit: Bradley Cooper, Adam Beach, Tantoo Cardinal\nRegie: Georgina Lightning\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nDer teuflische Plan eines katholischen Priesters droht durch die immer wiederkehrenden und stark traumatisierenden Visionen einer Frau aufzufliegen. Warum, und vor allem wie wollten der Geistliche und seine Kirche sie zum Schweigen bringen? Mit Hilfe ihrer eindringlichen Visionen kann die junge Frau nach und nach herausfinden, was der Klerus Jahrzehnte lang zu vertuschen versuchte. Die Wahrheit ist grauenhaft: Indianische Kinder wurden ihren Eltern entrissen und sollten in Internaten zivilisiert werden. Leisteten die Kinder Widerstand wurde dieser von Priestern mit eiserner Hand gebrochen. Doch was sich einst in einem mittlerweile zur Ruine gewordenen ehemaligen Internat abspielte, hallt auch heute immer noch nach - der Schrecken scheint kein Ende zu nehmen.\n#Netzkino #ganzerFilm #bradleycooper\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "YqqWa4ILWro",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.125Z"
}