{
  "movieId": "youtube-8dE954P5oMw",
  "title": "The last days of a legend Marlon Brando - Documentary",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8dE954P5oMw",
      "id": "8dE954P5oMw",
      "title": "The last days of a legend Marlon Brando - Documentary",
      "description": "The turbulent life of Marlon Brando, from his chaotic final days to his iconic acting career and influence on fashion and rebellion. It delves into the tragedy of his tumultuous relationships, family struggles, and isolated existence. Through the exploration of Brando's activism, passion, and final days at a countryside retreat, the film captures the profound impact of his legacy. Ultimately, the documentary offers a poignant reflection on Brando's desire for eternal digital representation, encapsulating the enduring legacy of a Hollywood icon.\n\n\n\n00:00 Full Documentary - with English, French & German audio options.  And subtitled in many more language options.\n06:42 Marlon Brando's complex life, from career struggles to lasting impact on pop culture.\n12:53 The challenges in Brando's personal life and their effect on those close to him.\n18:31 Difficult relationships and struggles in Brando's life, leading to heartbreak.\n24:21 Brando's reclusive final years and the struggles he faced.\n30:18 Brando’s final days, his activism, and involvement in a controversial project.\n37:52 Key events that shaped Brando’s final days.\n41:09 Brando’s later years marked by family hardships and legal challenges.\n47:16 Brando’s last wishes and legacy, including his unique burial plans and digital legacy.\n\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:35:05.859Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/8dE954P5oMw/maxresdefault.webp?v=67d2745b",
      "duration": 3132,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:35:05.964Z"
}