{
  "movieId": "youtube-ES8weMZpxDA",
  "title": "SHARON STONE is IN THE SPELL OF POWER (full-length spy thriller, new movies in German complete 2025)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ES8weMZpxDA",
      "id": "ES8weMZpxDA",
      "title": "SHARON STONE is IN THE SPELL OF POWER (full-length spy thriller, new movies in German complete 2025)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Der Kalte Krieg wird für eine amerikanische Künstlerin (SHARON STONE, \"Basic Instinct\" & \"Casino\") plötzlich besonders heiß, als ihre große Liebe (RUPERT EVERETT, \"Die Hochzeit meines besten Freundes\" & \"Ein perfekter Ehemann\") plötzlich verschwindet...\n\nTHE THIRD IDENTITY – IM BANN DER MACHT (2004)\nOriginaltitel: A Different Loyalty\nMit: Sharon Stone, Rupert Everett, Julian Wadham, Michael Cochrane, Ann Lambton, Jim Piddock\nRegie: Marek Kanievska\nFSK: Freigegeben ab 12 Jahren\n\nINHALTSANGABE:\nBeirut 1956: Die amerikanische Künstlerin Sally verliebt sich in Leo Cauffield, den Leiter der Spionageabwehr des britischen Geheimdienstes M-16, der als Kriegsberichterstatter arbeitet. Nach stürmischen und leidenschaftlichen Wochen heiraten sie. Beide haben die Liebe ihres Lebens gefunden, bis Leo plötzlich an einem Januarabend spurlos verschwindet. Außer sich vor Sorge macht sich Sally auf die Suche, um etwas über das Schicksal ihres Mannes zu erfahren. Immer dunkler wird die Vergangenheit Leos, immer verstrickter die Nachforschungen. Verfolgt von der britischen Botschaft und bedroht von der US-Regierung kommt Sally der Lösung des Rätsels um Leos Vorleben immer näher. Ihre Suche nach der wahren Identität ihres Ehemannes führt sie über London und New York nach Moskau. Irgendwo wartet die Antwort auf die wichtigste Frage in Sallys Leben: Wer ist Leo Cauffield?\n#Netzkino #ganzerFilm #SharonStone\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:35:38.441Z",
      "thumbnail": "https://i.ytimg.com/vi/ES8weMZpxDA/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDQ8IYhjjLoJRFuuECiISCrRbHgZA",
      "duration": 5926,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.124Z"
}