{
  "movieId": "youtube-s01M3YGI8MY",
  "title": "Holiday in Seoul (Seo-ul-ui hyu-il)(1956)",
  "year": 1956,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=s01M3YGI8MY",
      "id": "s01M3YGI8MY",
      "title": "Holiday in Seoul (Seo-ul-ui hyu-il)(1956)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00311\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00311\n\n영화글 : https://www.kmdb.or.kr/story/10/2035\n\n감독(Director) : 이용민(Lee Yong-Min)\n출연 : 노능걸(송재관),양미희(남희원),임성숙,박상익,김신재,복혜숙,문정숙,박순봉,황해남,김용환\n\n줄거리 : 뷔너스 산부인과 여의사 남희원(양미희)과 그의 남편인 신문기자 송재관(노능걸)은 모처럼의 휴일을 맞이하여 단란한 시간을 보내기로 한다. 하지만 외출 중에 송 기자는 후암동 살인사건에 대한 제보를 받고 급하게 취재에 나선다. 남편을 기다리다 무료한 시간을 보내던 남희원은 남편의 동료 기자들을 만나 시간을 보내게 되고, 동료기자들의 거짓말로 인해 남편이 바람을 피우는 것으로 오해한다. 그녀는 병원 앞에서 울고 있는 소녀의 어머니의 출산을 돕게 되고, 송 기자는 우여곡절 끝에 후암동 살인범을 검거한다. 취재를 위해 범인의 집을 방문한 송재관은 범인의 아내가 남희원이 돌보아 주고 있는 여인임을 알게 된다. 결국 둘의 오해는 풀리고 서로를 더 이해하게 된다.\n\nCasts : No Neung-Girl,Yang Mi-Hee,Lim Seong-Suk\n\nSYNOPSIS : Nam Hi-won (Yang Mi-hi), a female obstetrician at Venus Hospital, and her husband, Son Jae-kwan (No Neung-geol), a newspaper reporter, decided to spend a happy time together during their holiday. On their way, Song receives a lead on a homicide in Huamdong, and rushes there to report. Nam waits for her husband to return and  spends time with his work peers, who lie to her that her husband is having an affair. She then gets to help a pregnant mother in front of her hospital with her daughter, while Song arrests the criminal of the case. When he visits the criminal's house, he finds out that the criminal's wife is the woman Nam has taken care of. At last the couple's misunderstandings are resolved with deeper understanding for each other.",
      "addedAt": "2025-12-26T00:24:53.475Z",
      "thumbnail": "https://i.ytimg.com/vi/s01M3YGI8MY/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLA922xFT-DWxiZCbdZ8ZkZYiXZXQA",
      "duration": 5484,
      "language": "ko",
      "year": 1956,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:24:53.533Z"
}