{
  "imdbId": "youtube-4hVEvFWeBH8",
  "title": "Chantilly Bridge - Some friendships last a lifetime (FEEL GOOD FILM full movie German)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4hVEvFWeBH8",
      "title": "Chantilly Bridge - Some friendships last a lifetime (FEEL GOOD FILM full movie German)",
      "description": "💙 Ganze Filme komplett auf Deutsch streamen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Wunderbarer Feel-Good-Film, der dazu inspiriert, die liebsten Kindheitsfreunde wieder anzurufen, um die besten Zeiten noch einmal aufleben zu lassen...\n\nCHANTILLY BRIDGE – EINIGE FREUNDSCHAFTEN BLEIBEN EIN LEBEN LANG (2023)\nOriginaltitel: Chantilly Bridge\nMit: Lindsay Crouse, Jill Eikenberry, Patricia Richardson, Ally Sheedy, Talia Shire\nRegie: Linda Yellen\nFSK: Freigegeben ab 12 Jahren\n\nINHALTSANGABE:\nIn ihrer Jugend waren Natalie (JoBeth Williams) und ihre Freundinnen Rheza (Lindsay Crouse), Maggie (Talia Shire), Val (Jill Eikenberry) und ihre Schwester Elizabeth (Ally Sheedy) unzertrennlich. 25 Jahre später haben sie sich wieder zusammengefunden, um Natalies Schwester Shelley (Patricia Richardson) beim Ausräumen ihres Elternhauses zu helfen, das ihnen lange als geheimes „Hauptquartier“ diente. Das Quartett, das immer noch seinen Träumen nachjagt und für die eigenen Ideale eintritt, stößt in dem Haus auf zahlreiche Erinnerungen an ihre unerschütterliche, lange Freundschaft. Diese emotionalen Fundstücke, die auch Liebe und Geheimnisse umfassen, bringen die Frauen gemeinsam zum Lachen oder zum Weinen – und auch ein Gläschen Wein darf nicht fehlen ...\n#Netzkino #ganzerFilm #Filme2025\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "4hVEvFWeBH8",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.128Z"
}