{
  "imdbId": "youtube-_6ulgnMQVDc",
  "title": "Film-Noir | Gun Moll / Jigsaw (1949) Marlene Dietrich & Jean Wallace | Colorized Movie",
  "year": 1949,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_6ulgnMQVDc",
      "title": "Film-Noir | Gun Moll / Jigsaw (1949) Marlene Dietrich & Jean Wallace | Colorized Movie",
      "description": "Trapped in the maze of a murderous racket!\nA pseudo-patriotic hate group sends a woman to distract a New York assistant district attorney keen on taking them down.\n\nOriginal title: Jigsaw (1949) AKA: Gun Moll\n\nBlack & White version: https://youtu.be/0AEhtHqdCok\n\n\nThis film is available with subtitles in many language options.\n\nDirector: Fletcher Markle\nWriters: Fletcher Markle, Vincent McConnor \nStars: Franchot Tone, Jean Wallace, Myron McCormick, Marlene Dietrich\nGenres: Classics, Crime, Drama, Film-Noir\nBudget: $400,000 (estimated)\n\n\n00:00 Full Movie - Investigation into a possible murder disguised as suicide leads to uncovering a hate group racket.\n09:21 A story of murder, and conspiracy unfolds amidst societal tensions and personal struggles.\n18:28 Investigation into a murder case leads to encounters with mysterious figures and potential suspects.\n26:39 Suspicious activities, potential appointment as special prosecutor, and a surprise encounter at a nightclub.\n34:34 A prosecutor meets influential individuals and uncovers a potential threat to a woman's safety.\n40:48 A man named Howard Malloy, a special prosecutor, engages in a conversation with a woman named Barbara, who warns him about being careful and hints at potential danger.\n48:49 A woman manipulates a prosecutor to end their relationship, while discussing cats and expenses.\n59:31 Barbara is found dead, leading to a series of events involving hidden papers, blackmail, and a murder investigation.\n1:03:10 Mystery and intrigue unfold as a guard and visitors navigate a closed exhibition, leading to a shocking revelation.\n\n\n@CultCinemaClassics .\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "_6ulgnMQVDc",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "ES"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:38:53.840Z"
}