{
  "imdbId": "youtube-fH0IljKo9JI",
  "title": "Criminal Minds (1998 Crime) They can't get any lower... but they'll die trying.",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=fH0IljKo9JI",
      "title": "Criminal Minds (1998 Crime) They can't get any lower... but they'll die trying.",
      "description": "A group of small-time crooks devise an elaborate heist, only to see their plan spiral into chaos as egos clash and trust crumbles. Pursued by rival criminals, and the law, their survival hinges on loyalty and cunning in a gritty battle for control.\n\nOriginal title: Criminal Minds (1998)  Alternative title: Bottom Feeders\n\nDirector & Writer: Thomas Baumann\nStars: John Saxon, Dino Tripodis, Kip Ellwood\nGenres: Action, Crime, Thriller\n\nDoes this film make the cut?  Does it deserve a place in ⭐ B-Movie Hall of Fame ??\nhttps://www.youtube.com/playlist?list=PL2gsu7VGzgdYUNFx3C0xMQLKXcmuCW5w5\n\n\n00:00  Full Movie: The gripping tale begins with Virgil arriving and bringing unsettling news.\n05:21  Henry crafts a risky plan, blending dark humor and danger with a poetic twist.\n18:03  Earl faces mounting pressure, reluctantly drawn into a precarious robbery.\n37:42  Plank navigates a deadly confrontation with Henry’s gang, using wit to survive.\n52:11  A chaotic escape unfolds as the heist spirals out of control, fracturing alliances.\n1:09:25  Plank challenges Virgil in a tense showdown, risking it all for Grace’s safety.\n1:22:11  A shocking revelation reshapes the escape plan, redefining trust and betrayal.\n1:30:46  The story concludes with Plank reflecting on his choices and walking away with hard-earned wisdom.\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "fH0IljKo9JI",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:33:06.238Z"
}