{
  "imdbId": "youtube-xLjn91o4wqs",
  "title": "개그맨(1988) / Gagman (Gaegeumaen)",
  "year": 1988,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xLjn91o4wqs",
      "title": "개그맨(1988) / Gagman (Gaegeumaen)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/04159\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/04159\n\n영화글\nhttps://www.kmdb.or.kr/story/10/1750\nhttps://www.kmdb.or.kr/story/10/2075\n\n감독(Director) : 이명세(Lee Myeong-Se)\n출연 : 안성기(이종세),황신혜(오선영),배창호(문도석),전무송(감독),조주미,주호성(조부장),최종원(택시기사),추봉,조철남,조선묵,이해룡,박부양,양일민,정영국,조윤진,나갑성,박용팔,김경란,신찬일,박예숙,안진수,유민석,김세준(수리공),손창민(탈영병)\n\n줄거리 : 삼류 카바레의 개그맨 이종세(안성기)는 스스로를 천재 영화감독이라 생각하는 청년이다. 그는 정 감독(전무송)을 따라다니며 감독 데뷔 기회를 노리지만 번번이 쫓겨난다. 어느 날, 종세는 영화배우가 꿈이라는 변두리 이발소 주인 문도석(배창호)에게 자신의 영화에 주연배우로 캐스팅하겠노라 약속한다. 한편 건달들을 피해 극장으로 들어온 오선영(황신혜)은 혼자 영화를 보던 종세 옆에 앉아 느닷없이 키스를 하고, 종세를 따라 그의 집으로 간다.\n카바레 무대에서 리허설을 하던 종세는 무대 위로 올라온 탈영병(손창민)에게 인질로 잡힌다. 멀리서 사이렌이 울리자 탈영병은 들고 있던 총과 탄약을 그에게 건네고 자살한다. 무료한 일상을 탈피하고 싶은 선영은 종세에게 걸작을 만들기 위해 진짜 총으로 은행을 털자고 제안하고, 도석은 은행털이를 영화 각본이라 생각했지만 실제 상황임을 알고 망설인다. 그러나 종세는 명작 탄생을 위한 일이라며 도석을 설득한다. 한적한 시골 은행을 터는 것을 시작으로 이들의 범행은 점점 치밀해지지만 결국 경찰의 수배를 받게 되고, 도주 중에 만난 자동차 정비공(김세준)이 그들을 알아보자 도석은 우발적으로 그를 죽인다. 도주 끝에 부산역에 도착하지만 무장한 경찰들에게 포위당하고, 이 상황을 꿈이라 부인하는 종세는 자수하겠다는 도석에게 서부영화의 한 장면처럼 대결을 청하지만 결국 도석의 총에 맞고 쓰러진다. 이윽고 도석의 이발소 의자에 앉아 잠이 들었던 종세가 눈을 뜬다.\n\nCasts : Ahn Seong-Ki, Hwang Shin-Hye\n\nSYNOPSIS : Lee Jong-sae (Ahn Sung-ki) is a comedian working in a third-class cabaret with a dream of becoming a movie director. He goads Moon Do-suk (Bae Chang-ho) who runs a barber shop in the rural area to join him in a film, saying that he would put him in his movie. Moon Do-suk has always dreamed of becoming an actor and he immediately sells off his barber shop to follow Lee Jone-sae around. Lee goes to a movie theater to catch a movie and coincidentally sits next to Oh Sun-young (Hwang Shin-hye). All of a sudden, she begins to kiss him during the movie. As it turns out, Oh Sun-young was running away from gangsters. After the movie, she decides to follow Lee to his house and hide out. Three people get together now and rub shoulders to make a movie themselves. One day, Lee is rehearsing for his stage at the cabaret and a soldier who escaped from the army (Sohn Chang-min) gives him a gun. Knowing this, Oh Sun-young instigates Lee and Moon to rob the bank, insisting that they need money to produce a movie. Eventually, the group robs the bank and becomes wanted by the police. They are on the run when a car mechanic (Kim Se-jun) recognizes their faces. Moon Do-suk accidentally kills the mechanic and Lee is on the run. He wakes up right before he is caught by the police. He realizes that all this was just his dream that he dreamt on a chair in the barber shop.",
      "id": "xLjn91o4wqs",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:21:45.919Z"
}