{
  "imdbId": "youtube-wTmDbkvxHbU",
  "title": "Space Invasion from Lapland (Horror, 1959) Swedish version by Virgil Vogel | Colorized",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=wTmDbkvxHbU",
      "title": "Space Invasion from Lapland (Horror, 1959) Swedish version by Virgil Vogel | Colorized",
      "description": "Giant ancient monsters are causing chaos by attacking with freezing powers controlled by alien minds!\nA man in Lapland sees a meteor crash land. Dr. Wilson heads to the site with scientists and meets his niece. They find a spaceship and a monster attacks, kidnapping his niece. Can they stop the creature?\n\nOriginal title:  Rymdinvasion i Lappland (1959) Terror in the Midnight Sun \nAKA: Invasion of the Animal People / Space Invasion from Lapland\n\nBlack & White version: https://youtu.be/9pYWlOrBCbg\n\n\nThis film is subtitled in many languages.\n\nDirector: Virgil W. Vogel\nWriters: Robert M. Fresco, Arthur C. Pierce\nStars: Barbara Wilson, Sten Gester, Robert Burton \nGenres: Colorized, Cult Classic, Horror, Sci-Fi, Monster Movie\n\n\"Terror in the Midnight Sun\" is the original Swedish version which was shot in English with a running time of 69 minutes. Re-released in the USA as \"Invasion of the Animal People\". \n\nUSA version:  https://youtu.be/0BHNNX-vPSg\n\n00:00 Full Movie (with subtitles)\n04:39 Encounter with a mysterious phenomenon leads to a scientific investigation in Lapland.\n10:57 Investigation of a mysterious object in Lapland leads to a thrilling discovery.\n14:06 Encounter with a mysterious figure leads to unexpected discoveries and warnings in Lapland.\n23:50 Mysterious discoveries lead to suspicions of an extraterrestrial invasion in Lapland.\n33:22 Unexpected discovery of a mysterious spacecraft in Lapland leads to a thrilling exploration.\n46:18 Mysterious creature found outside a rescue cabin in Lapland causes concern and injury to a skier.\n51:38 A group searches for a missing woman in Lapland amidst a mysterious creature invasion.\n\nCopyrighted :\n\"The US cut Invasion of the Animal People is Public Domain, we own the original version worldwide in perpetuity. Contract with the original producer. We own it, and have the restored version thru the SFI, and will contest anyone claiming to own the film.\"\n\n@CultCinemaClassics \n\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "wTmDbkvxHbU",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:37:36.531Z"
}