{
  "movieId": "youtube-e2AHAmicRTQ",
  "title": "나그네는 길에서도 쉬지 않는다(1987) / The Man with Three Coffins (Nageuneneun gil-e-seodo swiji an-neunda)",
  "year": 1987,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=e2AHAmicRTQ",
      "id": "e2AHAmicRTQ",
      "title": "나그네는 길에서도 쉬지 않는다(1987) / The Man with Three Coffins (Nageuneneun gil-e-seodo swiji an-neunda)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/04044\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/04044\n\n영화글 : https://www.kmdb.or.kr/story/10/5611\n\n감독(Director) : 이장호(Lee Jang-ho)\n출연 : 이보희(미세스 최),김명곤(남자),고설봉(회장),추석양(횟집 주인),유순,권순철,김대환,이은영,김선애,임귀련,권용운,임용규,조선묵,노인령,최경아,원미선,박용수,김세창,오승환,우옥주(특별출연)\n\n줄거리 : 계해년이 저물어가는 어느 날 순석(김명곤)은 3년 전에 죽은 아내의 유골을 바다에 뿌리기 위해 동해의 ‘물치’를 찾는다. 그는 아내의 뼈를 아내의 고향인 북녘땅에 묻어주고 싶지만 갈 수가 없다. 해안가에 유골을 뿌리려던 그는 해안경비원에게도 쫓겨난다. 그는 우연히 여관에서 병으로 누운 노인과 그를 시중드는 간호사(이보희)를 만난다. 이북이 고향인 노인은 가능한 한 북쪽 가까이에서 죽고 싶지만, 그의 아들은 그것을 이해하려 하지 않는다. 순석은 여관 주인에게 이들을 도와줄 수 없겠냐는 부탁을 받지만 거절한다. 그날 밤, 우연히 여관에 묵은 등산객과 어울리게 되어 작부를 소개받지만, 그녀는 갑자기 발작을 일으켜 죽는다. 또 다른 여관에서 묵으며 알게 된 작부 역시 죽고 만다. 노인의 아들은 부하 직원을 보내 노인을 데려가고, 남겨진 간호사와 순석은 서로의 삶을 이야기하며 맺어진다. 간호사는 자신이 관을 세 개 짊어진 남자를 만나 결혼하게 될 것이라는 무당의 점을 이야기하고, 순석은 그것이 자기일지도 모른다는 생각을 한다. 둘은 서울에 올라가 결혼하기로 하고 순석이 먼저 올라가 준비를 하고 있기로 한다. 둘이 부둣가에서 헤어지는 순간 굿판이 벌어지고, 간호사는 신의 부름을 받는 듯 가슴을 움켜쥐고, 순석에게 거대한 손이 환영처럼 떠오른다.\n\nCast : Kim Myeong-kon, Lee Bo-hee, Choo Seok-yang, Ko Seol-bong\n\nSYNOPSIS (CONTAINS SPOILERS) : One day in December, the man takes out from the closet the remains of his wife who died three years ago.  He goes on a trip to spread the remains and reaches a town called Mul-chi on the east coast.  The conversations with people whom he meets in the journey and the landscapes remind him of his past.  He wanders the strange town following the phantom of his dead wife, as if following his destiny.",
      "addedAt": "2025-12-26T00:21:20.161Z",
      "thumbnail": "https://i.ytimg.com/vi/e2AHAmicRTQ/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBuAhssBYQIYA7BOOZgiqheDjkc8Q",
      "duration": 6283,
      "language": "ko",
      "year": 1987,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:21:20.215Z"
}