{
  "movieId": "youtube-Ygn-PPFUt1Y",
  "title": "The Gentleman from California (1937) RICHARDO CORTEZ🍕 COWBOY WESTERN",
  "year": 1937,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Ygn-PPFUt1Y",
      "id": "Ygn-PPFUt1Y",
      "title": "The Gentleman from California (1937) RICHARDO CORTEZ🍕 COWBOY WESTERN",
      "description": "Stars: Ricardo Cortez, Marjorie Weaver, Katherine DeMille\nDirector: Gus Meins\n\nStep into the dusty streets of 1855 California in this swashbuckling Classic Western adventure starring Ricardo Cortez, Marjorie Weaver, and Katherine DeMille. Directed by Gus Meins, this vintage gem blends Old West action with political intrigue and heroic rebellion in the style of Robin Hood.\n\nWhen a native Californian returns home after years of education in Spain, he finds his homeland overrun by greedy politicians and corrupt officials. The land of his ancestors is under siege, and the proud heritage of old California families is being stolen piece by piece. Refusing to stand by, he takes up arms—not as an outlaw, but as a masked defender of justice.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\nFans of Cowboy Westerns, Ricardo Cortez Western roles, and historical tales of frontier resistance will find plenty to enjoy in this rare treasure from the golden age of Hollywood. With memorable performances by Marjorie Weaver and Katherine DeMille, and stylish direction from Gus Meins, this story of courage, honor, and rebellion is brought to you by PizzaFLIX.\n\n💥 Be sure to like, comment, and subscribe for more hidden gems from the world of vintage Westerns!\n\n#RicardoCortez #ClassicWesterns #CowboyMovies #VintageWestern #MarjorieWeaver #KatherineDeMille #GusMeins #PizzaFLIX #OldCalifornia #1930sWestern #RobinHoodOfTheWest #FrontierJustice",
      "addedAt": "2025-12-24T01:03:46.014Z",
      "thumbnail": "https://i.ytimg.com/vi/Ygn-PPFUt1Y/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDV2uixLUiIAR0MHTo_UOOhFxGmBw",
      "duration": 3458,
      "language": "en",
      "year": 1937,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T01:03:46.014Z"
}