{
  "imdbId": "youtube-31CgcX50DyA",
  "title": "Gotti - A Real American Godfather - with John Travolta - Watch full movie for free on Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=31CgcX50DyA",
      "id": "31CgcX50DyA",
      "title": "Gotti - A Real American Godfather - with John Travolta - Watch full movie for free on Moviedome",
      "description": "►Jetzt den Film “Gotti - A Real American Godfather” (2017) mit John Travolta, online, in ganzer Länge bei #Moviedome sehen. \n\nDer US-amerikanische Kriminalfilm handelt vom Aufstieg des berüchtigten Mafioso John Joseph Gotti. \n\nMehr ganze Filme entdecken: Abonnieren ► https://bit.ly/MoviedomeAbo\n\nJetzt den Film kostenlos als ganzen Film in deutsch sehen\n\nIm Kriminalfilm “Gotti” wird die Geschichte des John Joseph Gotti erzählt wie er zum Mafiaboss wurde.\n\n►Die Handlung und Szenen von “Gotti - A Real American Godfather”\nDie Lebensbeichte eines Paten: Der zu fünfmal lebenslänglich verurteilte und an Krebs leidende Mafiaboss John Joseph Gotti (John Travolta) erzählt von seinem Werdegang zum Mafiaboss:\nEs fing bereits im Jahre 1973 an, als John Joseph durch den Auftragsmord an Carlo Gambino (Michael Cipiti) zum Vollmitglied der Cosa Nostra ernannt wurde. Nach dem tragischen Tod seines Sohnes Frank (Connor Cadek), zieht die Familie für einige Zeit von New York nach Florida. \nIm Jahr 1986 wird Paul Castellano (Donald John Volpenhein), das Clanoberhaupt der Costa Nostra, auf offener Straße erschossen. Das ebnet John Joseph den Weg, neues Führungsmitglied des Clans zu werden. In dieser Zeit scheint Gotti unantastbar zu sein, da etliche Versuche der Strafverfolgung ihn einzusperren, gescheitert sind. Privat hält ihm seine Ehefrau Victoria (Kelly Preston) den Rücken frei, so dass er sich vollkommen auf seine Geschäfte konzentrieren kann.\nJohn Angelo (Spencer Lofranco) tut es seinem Vater gleich und steigt ebenfalls in der Gambino-Familie als Vollmitglied ein. Einige Jahre später steht John Angelo unter Anklage und fasst einen verhängnisvollen Entschluss.\n\nDer von Kevin Connolly gedrehte Film feierte am 15. Mai 2018 auf dem Cannes Film Festival Premiere.\n\n►Abonniere #MovieDome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo\n►Mehr kostenlose HD Filme: www.moviedome.de\n\n#Moviedome #Gotti #ArealAmericanGodfather #movie #ganzerfilm\n\nFilmlänge: 112 Minuten\nErscheinungsjahr: 2018\nRegie: Kevin Connolly\n\nWer sind die Schauspieler?\n\nDie Darsteller werden von folgenden Schauspielern verkörpert: \nJohn Travolta (bekannt aus Saturday Night Fever, Grease, Pulp Fiction) ,in der Rolle des John Joseph Gotti\nSpencer Lofranco (bekannt aus King Cobra, Dixieland, Unbroken) in der Rolle des John Angelo Gotti\nKelly Preston (bekannt aus From Dusk Till Dawn, Jerry Maguire - Spiel des Lebens, Nix zu verlieren) in der Rolle der Victoria Gotti\nPruitt Taylor Vince (bekannt aus Natural Born Killers, Identität, Constantine) der Rolle des Angelo Ruggiero \nWilliam DeMeo (bekannt aus Breaking Point, Good Friday, Back in the Day) in der Rolle des “Sammy” Gravano\nLeo Rossi (bekannt aus Halloween II, Exodus Fall, Shut Up and Kiss me) in der Rolle des “Bobby” Boriello\n\nDie Synchronisation \nDie deutsche Synchronisation der Verfilmung wurde durch die Firma DMT - Digital Media Technologie GmbH, Hamburg durchgeführt. \n\nJohn Travolta; Sprecher: Thomas Danneberg\nSpencer Lofranco; Sprecher: Patrick Stamme\nKelly Preston; Sprecher: Marion von Stengel\nPruitt Taylor Vince; Sprecher: Jürgen Holdorf\nWilliam DeMeo; Sprecher: Nicolas König\nLeo Rossi; Sprecher: Jens Wendland\n\n\nBeschreibung für Seite:\nJetzt Film und Trailer kostenlos auf deutsch schauen\nGotti - A Real American Godfather I Trailer I 2018 I Alle Filminfos",
      "addedAt": "2025-12-26T00:36:25.628Z",
      "thumbnail": "https://i.ytimg.com/vi/31CgcX50DyA/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAOOCTGFETxGxUNeWsJ4ea9M47OAA",
      "duration": 6582,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:36:25.727Z"
}