{
  "imdbId": "youtube-2uSIeW5SeNw",
  "title": "청춘의 십자로 (1934) / Turning Point of the Youngsters (Cheongchun-ui sibjalo)",
  "year": 1934,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2uSIeW5SeNw",
      "title": "청춘의 십자로 (1934) / Turning Point of the Youngsters (Cheongchun-ui sibjalo)",
      "description": "무성영화 / Silent Film\n\n영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요. \nFor detailed information on this film, visit : \n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00101\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00101\n\n감독(Director) : 안종화(Ahn Jong-hwa)\n출연 : 이원용, 신일선, 박연 , 김연실 \n줄거리 :  터널을 지나 서울역으로 진입한 기차에서 모녀 승객이 내리자 손님을 기다리던 한 청년이 다가가 거들어준다. 그의 시선을 따라 시골 정경이 펼쳐지면, 나무를 지고 언덕 아래로 내려오는 한복 차림의 사내 모습이 보인다. 이 영화의 주인공 영복(이원용)이다. 성품이 우직하고 착한 영복은 봉선네 집 데릴사위로 들어가 7년 동안 일을 했으나 주명구(양철)에게 봉선(문경심)을 빼앗기게 되자, 늙은 어머니와 여동생을 남긴 채 고향을 떠나게 된다. 그 뒤 고향에 남아 있던 영복의 여동생 영옥(신일선)마저 어머니가 죽자 서울로 올라온다. 오빠를 찾아 넓은 도시 바닥을 헤매다가 구한 일자리가 카페의 여급. 영옥은 같은 시골에서 올라온 명구의 술책에 넘어가 그의 친구인 장개철(박연)에게 몸을 더럽히게 된다. 철도국 소속 수하물 운반원이 된 영복은 주유소에서 급유 일을 하는 계순(김연실)과 사귄다. 그러나 병든 아버지와 어린 동생을 돌봐야 하는 처지로 빚에 시달리던 계순은 부잣집 아들 개철에게 농락당하는 신세가 된다. 이 사실을 알게 된 영복은 개철의 집으로 찾아갔다가 뜻밖에도 여동생을 만나게 되고 자연히 개철과의 관계도 알게 된다. 여동생을 괴롭히고 애인마저 넘보는 이 사내에게 분노한 영복은 마침내 주연을 베풀고 있는 개철 일당을 찾아가 참고 있던 분노의 주먹을 휘두른다. 평정심을 찾은 영복은 영옥의 축복을 받으며 계순과 새 출발을 다짐한다.\nCasts: Lee Won-yong, Sin Il-seon, Park Yeon, Kim Yeon-sil\nSYNOPSIS : It breaks Yeong-bok's heart to leave his old mother and younger sister home to leave his hometown. He married into Bong-seon's family and worked for 7 years but when Joo Myeong-goo snatches Bong-seon away, he decides to leave town. Blaming his cursed fate for everything, he gets a job as a luggage carrier in Seoul. That is when he meets Yeong-hee who works in the vicinity. Yeong-ok also leaves home to come up to Seoul after their mother passes away but she cannot find her brother. Instead, she meets Gae-cheol, an old friend from her hometown and also a good friend of Joo Myeong-goo. Yeong-ok loses her virginity to Gae-cheol and when Yeong-bok finds out about this, he gives Gae-cheol and Myeong-goo a good beating and starts working harder for a better tomorrow.",
      "id": "2uSIeW5SeNw",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:22:08.723Z"
}