{
  "movieId": "youtube-7Fr7Qx6kg_M",
  "title": "[4K] 세기말(1999) / Fin de Siecle (Segimal)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7Fr7Qx6kg_M",
      "id": "7Fr7Qx6kg_M",
      "title": "[4K] 세기말(1999) / Fin de Siecle (Segimal)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/05192\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/05192\n\n감독(Director) : 송능한(Song Neung-han)\n출연 : 김갑수 , 이재은 , 차승원 , 이지은 , 이호재\n줄거리 : 모라토리움-두섭은 어지럽고 혼돈스러운 세상의 상징과도 같은 여관방에서 의뢰받은 동화같은 멜러 드라마를 쓰려 하지만 뜻대로 되지 않는다. 그는 감옥의 간수처럼 간섭하고 재촉하는 서실장과 티격태격하며 고통스러운 작업을 진행한다. 작품이 안 풀려 끙끙거리던 중 거리에서 요요를 파는 한 사내를 발견한다. 시나리오를 마무리하는 어느날 바이러스에 의해 모든 내용이 지워져 버리고 망연자실해진다. 집으로 돌아오던 중 자기가 탈 뻔했던 택시가 교통사고가 난 모습을 본 두섭은 자기가 쓰고 싶어하는 것을 써야 한다고 결심한다. 드디어 꿈꾸던 시나리오를 밤새 쓰기 시작하는 두섭은 다음날 아침 요요사내의 살인사건을 TV뉴스에서 본다. 무도덕-무도덕한 55세 천민 자본가 천은 자본주의에 떠밀려 소외당하는 대학생 소령과 원조교제를 한다. 천과 소령의 섹스 후 천은 10만원권 수표3장을 내려놓고 소령은 이것을 지갑에 넣는다. 천과 헤어진후 소령은 비디오방에서 천과의 기억을 공포영화속에 섞는다. 이중적인 삶을 살아가는 혼란 속에서 맞은 스물한번째 생일 친구 미나의 소개로 만나게 되는 천의 아들 현일과 생일파티중 마약을 시작하게 되고 그녀의 삶은 점점 추락해간다. 어느날 현일과 소령은 운전을 하다 요요사내의 길가에 펼쳐놓은 요요를 부수게 되며 사소한 시비를 벌이다 요요사내에 의해 현일은 잔인하게 살해당한다. 모랄 헤저드-시간강사인 상우는 단정적이고 시니컬한 어투로 정치, 사회, 경제를 씹어가며 우리\"애비들\"의 잘못으로 실패한 한국 100년을 강의한다. 상우는 우연히 만난 홍기자와 SEX를 한다. 그날 밤 교수임용문제로 학과장을 만난 상우는 4천만원을 뇌물로 준비하라는 말을 듣고 고민하다 엉망으로 취한 상태에서 분노를 터뜨리고 정신을 잃어버린다. 자신조차 망각한 옛 애인의 육성 메시지를 통해 2000년 1월 태어날 자신의 2세 소식에 위기감을 느낀 그의 삶은 무거워지고 정부인 미란의 문제해결에 골치가 아프다. 세기말의 혼란과 도덕적 해이는 바로 그의 머릿속에 있는 것이다. 아내의 고소에 갑작스레 나타난 경찰에 의해 체포되며 요요사내와 함께 호송차에 몸을 싣는다. 한강변에서 소주를 놓고 마주한 두섭과 서실장. '20세기'란 시나리오가 다시 영화화에 실패한 뒤, 글쓰기를 멈추고 만화가게를 운영하고 있는 두섭은 아이를 낳은 후 몰라보게 사회에 비판적이고 공격적인 서실장을 달래며 우리가 사는 이 사회는 엉망이고 3류지만 그래도 사람들에게 희망이 있을 것이라고 말한다. 두섭은 최근에 구상하기 시작한 새로운 시나리오 얘기를 시작한다. \"그 시나리오의 프롤로그는 바로 이 작품의 프롤로그이기도 하다.\"\n\nCasts :Sin Il-ryong , Oh Su-mi , Yun Yeong-sil , Cha Hyun-jae , Kim Sugyeong\n\nSYNOPSIS : Part1, MORATORIUM: Screenwriter, Do-sup pursues a story about people caught at the end of a millenium, after losing his previous script to a computer virus and witnessing death at the scene of a car accident. Part2, AMORALITY: college girl, So-ryung's need for money, draws her into a sexual relationship between an overnight millionaire and his son. However the reckless life she shares with her partners ends in her witnessing the brutal murder of the millionaire's son. Part3, MORALHAZARD: Part-time lecturer, Kang-ho may be a talented scholar waiting for tenure, yet his life is eventually destroyed by slackened morals and continuous affairs. Part4, Y2K: The year is 2000, September, life goes on with its despairs and hopes...",
      "addedAt": "2025-12-26T00:21:34.416Z",
      "thumbnail": "https://i.ytimg.com/vi/7Fr7Qx6kg_M/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDCrCDOSoMQfDRZGlMw30ecUxJaCg",
      "duration": 6139,
      "language": "ko",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:21:34.436Z"
}