{
  "movieId": "youtube-FBmdClWB4OM",
  "title": "The Screaming Skull 1958 | Classic Horror | It Might Scare You Till Death!  Colorized Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=FBmdClWB4OM",
      "id": "FBmdClWB4OM",
      "title": "The Screaming Skull 1958 | Classic Horror | It Might Scare You Till Death!  Colorized Movie",
      "description": "The Screaming Skull is a motion picture that reaches its climax in shocking horror. Its impact is so terrifying that it may have an unforeseen effect...it may kill you.\n\nOriginal title: The Screaming Skull (1958) \n\nBlack and White version https://youtu.be/mVVf6Zdxifw\n\nDirector: Alex Nicol\nWriter: John Kneubuhl\nStars: John Hudson, Peggy Webber, Russ Conway, Alex Nicol\nGenre: Classics, Cult Movies, Horror, Thriller, Mystery & Suspense\n\nThis movie comes subtitled in more than 30 languages. Click on ⚙️ and choose subtitles and/or audio tracks.\n\n00:00 Full Movie\n00:48  The Screaming Skull is a horror film that can have a deadly effect on viewers, leading producers to offer a funeral to anyone who dies of fright while watching it.\n08:35  Jenny meets Mickey and learns about his connection to Marianne.\n19:09  Eric and Jenny discuss the death of Marianne and Jenny's fears about her resemblance to Marianne.\n21:35  A couple discusses their grief over the loss of a loved one and strange occurrences in their home.\n39:00  A man confesses to his wife that he is responsible for the death of their child and his ex-wife, and that he spent time in a sanatorium for it.\n45:35  Eric tries to help Jenny overcome her fears and burn a portrait that triggers her memories, but strange occurrences continue to happen.\n53:59  A mysterious skull is found and Eric becomes obsessed with it, leading to strange events and a tragic outcome.\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:43:21.800Z",
      "thumbnail": "https://i.ytimg.com/vi/FBmdClWB4OM/maxresdefault.jpg?v=65418fb6",
      "duration": 4081,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:43:21.901Z"
}