{
  "imdbId": "youtube-QoBLeGrdb4M",
  "title": "Sci-Fi Movie | The Phantom from 10,000 Leagues (1955) by Dan Milner | Colorized",
  "year": 1955,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QoBLeGrdb4M",
      "title": "Sci-Fi Movie | The Phantom from 10,000 Leagues (1955) by Dan Milner | Colorized",
      "description": "Freezing horror! Hideous atomic mutant strikes from the depths!\nAn unusual radioactive rock on the sea bottom mutates the ocean life into a horrible monster. When charred, radioactive bodies begin to drift ashore, a scientist and government agent investigate the phenomenon, and it's connection to a local marine biology professor.\n\nOriginal title: The Phantom from 10,000 Leagues (1955)\nThis film is subtitled in many languages.\n\nBlack & White version: https://youtu.be/gPJdkZkPb0s\n\n\nDirector: Dan Milner\nWriters: Lou Rusoff, Dorys Lukather\nStars: Kent Taylor, Cathy Downs, Michael Whalen\nGenres: Classics, Cult Film, Horror, Sci-Fi, Colorized classics\nBudget: $100,000\n\n\n00:00 Full Movie (with subtitles)\n03:42 A beachcomber gets involved in a deadly scientific experiment.\n12:07 A mysterious scientist suspects foul play related to radiation burns on boats and missing bodies near a coastal school.\n24:43 Mysterious underwater radiation leads to deaths investigated by oceanographer and federal investigator.\n32:21 A scientist suspects a dangerous weapon is being sold to the highest bidder, leading to concerns for a diver's safety.\n36:56 Intrigue and betrayal unfold as individuals seek scientific secrets and navigate dangerous waters.\n47:23 Investigation into attempted murder and dangerous radioactive light leads to uncovering a sinister plot.\n59:07 A mysterious murder investigation unfolds, implicating a professor and his assistant in a deadly plot.\n1:07:19 Mystery unfolds as the true culprit behind the murders is revealed, leading to a decision on the dangerous Hydro Energy Force.\n1:12:28 A scientist's creation causes destruction, leading to a search for answers and a realization of the consequences.\n\n\n@CultCinemaClassics \n\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "QoBLeGrdb4M",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:37:24.436Z"
}