{
  "movieId": "youtube-ZC-FII_bkig",
  "title": "Ida Lupino, Joan Fontaine | The Bigamist 1953 | Colorized Film-Noir | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ZC-FII_bkig",
      "id": "ZC-FII_bkig",
      "title": "Ida Lupino, Joan Fontaine | The Bigamist 1953 | Colorized Film-Noir | Full Movie",
      "description": "Wanted by two women! San Francisco businessman Harry Graham and his wife and business partner, Eve, are in the process of adopting a child. When private investigator Mr. Jordan uncovers the fact that Graham has another wife, Phyllis, and a small child in Los Angeles, he confesses everything. \n\nOriginal title: The Bigamist (1953)\n\nWatch the Black & White version: https://youtu.be/10MFVT7p_3Q\n\nDirector: Ida Lupino\nWriters: Lawrence B. Marcus, Lou Schor \nStars: Joan Fontaine, Ida Lupino, Edmund Gwenn \nGenres: Classics, Drama, F rated, Film-Noir\nBudget: $175,000\n\nThis film is available with audio in English, French, Italian & Spanish.  Go to video settings ⚙️  to change your audio / subtitle language.\n\n\n00:00 Full Movie\n01:30 A couple goes through an adoption process and faces some concerns about the husband's behavior.\n08:43 Mr. Jordan is gathering information about Harry Graham, who spends a lot of time in Los Angeles on business and is interested in adopting a child.\n14:32 A man named Harrison Graham is being investigated and questioned by Mr. Jordan about his whereabouts and activities.\n22:21 A bus tour showcases the glamorous homes of Hollywood stars, and a traveling salesman tries to pick up a girl he meets on the bus.\n29:36 Two strangers meet and spend a lonely Sunday together, forming a connection and helping each other through their loneliness.\n35:08 Harry spends his birthday with Phyllis and they plan a trip to Acapulco.\n51:29 Harry finds out that Phyllis is pregnant and in poor health, leading to emotional turmoil.\n56:15 Harry confesses to his wife, Eve, that he has been living a double life and asks her to marry him, but she refuses.\n1:10:50 A man confesses his love for two women and faces the consequences of his actions in court.\n\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:40:15.134Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/ZC-FII_bkig/maxresdefault.webp?v=65710806",
      "duration": 4770,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:40:15.228Z"
}