{
  "imdbId": "youtube-3dI_cWxSDus",
  "title": "Hollywood Hollywood (1937, Comedy) by Victor Schertzinger | Colorized Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3dI_cWxSDus",
      "title": "Hollywood Hollywood (1937, Comedy) by Victor Schertzinger | Colorized Movie",
      "description": "James Cagney in a drama about Hollywood where private lives are public gossip . . . James Cagney in his latest and greatest picture.\nTerry Rooney's journey to Hollywood as a New York bandleader struggling with a Hollywood studio boss, and the challenges of fame, love, and success in this low budget musical-comedy movie,\n\nOriginal title: Something to Sing About (1937) AKA: Hollywood Hollywood \n\nBlack & White version: https://youtu.be/RTfa6jG3XPM\n\n\nThis film is available with subtitles in many languages.\n\nDirector: Victor Schertzinger\nWriters: Victor Schertzinger, Austin Parker\nStars: James Cagney, Evelyn Daw, William Frawley\nGenres: Classics, Comedy, Musical\nBudget: $900,000\n\n\n00:00 Full Movie\n04:03  Terry Rooney says goodbye to his friends and orchestra as he heads to Hollywood to film a movie.\n16:18  A frustrated actor struggles with his lines and a demanding director on set.\n22:43  A conversation between two people discussing a phone call and preparing for a film scene.\n36:41  Terry Rooney has disappeared and his manager is desperate to find him before he learns of his success.\n47:33  Terry Rooney's success in Hollywood causes a dilemma when he discovers he must be single to fulfill his contract.\n54:05  Terry and Steffie rehearse a love scene and Terry expresses his feelings for her.\n1:01:32  A couple argues about attending a vernissage and the actor's obligations, leading to tension and a potential separation.\n1:16:04  Stephanie Hajos is upset that Terry has refused to pretend to be her fiancé for the sake of publicity and threatens to quit the film.\n1:17:22  A couple's relationship is tested when the husband's ex-girlfriend comes back into the picture.\n\n@CultCinemaClassics\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "3dI_cWxSDus",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:38:22.299Z"
}