{
  "imdbId": "youtube-0AEhtHqdCok",
  "title": "Jigsaw (Film-Noir, 1949) by Fletcher Markle | with Franchot Tone & Jean Wallace | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0AEhtHqdCok",
      "title": "Jigsaw (Film-Noir, 1949) by Fletcher Markle | with Franchot Tone & Jean Wallace | Full Movie",
      "description": "Trapped in the maze of a murderous racket! New York Assistant District Attorney Howard Malloy investigates a series of murders and uncovers an extremist group.\n\nOriginal title: Jigsaw (1949) AKA: Gun Moll\nThis film is available with subtitles in many language options.\n\nColorized version:  https://youtu.be/_6ulgnMQVDc\n\n\nDirector: Fletcher Markle\nWriters: Fletcher Markle, Vincent McConnor \nStars: Franchot Tone, Jean Wallace, Myron McCormick,\nGenres: Classics, Crime, Drama, Film-Noir\nBudget: $400,000 (estimated)\n\n\n00:00 Full Movie (with subtitles)\n02:43 Investigation into the death of Max von Borg reveals a connection to Charlie Riggs and a possible motive for his suicide.\n07:05 A murder case involving diverse community and racial tensions in a 1949 film-noir.\n13:47 Murder mystery unfolds as investigators search for clues and suspects in a film-noir setting.\n19:14 Mysterious encounters and a missing painting lead to a series of unsettling events and a search for answers.\n22:55 Encounter with a mysterious figure leads to a discussion about a special prosecutor appointment and a young woman named Barbara Whitfield.\n32:23 An unexpected encounter leads to a conversation about a potential new role as a special prosecutor, involving a young politician named Agostini.\n38:23 Intense interactions unfold at a social gathering, revealing power struggles and personal agendas.\n42:00 An intriguing conversation and potential romance between Howard and Barbara.\n52:54 Mysterious events unfold as characters discuss their involvement with unknown individuals and a potential threat to one of them.\n56:32 Mystery unfolds as a man is accused of murder and seeks evidence to clear his name, uncovering a conspiracy.\n1:02:54 Intrigue and suspense unfold as a visitor tries to enter a closed museum at night, leading to a confrontation with a mysterious figure.\n\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA\n\n@CultCinemaClassics",
      "id": "0AEhtHqdCok",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "ES"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:38:53.362Z"
}