{
  "imdbId": "youtube-AbIchqFrizU",
  "title": "Mickey Rooney | Quicksand (Film-Noir, 1950) by Irving Pichel | Colorized Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=AbIchqFrizU",
      "title": "Mickey Rooney | Quicksand (Film-Noir, 1950) by Irving Pichel | Colorized Movie",
      "description": "Mickey Rooney plunges into the gripping noir, 'Quicksand,' where love and crime entwine in a desperate descent.\nAuto mechanic Dan Brady's troubles began when he borrowed $20 for a date, leading to a chain of crimes: pawning watches, blackmail, and a failed escape plan. In this suspenseful story, decisions lead to trouble, and love becomes the only hope in a dark world of betrayal.\n\nBlack & White version: https://youtu.be/0ruH-nqql70\n\n\nOrigin title: Quicksand (1950)\nThis film is subtitled in many language options.\n\nDirector: Irving Pichel\nWriter: Robert Smith \nStars: Mickey Rooney, Jeanne Cagney, Barbara Bates & Peter Lorre\nGenre: Colorized Classics, Drama, Crime, Mystery, Film Noir, Romance\n\n\n00:00 Full Movie (with subtitles)\n07:17 A summary of the film 'Quicksand' featuring Mickey Rooney, where a series of events unfold after a chance encounter with a stranger.\n16:57 A man gets into trouble after buying a watch and pawning it, facing legal consequences for theft.\n23:52 Dan struggles with debt and temptation, leading to a series of events involving money, a bar, and a woman.\n32:14 Dan gets entangled in a criminal scheme after finding a large sum of money, leading to a series of dangerous events.\n39:23: Getting caught in a dangerous situation after stealing a car and needs to come up with $3000 to avoid trouble.\n49:10 Trouble after stealing money and facing the consequences.\n59:46 A woman gets entangled in a criminal scheme after her boyfriend steals money, leading to a series of events involving robbery, murder, and betrayal.\n1:03:10 Danny gets involved in a crime and seeks help from a woman named Helen to escape the police and flee to Mexico.\n1:08:25 Dan confesses to a friend about a series of events involving a girl, a criminal act, and a possible murder. They plan to escape to Mexico, but Dan decides to turn himself in.\n1:13:38 A series of events unfold as police officers are killed and a suspect is on the loose, leading to a dramatic chase and a confession.\n \n\n@CultCinemaClassics Members-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "AbIchqFrizU",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:38:40.473Z"
}