{
  "imdbId": "youtube-rGgUtStLV4c",
  "title": "Mohawk (1956 Western) directed by Kurt Neumann starring Scott Brady and Rita Gam | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=rGgUtStLV4c",
      "id": "rGgUtStLV4c",
      "title": "Mohawk (1956 Western) directed by Kurt Neumann starring Scott Brady and Rita Gam | Movie",
      "description": "Their untamed love spoke louder than war drums! \nIn 1700s New York, a Boston artist working in the remote Fort Alden is torn between his love for 2 women and thrown into the middle of a Mohawk-Iroquois-American war.\n \nDirector: Kurt Neumann\nWriters: Maurice Geraghty, Milton Krims \nStars: Scott Brady, Rita Gam, Neville Brand\nGenres: Adventure, Drama, Romance, Western\n\n\n00:00 Full Movie (with subtitles).\n01:28 Adventure unfolds as two women search for a painter in Mohawk territory, encountering danger and romance.\n12:14 A tale of conflict and friendship unfolds as settlers and indigenous peoples clash over land and muskets.\n18:48 A story of love, art, and conflicting ideologies in a small community.\n28:04 A story of love, conflict, and cultural differences unfolds in a fort during a tumultuous night.\n37:41 Exploration of love, peace, and understanding between different cultures in Mohawk village.\n44:38 A tale of love, war, and cultural misunderstandings in a colonial setting.\n54:26 Tensions rise as a conflict between Native Americans and white settlers escalates, leading to a potential war.\n1:01:46 Conflict arises between different tribes leading to a battle for land and revenge.\n1:17:02 Interactions between settlers and indigenous people, a farewell, and a new beginning.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:36:28.084Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/rGgUtStLV4c/maxresdefault.webp?v=662f581e",
      "duration": 4708,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:28.195Z"
}