{
  "imdbId": "youtube-6d3NvbCqlRo",
  "title": "The Scar (1948) [Film Noir] [Drama]",
  "year": 1948,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6d3NvbCqlRo",
      "id": "6d3NvbCqlRo",
      "title": "The Scar (1948) [Film Noir] [Drama]",
      "description": "Just released from prison, John Muller (Paul Henreid) masterminds a holdup at an illegal casino run by Rocky Stansyck. The robbery goes bad, and the mobsters captured some of Muller's men and force them to identify the rest before killing them. Stansyck has a reputation for tracking down and killing his enemies, no matter how long it takes, so Muller decides to leave town and hide. He takes an office job recommended by his law-abiding brother, Frederick (Eduard Franz), but quickly decides that working for a living is not for him. A chance encounter with dentist Dr. Swangron (John Qualen) reveals that Muller looks exactly like a psychoanalyst who works in the same building, Dr. Bartok, the only difference being a large scar on the left side of the doctor's face. Seizing the opportunity, he begins researching Bartok, even slipping into his office to examine his records. He is discovered by the doctor's secretary, Evelyn Hahn (Joan Bennett). She mistakes him for her employer and kisses him, but quickly realizes he is someone else. He persuades her to go out with him, though she has become embittered and claims to have given up any dreams of finding love.\n\nMuller sets out to impersonate Bartok, aided by the fact he studied psychoanalysis in medical school before dropping out. He takes a photograph of the doctor and uses it as a guide to cut an identical scar on his own face. Unfortunately, the developers of the photograph reversed the negative, so now Muller has the scar on the wrong side. He discovers the mistake only after he has already murdered Bartok and is preparing to dump the body in the river. He has no choice but to go through with the plan anyway. Luckily, no one (except the office cleaning lady, whose suspicions he manages to lull) notices the difference, not even Evelyn or Bartok's patients. Muller discovers \"he\" has a girlfriend, Virginia Taylor (Leslie Brooks), and that they frequent Maxwell's, a high class casino. It also turns out Bartok has been losing heavily. When a worried Frederick Muller tries to contact his brother, the trail leads to Bartok. The scar convinces Frederick that the man he sees is merely a lookalike. Evelyn, previously unaware of the switch (but now very suspicious), reveals that John Muller said he was going to Paris. Frederick Muller tells \"Bartok\" that his brother no longer has to hide; Stansyck was convicted for \"income tax problems\" and is scheduled to be deported.\n\nAfterward, Evelyn realizes that Muller is an imposter and that he must have killed the psychoanalyst. Though he admits to her he did, she does not turn him in to the police; instead she purchases a ticket to sail to Honolulu. Muller finds out and promises he will go with her, but she does not believe he would leave such an opportunity to enrich himself. Muller arranges for other doctors to take over his patients and heads to the dock. There, however, he is intercepted by two men who want to discuss Bartok's $90,000 gambling debt. When Muller tries to break away, they fatally shoot him. Evelyn sails away, unaware that Muller lies dying on the dock.\n\nThis movie is also known as \"Hollow Triumph\".\n\n---\n\nDirected by Steve Sekely, produced by Paul Henreid, written by Murray Forbes (novel) and Daniel Fuchs, starring Paul Henreid as John Muller & Dr. Victor Emil Bartok, Joan Bennett as Evelyn Hahn, Eduard Franz as Frederick Muller, Leslie Brooks as Virginia Taylor, John Qualen as Swangron, Mabel Paige as Charwoman, the only person to notice the scar on the wrong side, Herbert Rudley as Marcy, Charles Arnt as Coblenz, George Chandler as Artell, Assistant, Sid Tomack as Aubrey, Manager, Alvin Hammer as Jerry, Ann Staunton as Blonde, Paul E. Burns as Harold, Charles Trowbridge as Deputy, Morgan Farley as Howard Anderson.\n\n---\n\nSource: \"Hollow Triumph\" Wikipedia, The Free Encyclopedia. Wikimedia Foundation, Inc.. 26 February 2012. Web. 02 September 2012. http://en.wikipedia.org/wiki/Hollow_Triumph.\n\nIf you like this movie and our channel, please subscribe: https://goo.gl/0qDmXe\n\n#FilmNoir #TimelessClassicMovies #ClassicFilm",
      "addedAt": "2025-12-23T22:41:44.854Z",
      "thumbnail": "https://i.ytimg.com/vi/6d3NvbCqlRo/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCpnFgq2LuF6cMWugtGA-ziroM8sA",
      "duration": 4944,
      "language": "en",
      "year": 1948,
      "channelName": "Timeless Classic Movies",
      "channelId": "UCOg0aMAXmF3o5m243PxhE5g",
      "regionRestriction": {
        "blocked": [
          "FR",
          "GB"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-23T22:41:44.854Z"
}