{
  "imdbId": "youtube-CP5-eOOSCog",
  "title": "지옥화(1958) / The Flower in Hell (Ji-ok-hwa)",
  "year": 1958,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=CP5-eOOSCog",
      "title": "지옥화(1958) / The Flower in Hell (Ji-ok-hwa)",
      "description": "TBS 영화 해설 : https://youtu.be/dzH6YPR_k9w\n\n'지옥화'  관련 정보 및 소개글이 담긴 소책자 pdf 파일의 다운로드 링크는 아래와 같습니다.   https://www.kmdb.or.kr/history/book/3431\n\n영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00367\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00367\n\n감독(Director) : 신상옥(Shin Sang-Ok)\n출연 : 최은희(소냐),김학(영식),조해원(동식),강선희(주디)\n\n줄거리 : 영식(김학) 일당은 기지촌에서 살면서 미군부대의 창고를 털어 시장에 내다 파는 일을 한다. 동생 동식(조해원)은 형 영식을 설득해 고향으로 데려가기 위해 서울에 왔다가 시장 통에서 형을 발견하고 그를 따라 기지촌으로 들어간다. 동식은 계속 영식을 설득하지만, 영식은 동생에게 먼저 내려가 있으라고 말하고 쏘냐(최은희)에게 큰 건을 하면 시골로 같이 내려가 결혼하자고 한다. 반면 쏘냐는 동식을 마음에 두고, 댄스파티 날 밤에 영식 일당이 물건을 훔치는 동안 동식을 유혹한다. 쏘냐와 동식은 강변에서 밀회를 즐기다 영식에게 들키고, 영식 일당은 미군 수송 열차를 털기 위해 출발한다. 쏘냐는 동식과 도망가기 위해 영식 일당의 범죄를 헌병대에 신고하고 헌병대의 추적을 받은 영식은 총격전 끝에 트럭이 뒤집혀 가까스로 도망친다. 뒤쫓아온 쏘냐는 영식의 칼에 찔려 죽고 영식도 동식에게 어머니를 부탁한다는 말을 남기고 총상으로 죽는다. 동식은 자신과 결혼하고 싶어하던 양공주 주리(강선희)와 함께 시골로 내려간다.\n\nCasts : Kim Hak, Choi Eun-Hee, Cho Hae-Won\n\nSYNOPSIS : Living in a whores' village Young-sik (Kim Hak) and his company rob US military warehouses of goods and sell them on the black market. His younger brother Dong-sik (Jo Hae-won) comes up to Seoul to look for him. Running into his brother at a market, Young-sik takes him into the village. Dong-sik asks Young-sik to go down to their hometown where their mother awaits them, but Young-sik tells him to go ahead on his own. Young-sik proposes to Sonya (Choi Eun-hee) to go home with him and marry him once he had made his fortune. Meanwhile Sonya seduces Dong-sik one night at a dance party while Young-sik and his company are stealing goods. Sonya and Dong-sik have a good time by the riverside. Seeing them, Young-sik goes off to rob US delivery trucks of goods. In order to run away with Dong-sik, Sonya reports this to the Military Police. They chase him and Young-sik is under fire, but he escapes narrowly when a truck turns over. Young-sik stabs Sonya and asks Dong-sik to take care of their mother before he shoots himself. Dong-sik goes home with a prostitute Judy (Kang Seon-hee), who wishes to marry him.",
      "id": "CP5-eOOSCog",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:22:24.992Z"
}