{
  "imdbId": "youtube-fYLusG9oVRk",
  "title": "West of The Brazos (1950, Western) Shamrock Ellison, Lucky Hayden | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=fYLusG9oVRk",
      "title": "West of The Brazos (1950, Western) Shamrock Ellison, Lucky Hayden | Movie",
      "description": "BATTLIN’ BACK TO BACK… FOR THE RICHES OF A RANGELAND EMPIRE.\nAn outlaw impersonates Shamrock in order to lease his land to an oil company for $75,000.\n\nOriginal title: West of The Brazos (1950) AKA: Rangeland Empire\nThis movie is subtitled with many language options.\n\nColorized version https://youtu.be/WT0Y1iqCFjw\n\n\nDirector: Thomas Carr\nWriters: Ron Ormond, Maurice Tombragel, Robert N. Bradbury\nStars: James Ellison, Russell Hayden, Raymond Hatton, Fuzzy Knight, Julie Adams, Tom Tyler & Gene Roth\nGenre: Classics, Western\n\n\n00:00 Full Movie (with subtitles)\n01:00 Adventure unfolds as Lucky and Shamrock encounter danger while on a mission in Wyoming.\n11:28 Law enforcement officers encounter a gang led by Cyclone Kid, mistakenly attacked due to a stolen letter. They plan to track down the gang at Brazos farm.\n15:22 A mysterious letter leads to a plan involving a ranch, oil company, and a doctor in a town without one.\n30:31 Mystery unfolds as Shamrock Ellison searches for his mother and discovers a deceitful man claiming his identity.\n31:19 Legal proceedings unfold as identities are questioned in a Western court.\n36:11 Legal testimony reveals identity dispute over inheritance at Lazy Dollar Ranch.\n40:47 Drama unfolds as Shamrock Ellison claims to be a police chief and a victim of identity theft and robbery.\n43:27 Law enforcement officers plan to capture a suspect and prevent a potential threat in a Western setting.\n47:47 Unforeseen events unfold as a group sets out to find Cyclone and his accomplice in the Wild West.\n\n\n\n@CultCinemaClassics Members-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "fYLusG9oVRk",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:38:39.000Z"
}