{
  "movieId": "youtube-bx3bioDXOuE",
  "title": "Even Angels Eat Beans 1973 | Action, Comedy Movie | Bud Spencer, Giuliano Gemma",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bx3bioDXOuE",
      "id": "bx3bioDXOuE",
      "title": "Even Angels Eat Beans 1973 | Action, Comedy Movie | Bud Spencer, Giuliano Gemma",
      "description": "Al Capone... Get lost! Dillinger... Phooey on you! Here come the funniest crooks since crime began!\nStriving for a higher standard of living, a former ice-cream man and a wrestler convince a well-known mobster to hire them. However, they both soon realize that criminal life is not what they were looking for.\n\nOriginal title: Anche gli angeli mangiano fagiol\n\nDirector: Enzo Barboni\nWriters: Enzo Barboni, Tulio Demicheli, Marie Claire Solleville\nStars: Giuliano Gemma, Bud Spencer, Robert Middleton\nGenres: Action, Comedy, Crime\n\nThis film is available with Italian audio options.  \nGo to ⚙️ to modify your audio/subtitle languages\n\n00:00 Full Movie\n02:41  A condemned ex-police officer, David Steed, is about to face his fourth execution attempt after surviving the gas chamber, hanging, and firing squad.\n07:22  Officer Speed goes on a mission to collect a parking ticket in Creektown, but encounters unexpected events and survives an explosion.\n19:12  A police officer with mysterious superpowers helps solve crimes and catch criminals.\n30:00  Two police officers stumble upon a robbery and investigate.\n49:35  A police officer gets distracted by a famous actress and fails to catch criminals.\n1:00:30  Dave and Sarge try to find an old man while dealing with Dave's superpowers.\n1:05:22  Eelyn is struggling to accept Dave's superpowers, but he is determined to make her like them.\n1:15:40  A corrupt cop loses his superpowers whenever he sees red and gets framed for murder.\n1:25:34  Officer Dave Speed and Sergeant Willy Dunlop stop a gang and rescue Evelyn.\n\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:40:23.996Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/bx3bioDXOuE/maxresdefault.webp?v=67034d80",
      "duration": 7196,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "AG",
          "AI",
          "AR",
          "AW",
          "BB",
          "BO",
          "BQ",
          "BR",
          "BS",
          "BZ",
          "CL",
          "CO",
          "CR",
          "CW",
          "DE",
          "DM",
          "DO",
          "EC",
          "ES",
          "FR",
          "GD",
          "GF",
          "GT",
          "HN",
          "HU",
          "IT",
          "JM",
          "KN",
          "KY",
          "MS",
          "MX",
          "NI",
          "PA",
          "PE",
          "PY",
          "SR",
          "SV",
          "TC",
          "TT",
          "UY",
          "VC",
          "VE",
          "VG"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:40:24.119Z"
}