{
  "imdbId": "youtube-v3DqglkNwFU",
  "title": "Der Fluch der Tang-Dynastie - Jetzt den ganzen Film kostenlos schauen in HD bei Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=v3DqglkNwFU",
      "title": "Der Fluch der Tang-Dynastie - Jetzt den ganzen Film kostenlos schauen in HD bei Moviedome",
      "description": "Jetzt das Aktion-Abenteuer \" Der Fluch der Tang-Dynastie“ in ganzer Länge bei #Moviedome sehen.\n\nLi Zhenmu gerät in die Fänge von Gangstern, die ihn, den früheren exzellenten Kunstfälscher, zwingen, ein altes Gemälde zu fälschen. Denn dem Obergangster Zhao Ying ist während eines Kunstdiebstahls ein großes Malheur passiert. Das wertvolle Bild wurde nämlich beschädigt und nun benötigt er den besten Restaurateur der Welt, um es wieder zu reparieren. \nDoch Li Zhenmu will mit dem Gangster nichts zu tun haben und verweigert seine Dienste. Also setzt dieser die attraktive Min Yue auf Li Zhenmu an, der aber schnell merkt, dass sie etwas im Schilde führt. \nAls dann auch noch seine fast erwachsene Tochter Miao Xin bei ihm auftaucht, um nach dem Tod der Mutter bei ihm zu leben, werden die Dinge kompliziert. Denn bis dato hatte Li seine Tochter noch nicht kennengelernt. Li versucht sich um seine Tochter zu kümmern, doch diese ist extrem trotzig und will ihrem Vater nicht verzeihen. Als sie dann noch mit Hilfe des Security-Manns Teng Wei ihre eigene Entführung inszenieren will, um noch mehr Aufmerksamkeit von ihrem Vater zu bekommen, eskaliert das Geschehen. Wie sich herausstellt, hat nämlich Oberschurke Zhao Ying inzwischen seine Männer losgeschickt hat, um sie tatsächlich zu kidnappen. Miao Xin weiß das natürlich nicht und spielt mit. Dadurch gerät Li Zhenmu in echte Bedrängnis und will das Bild nun doch reparieren. Nun entwickelt sich ein tödliches Verwirrspiel um das wertvolles Gemälde aus der Tang-Dynastie... \n\nMehr #ganzeFilme entdecken: Abonnieren ► http://bit.ly/MoviedomeAbo\n\nJetzt das #Aktion-Abenteuer “ Der Fluch der Tang-Dynastie ” kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere #Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo ►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n\n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzer Film #kostenlos #movie #film #spielfilm #HD #Krimi #Crime #action #thriller #Abenteuer #Action #Krieg #Drama\n \nFilmlänge: 90 Minuten \nOriginaltitel: Hui ma qiang\nRegie: Yuan Li\nFSK: 16\nDVD-Start (DE): 2014\n\n\nDie Darsteller\nSimon Yam in der Rolle des Li Zhenmu\nAnnie Shizuka Inoh in der Rolle der Min Yue\nPei-Pei Cheng in der Rolle des Nie’s Master\nHongbiao Bai in der Rolle des Da Ya\n\nJetzt ganze Filme bei #Moviedome anschauen \n\nFinde Movies in ganzer Länger diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \n\nDen Aktion-Abenteuer \" Der Fluch der Tang-Dynastie“ in voller Länge auf deutsch ansehen.",
      "id": "v3DqglkNwFU",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:35:08.809Z"
}