{
  "imdbId": "youtube-VR4IxevJ1EE",
  "title": "[4K] 장미빛 인생(1994) / Rosy Life(Jangmibich insaeng)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=VR4IxevJ1EE",
      "title": "[4K] 장미빛 인생(1994) / Rosy Life(Jangmibich insaeng)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/04720\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/04720\n\n감독(Director) : 김홍준(Kim Hong-Jun)\n출연 : 최명길(마담),최재성(동팔),차광수(기영),이지형(유진),황미선(미스오),명계남(사격장주인),최종원(한사장),최동준(기관간부),추봉(만화도매상주인),박용팔(인부1),유일문(인부2),홍명구(인부3),주상호(스텐빠사회자),이석구(가출소년아버지),박영노(기관사내),안진수(회사간부),문지현(무희),임진택(불량배1),정진완(불량배2),전대병(불량배3),이승훈(불량배4),김민수(불량배5),원신연(불량배6),대호(불량배7),김한준(가출소년),김은숙(다방아가씨1),이선미(다방아가씨2),박정규(웨이터),배장수(조사장),이세련(스텐빠 여가수),이종현(동팔아이),권성룡(두목),이종상(어깨들),조태봉(어깨들),정봉연(어깨들),김진근(어깨들),김덕형(어깨들),신범식(어깨들),박상현(어깨들),이광수(어깨들),심재원(어깨들),전진태(어깨들)\n\n줄거리 : 가리봉동에 위치한 만화방이란 공간을 축으로 만화방 여주인과 그곳에 드나드는 여러 유형의 인간들, 예를 들면 시장사람들, 다방 레지, 깡패, 경찰의 눈을 피해야하는 지식인 등의 굴절된 삶을 통해 80년대의 슬픔을 간접적으로 이야기하고 있다.\n\nCasts : Choi Myeong-Kil, Choi Jae-Seong, Cha Kwang-Su, Lee Ji-Hyeong, Hwang Mi-Seon, Myeong Kye-Nam, Choi Jong-Won, Choo Bong, Park Yong-Pal, Yoo Il-Mun, Hong Myeong-Ku\n\nSYNOPSIS : A comic book store in Garibong-dong is run by a beautiful woman (Choi Myoung-gil) better known as Madam. This store stays open late into the night, thus attracting varied types of people. Three men hide in this comic book store coincidentally. Dong-pal (Choi Jae-sung) is a gangster who put himself in trouble. Ki-young is a labor agitator, and Eugene (Lee Ji-hyoung) is a guy who avoids public facilities due to a martial arts novel he wrote as a part-time job. Dong-pal attempts to contact Jjako, a guy who disappeared after causing trouble together with Dong-pal only to end up in more trouble. And Eugene falls in love with Miss Oh, a teashop girl who he met at the comic book store. Meanwhile, Dong-pal has a crush on Madam and rapes her when they are all alone. After the incident, Madam expresses contempt toward him and ignores him. But still, Dong-pal isn't happy about Madam being nice to Ki-young.",
      "id": "VR4IxevJ1EE",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:21:17.667Z"
}