{
  "imdbId": "youtube-G68679On-Is",
  "title": "Love on the Dole 1941 - Historical Drama - Directed by John Baxter - Banned film - 4K",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=G68679On-Is",
      "id": "G68679On-Is",
      "title": "Love on the Dole 1941 - Historical Drama - Directed by John Baxter - Banned film - 4K",
      "description": "When Sally Hardcastle (Deborah Kerr) weaves through the stormy streets of Lancashire, she and Larry Meath (Clifford Evans) must dodge more than just hard times—love and loyalty are put to the ultimate test as family fortunes hang by a thread. With Sam Grundy (Frank Cellier) lurking in the wings and Harry Hardcastle (Geoffrey Hibbert) betting on luck, the Hardcastles discover that in the game of survival, the stakes are always sky-high and the odds rarely fair.\n\nAlternative title: Love in misery (1941) \n\nColorized version: https://youtu.be/xjurc5Mku8s\n\n\nDirector: John Baxter\nWriters: Walter Greenwood, Ronald Gow, Barbara K. Emary\nActors: Deborah Kerr, Clifford Evans, George Carney, Mary Merrall\nGenre: History, Drama\nRelease date: 28 June 1941 (UK)\n\nFilm History 101: This film was the first major British film to be banned in 1936 for its unflinching depiction of working-class hardship and social unrest, ultimately released only in 1941 when wartime pressures forced censors to confront the realities it portrayed. Interlaced with humor that brings a ray of sunshine to the pervasive bleakness, this remains a powerful social study of life between the wars, and was a rare \"problem picture\" to come out of Britain at the time.",
      "addedAt": "2025-12-27T00:30:37.096Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/G68679On-Is/maxresdefault.webp?v=68207f84",
      "duration": 5901,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:30:37.196Z"
}