{
  "imdbId": "youtube-VZjEq9cFyCw",
  "title": "The Tall Lie / For Men Only 1952 | Paul Henreid, Margaret Field, Douglas Kennedy | Full Drama Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=VZjEq9cFyCw",
      "title": "The Tall Lie / For Men Only 1952 | Paul Henreid, Margaret Field, Douglas Kennedy | Full Drama Movie",
      "description": "KISS by KISS...It's today's most shocking scandal!\nA college professor begins to suspect that a student's accidental death was tied to his refusal to take part in a traditional \"hazing\" and was no accident.\n\nOriginal title: For Men Only (1952)  AKA: The Tall Lie / Hell Night\n\nColorized version https://youtu.be/RgKe0yo-NjI\n\nDirector: Paul Henreid\nWriters: Herb Margolis, Lou Morheim\nStars: Paul Henreid, Margaret Field, James Dobson, Douglas Kennedy\nGenres: Crime, Drama\n\n\n0:00 A Gripping Tale of Fraternity Initiation and its Consequences: Tall Lie / For Men Only (1952)\n01:40  A person recounts their experiences as a pledge in a fraternity, including physical and emotional hazing.\n16:22  A mother visits her son's professor to discuss his fraternity initiation and signs an affidavit to release the fraternity from responsibility.\n22:02  A controversial fraternity initiation involves the killing of a dog, leading to an investigation.\n34:05  A person is defending their friend's story and expressing disbelief at the current state of their school.\n47:11  A tragic accident occurs during a fraternity initiation, leading to a debate about hazing and its consequences.\n52:46  A discussion takes place regarding fraternity hazing and the potential consequences of opposing it.\n59:52  A conversation between two people reveals a strained relationship and the desire for proof of love.\n1:08:31  A person recounts a conversation where someone talked about their wife leaving them and accused the person of understanding them.\n1:18:54  A phone call leads to confusion and suspicion.\n1:26:21  A conversation takes place about a student who applied for leave of absence and another student who went to pick up his tuxedo for a formal event.\n\n@CultCinemaClassics",
      "id": "VZjEq9cFyCw",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:39:47.099Z"
}