{
  "movieId": "youtube-h_9bvOw8AY4",
  "title": "꿈(1990) / The Dream(Kkum)",
  "year": 1990,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=h_9bvOw8AY4",
      "id": "h_9bvOw8AY4",
      "title": "꿈(1990) / The Dream(Kkum)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요. \nFor detailed information on this film, visit : \n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/04361\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/04361\n\n감독(Director) : 배창호(Bae Chang-ho)\n출연 : 안성기 , 황신혜 , 정보석 , 최종원 , 윤문식\n줄거리 : 때는 통일신라의 전성기. 조신은 십 년째 수행하고 있는 스님이다. 천성이 착하고 순하기만 한 그이지만 어느 날 나들이 나온 그 마을 태수의 딸 달례의 아름다운 자태를 보고 난 후 끓어오르는 애욕을 견디지 못하고 그녀를 겁간해버리고 만다. 그러나 달례는 이미 화랑 모례아손과 정혼한 몸, 죄인이 된 조신과 어찌할 수 없이 그를 따라 나서는 달례. 모례의 집요한 추적에 어느 한 마을에서도 정착해 살 수 없는 그들은 화전민 생활을 하던 중 아들을 잃고 결국 달례는 창녀, 조신은 아편중독의 폐인으로까지 전락하고 만다. 한편 자신이 문둥병에 걸렸음을 안 달례는 환각상태에서 헤어나지 못하고 있는 조신을 뒤로 한 채 하나 남은 딸 달보고를 데리고 떠나가 버린다. 수 십 년 후, 걸인이 되어 떠돌아다니던 조신은 달례가 이미 죽었고 딸은 여승이 되었다는 소식을 듣는다. 바닷가에 초가집을 차려놓고 달례의 목상을 깎으며 속죄의 나날을 보내는 조신. 이런 그에게 칼을 찬 모례가 찾아오지만 세월의 흐름속에 용서만이 구원의 길이었다. 다시 절을 찾아온 백발의 조신은 불당앞에 쓰러진다. 그러나 이것은 한바탕의 꿈이었다.\n\nCasts: Ahn Sung-ki , Hwang Cine , Jung Bo-seog , Choi Chong-won , Yun Mun-sik\nSYNOPSIS : SJoshin is a monk. One day, Dal-lae, a young maiden visits the temple. Dal-lae is a sight to behold and it's difficult for Joshin to control his desire. Drowning in his own earthly desires, Joshin forgets his social standing and attacks Dal-lae while she is bathing. As a result, the two leave the village to form a family. They have two children and own a dye store but Joshin can't possess her heart. Dal-lae sleeps with the employee and torments Joshin. Meanwhile, Mo-rae, Dal-lae's fiancee is out to behead Josin. Later, Dal-lae has become a prostitute and Joshin becomes an opium addict. Many years later, Joshin searches for Dal-lae but the only thing he finds out is that she is dead. He finds out that she died in a village of lepers. Living alone by the sea, Joshin makes a statue of Dal-lae. Mo-rae finally finds Joshin but he has no choice but to forgive Joshin and the old Joshin collapses in front fo the temple. But this was all a dream.",
      "addedAt": "2025-12-26T00:21:38.799Z",
      "thumbnail": "https://i.ytimg.com/vi/h_9bvOw8AY4/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBxbVUd7n-VIZWNC8jkPBR95W4nRA",
      "duration": 5516,
      "language": "ko",
      "year": 1990,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:21:38.931Z"
}