{
  "imdbId": "youtube-PYtvzTUdudI",
  "title": "The Magic Christmas Tree (1964) TRASHCAN CINEMA",
  "year": 1964,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=PYtvzTUdudI",
      "id": "PYtvzTUdudI",
      "title": "The Magic Christmas Tree (1964) TRASHCAN CINEMA",
      "description": "It's a FRIDAY @PizzaFLIX  Christmas SPECIAL\nDirected by: Richard C. Parish\nStarring: Chris Kroesen, Valerie Hobbs,  Darlene Lohnes, Richard C. Parish\n\nStep into the whimsical, bizarre, and unforgettable world of this offbeat holiday fantasy that follows a young boy who, after encountering a witch, uses a magic ring to summon a talking Christmas tree! With the power to grant wishes, things quickly spiral into strange and unexpected territory, including run-ins with an acquisitive giant, a runaway fire engine, and an abducted Santa Claus!\n\nPerfect for fans of cult movies, so-bad-they’re-great films, and nostalgic holiday oddities, The Magic Christmas Tree is a delightful mix of absurdity and holiday charm. Starring Chris Kroesen, Valerie Hobbs, and Richard C. Parish, this 1960s Christmas special delivers low-budget magic, strange humor, and an offbeat holiday story that has made it a must-watch for fans of retro Christmas films.\n\nIf you love classic holiday movies, obscure gems, or just enjoy celebrating the weird side of Christmas cinema, this is the perfect addition to your holiday watchlist. Presented by PizzaFLIX, The Magic Christmas Tree is a cult favorite that promises laughs, nostalgia, and a holiday experience unlike any other.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\n#Cult Christmas Movie #1964 Holiday Special #Santa Claus Fantasy Film #Retro Christmas Cinema #Free on YouTube #PizzaFLIX #Classic Holiday Oddities",
      "addedAt": "2025-12-24T01:05:13.454Z",
      "thumbnail": "https://i.ytimg.com/vi/PYtvzTUdudI/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLC29KugEp-8KsrCoN0GqFehVEYK4Q",
      "duration": 3593,
      "language": "en",
      "year": 1964,
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T01:05:13.454Z"
}