{
  "imdbId": "youtube-0ruH-nqql70",
  "title": "Quicksand (1950, Crime) Mickey Rooney, Jeanne Cagney, Peter Lorre | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0ruH-nqql70",
      "id": "0ruH-nqql70",
      "title": "Quicksand (1950, Crime) Mickey Rooney, Jeanne Cagney, Peter Lorre | Movie",
      "description": "The shadows of crime, where choices sink deep and desperation fuels an obscure odyssey.\nA borrowed $20 sparks a perilous descent for Mickey Rooney's auto mechanic character. Blackmail, betrayal, and a desperate bid for freedom lead him through the shadows of noir, where each choice pulls him deeper into the criminal abyss.\n\nOrigin title: Quicksand (1950)\n\nColorized version https://youtu.be/AbIchqFrizU\n\n\nThis film is subtitled in many language options.\n\nDirector: Irving Pichel\nWriter: Robert Smith \nStars: Mickey Rooney, Jeanne Cagney, Barbara Bates & Peter Lorre\nGenre: Classics, Cult Film, Drama, Crime, Mystery, Film Noir, Romance\n\n\n00:00 Full Movie (with subtitles)\n01:34 A group of friends discuss fishing plans, relationships, and financial struggles in a waterfront setting.\n15:32 Escaping difficult pasts, two individuals bond over shared experiences and stargazing, reflecting on their troubled backgrounds.\n21:16 A man buys a watch on credit and pawns it, facing consequences from a detective for theft.\n23:52 Shorty faces financial troubles and visits Phil's Place for drinks, where he contemplates his debts and gets involved in a confrontation.\n32:14 Danny gets involved in a shady business deal regarding a stolen car and a mysterious green sedan.\n40:53 A man gets involved in a crime and must come up with $3000 to avoid trouble, leading to a risky heist.\n49:49 A man discovers a large sum of money and faces consequences in a crime-filled plot.\n58:15 A woman is caught up in a crime involving stolen money, a murdered man, and a deceptive boyfriend.\n1:03:58 A man confesses to murder and plans to flee to Mexico with the help of a woman, resorting to kidnapping a lawyer for assistance.\n1:08:49 A man recounts a crime story to a detective, leading to a plan to escape before the police arrive.\n1:13:38 A crime unfolds as authorities investigate shootings and a suspect is pursued.\n\n\n@CultCinemaClassics Members-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:38:40.831Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/0ruH-nqql70/maxresdefault.webp?v=65cdac5c",
      "duration": 4750,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:38:40.979Z"
}