{
  "movieId": "youtube-UqqB0HUFmUU",
  "title": "마부(1961) / A Coachman (Mabu)",
  "year": 1961,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=UqqB0HUFmUU",
      "id": "UqqB0HUFmUU",
      "title": "마부(1961) / A Coachman (Mabu)",
      "description": "TBS 영화 해설 : https://youtu.be/UGL7WiCz-Ns\n\n영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00633\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00633\n\n영화글 :https://www.kmdb.or.kr/story/10/5266\n\n감독(Director) : 강대진(Kang Dae-jin)\n출연 : 김승호(춘삼),신영균(큰 아들 수업),황정순(수원댁),조미령(옥녀),황해(창수),엄앵란(옥희),김희갑(김서기),주선태(마주),장혁,최성호,최지희(미자),나정옥,윤정란,김진,남춘역,장훈,정철,김수천,황도석,석운아,방연실,김왕국,임해림,윤인자\n\n줄거리 : 짐수레를 끄는 홀아비 마부인 춘삼(김승호)은 고등고시를 공부하는 장남 수업(신영균)과, 언어 장애 탓에 못된 남편에게 맞고 쫓겨 오기 일쑤인 맏딸 옥례(조미령), 가난한 집안 형편에 불만을 품고 신분 상승을 꿈꾸는 작은딸 옥희(엄앵란), 도둑질을 일삼는 막내 대업 등 네 자녀와 함께 살고 있다. 마주(주선태) 집의 식모살이를 하고 있는 수원댁(황정순)은 가난한 마부인 춘삼을 물심양면으로 도와주고 둘 사이에는 애틋한 감정이 오간다. 장남은 세 번이나 고등고시에 떨어지고, 큰딸은 남편의 학대에 못 이겨 한강에 투신해 자살하며, 작은딸도 부잣집 아들에게 농락당하는 등 온 가족이 시련을 겪는 가운데, 설상가상으로 춘삼은 사장의 자동차에 말이 놀라 다리까지 다친다. 게다가 마주는 말을 팔겠다며 마부 일을 그만두게 한다. 수원댁은 식모 일을 하며 모아둔 돈으로 그 말을 몰래 사서 춘삼에게 돌려준다. 마침내 장남 수업이 고시에 합격하던 날, 모두 모인 가족들은 수원댁을 어머니로 모신다. 새로운 희망에 부푼 춘삼의 가족들은 눈이 내리는 중앙청 거리를 함께 걷는다.\n\nCast : Kim Seung-ho, Shin Young-kyun, Hwang Jeong-sun, Cho Mi-ryeong\n\nSYNOPSIS (CONTAINS SPOILERS) : Chun-sam (Kim Seung-ho) is a single father and a coachman who pulls his master's cart for a living. His first son Su-eob (Shin Young-kyun) studies for a higher civil service examination and his first daughter (Cho Mi-ryung) is a mute who is married but often sent home. His second son does nothing but fight all the time and his youngest daughter Ok-hee (Um Aing-ran) is discontent about her poor family and dreams of a better life through marriage. Suwondaek (Hwang Jung-seun) works as a housekeeper of the coach owner (Joo Sun-tae) and helps the poor coachman Chun-sam in every way she can. There is an air of romance between the two. Chun-sam's family experiences hardship - his first son always fails the exam; his first daughter who could not bear her husband's abuse attempts to commit suicide; his youngest daughter is cajoled by a swindler; and to make matters worse, Chun-sam is hit by a car and ends up with a cast on his leg. When their father gets into the accident, Su-eob begins to pull the cart himself for his father and when the coach owner decides to sell the horse, Suwondaek buys the horse with the money she has saved her whole life and returns the horse to the coachman. Finally, Su-eob passes the civil service exam and on that very day, Chun-sam and Suwondaek get engaged. Chun-sam's family is happy with new hopes filling their hearts and take a walk on a snowy street together.",
      "addedAt": "2025-12-26T00:25:30.963Z",
      "thumbnail": "https://i.ytimg.com/vi/UqqB0HUFmUU/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBhr0_iYQHeH5kB7FoAjH0Lu26GCw",
      "duration": 5958,
      "language": "ko",
      "year": 1961,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:25:30.986Z"
}