{
  "movieId": "youtube-YY9pwGTk6n8",
  "title": "The Ghoul (1933, Horror) An Ancient Curse Is About To Be Unleashed.",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YY9pwGTk6n8",
      "id": "YY9pwGTk6n8",
      "title": "The Ghoul (1933, Horror) An Ancient Curse Is About To Be Unleashed.",
      "description": "The Master of Macabre in an uncanny mystery that out-thrills \"Frankenstein\" and \"Dracula.\" \nBen Dragore, a knife-wielding, enigmatic Egyptian, is on a quest to find a sacred jewel stolen from an ancient tomb. The thief informs him that he sold it to Professor Morlant, a devoted Egyptologist who believes fervently in the pagan power of the ancient Egyptian gods. Morlant, dying from a mysterious disfiguring ailment, instructs his loyal manservant to wrap the jewel in his hand and issues a warning of dire consequences if his final wishes are disregarded. Following Morlant's burial in an Egyptian-style tomb on his estate, a thief steals the valuable stone from the corpse. As the ghastly-looking deceased man resurrects at the next full moon to seek revenge, leaving all who seek the jewel at the mercy of the ancient gods' wrath.\n\nOriginal title: The Ghoul (1933) \nAlternative titles: Dragore, El vampiro, Dragore, O Fantasma, O Zumbi, Bes: Kletba fantomú, El resucitado, Kleopatran timantti, Le fantôme vivant, O Ressuscitado, Упырь, Der Ghul, Вампирът, 食尸鬼, Гуль, Ghoul, Το φάντασμα\n\nColorized version https://youtu.be/Ubs5b8fWRj8\n\n\nDirector: T. Hayes Hunter\nWriters: Frank King, Leonard Hines, Roland Pertwee\nStars: Boris Karloff, Cedric Hardwicke, Ernest Thesiger, Dorothy Hyson\nGenres: Action, Drama, Horror, Mystery, Romance\n\n\nFun Fact: This is the First British horror movie of the sound era.",
      "addedAt": "2025-12-27T00:34:23.117Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/YY9pwGTk6n8/maxresdefault.webp?v=66bd7c14",
      "duration": 4811,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:34:23.224Z"
}