{
  "imdbId": "youtube-_3PohBAG_7Q",
  "title": "Justice - Kein Erbarmen - Western - Jetzt ganzen Film kostenlos schauen in HD bei Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=_3PohBAG_7Q",
      "id": "_3PohBAG_7Q",
      "title": "Justice - Kein Erbarmen - Western - Jetzt ganzen Film kostenlos schauen in HD bei Moviedome",
      "description": "Jetzt den Western \"Justice – Kein Erbarmen“ in ganzer Länge bei #Moviedome sehen.\n\n1870: Fünf Jahre nach Ende des amerikanischen Bürgerkriegs führt die Suche nach dem Mörder seines Bruders den US Marshal McCord in eine kleine Minenstadt. Sein Ziel: den verlorenen Krieg noch einmal neu zu entfachen - und dann zu gewinnen. McCord sieht sich plötzlich einer Aufgabe gegenüber, bei der es um weit mehr geht als seinen persönlichen Rachefeldzug.\n\nMehr #ganzeFilme entdecken: Abonnieren ► http://bit.ly/MoviedomeAbo\n\nJetzt den #Western \"Justice – Kein Erbarmen“ kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere #Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo \n►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzer Film #kostenlos #movie #film #spielfilm #HD #Krimi #Crime #action #thriller #Abenteuer #Krieg #Drama #Western #Justice #KeinErbarmen #Rache \n \nEnglischer Originaltitel: Justice\nFilmlänge: 91 Minuten \nRegie: Richard Gabai\nFSK: 16\nDVD-Start (DE): 2020\n\nDie Darsteller\n\nJamie-Lynn Sigler (bekannt aus „The Sopranos“, „Entourage“, „I Do“) in der Rolle der Melissa\n\nStephen Lang (bekannt aus „Avatar-Aufbruch nach Pandora“, „Don’t Breathe“, „Tombstone“, „Blutmond“) in der Rolle des Mayor Pierce\n\nJackson Rathbone (bekannt aus „Die Leende von Aang“, „Eclipse-Biss zum Abendrot“, „Twilight-Biss zum Morgengrauen“, „Breaking Dawn-Bis(s) zum Ende der Nacht) in der Rolle des Thomas McCord\n\nLesley-Anne Down (bekannt aus „Fackeln im Sturm“, „Reich und schön“, „Inspektor Clouseau – Der beste Mann bei Interpol“) in der Rolle der Elisabeth\n\nEllen Hollman (bekannt aus „Matric Resurrections“, „Spartacus: War of the Damned“, Love and Monsters”) in der Rolle der Ginny\n\nJetzt ganze Filme bei #Moviedome anschauen \n\nFinde Movies in ganzer Länge diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \n\nJetzt den Western \"Justice – Kein Erbarmen“ in voller Länge auf deutsch ansehen.",
      "addedAt": "2025-12-26T00:34:53.594Z",
      "thumbnail": "https://i.ytimg.com/vi/_3PohBAG_7Q/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBu64QzoBuBECIvF1FwcPW5rtxOTg",
      "duration": 5509,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:34:53.701Z"
}