{
  "imdbId": "youtube-7F1T8YOMtvE",
  "title": "The Aztec Mummy Against the Humanoid Robot 1958 (Horror, Sci-Fi) Directed by Rafael Portillo",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=7F1T8YOMtvE",
      "id": "7F1T8YOMtvE",
      "title": "The Aztec Mummy Against the Humanoid Robot 1958 (Horror, Sci-Fi) Directed by Rafael Portillo",
      "description": "Epic Clash Between Mummy and Man-Made Monster - in a fight to the Death!\nThe evil Dr. Krupp, also known as \"the Bat,\" resumes his quest to steal a valuable Aztec treasure from the tomb of Popoca, the Aztec Mummy. Constructing a cyborg with a human brain, Krupp prepares to confront the vengeful mummy. As Krupp pilfers the mummy's tomb and triggers Popoca's fury, a brutal battle ensues between the reanimated adversaries. The robot's electrifying attacks weaken the mummy until Dr. Almada intervenes and halts the mechanical menace. Enraged, Popoca destroys the robot and dispatches Dr. Krupp and his ally Tierno before retreating to find eternal peace.\n\nOriginal title: La Momia Azteca vs El Robot Humano (1958) \n\nBlack & White version: https://youtu.be/iplNK6vZzl4\n\n\nDirector: Rafael Portillo\nWriters: Guillermo Calderón, Alfredo Salazar\nGenres: Horror, Sci-Fi\n\nMain Cast: \nRamón Gay as Dr. Eduardo Almada\nRosita Arenas as Flor Almada\nCrox Alvarado as Pinacate\nLuis Aceves Castañeda as Dr. Krupp \nArturo Martínez as Tierno\nÁngel Di Stefani as Popoca, the Mummy\nAdolfo Rojas as The Human Robot\n\n\n\n00:00 - Full Colorized Movie (with subtitles)\n00:04 - Hypnotic past life regression uncovers an Aztec love story and a cursed warrior.\n09:38 - Discoveries in an Aztec tomb unveil ancient treasures and a deadly curse.\n16:59 - A cursed Aztec warrior rises from the dead to guard his eternal treasure.\n22:09 - Betrayal and revenge unfold through a mummy, criminals, and a twisted experiment.\n28:22 - A mysterious plan for revenge stirs tension and confusion among the characters.\n40:18 - Investigators uncover the mummy's intact artifacts in a chilling cemetery.\n43:37 - Detectives chase The Bat and his criminal gang after a string of daring robberies.\n48:42 - A scientist creates a powerful humanoid robot for sinister purposes.\n55:49 - An epic battle erupts between an Aztec mummy and a humanoid robot in this sci-fi horror clash.\n\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:34:37.851Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/7F1T8YOMtvE/maxresdefault.webp",
      "duration": 3867,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:34:38.070Z"
}