{
  "imdbId": "youtube-1WK8SCFoLf8",
  "title": "Woman in the Dark 1934 (Film-Noir, Crime) Fay Wray, Ralph Bellamy, Melvyn Douglas | 4K",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1WK8SCFoLf8",
      "id": "1WK8SCFoLf8",
      "title": "Woman in the Dark 1934 (Film-Noir, Crime) Fay Wray, Ralph Bellamy, Melvyn Douglas | 4K",
      "description": "When the past catches up, love becomes the ultimate escape.\nA recently released prisoner lives alone in his cabin so that his bad temper won’t get him back in any more trouble, but his peaceful existence is disrupted when a mysterious woman arrives.\nFrom the book \"Woman in the Dark\", by Dashiell Hammett.\n\nColorized version https://youtu.be/sT9e76-RPik\n\n\nOriginal title: Woman in the Dark (1934) AKA: Woman in the Shadows\nThis film is subtitled in many languages.\n\nDirector: Phil Rosen\nWriters: Dashiell Hammett, Sada Cowan, Charles Williams\nStars: Fay Wray, Ralph Bellamy, Melvyn Douglas, Roscoe Ates\nGenres: Crime, Drama, Film Noir, Literary\n\n\n00:00 Full Movie (with subtitles)\n01:54 Summary of a film where a released prisoner faces challenges and a woman stirs up gossip in a small town.\n08:30 Drama unfolds as a woman seeks refuge at a stranger's house, causing tension and revealing hidden motives.\n19:50 A woman faces threats and manipulation from a dangerous man, leading to a tense situation.\n24:00 A woman's past catches up with her leading to a desperate escape with a man involved in a criminal situation.\n36:02 A woman seeks refuge with friends after a criminal incident, leading to unexpected twists and turns.\n39:05 Summary of a 1934 film involving a woman, jewelry, and a lawyer, leading to a chase and confrontation.\n46:39 Mystery unfolds as characters navigate legal troubles, betrayal, and hidden motives in a noir setting.\n55:18 Intrigue and deception unfold as characters navigate a web of relationships and criminal activities.\n1:01:01 A woman returns to a dangerous situation to uncover the truth behind a crime.\n\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:37:08.803Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/1WK8SCFoLf8/maxresdefault.webp?v=66607d7d",
      "duration": 3993,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "CA",
          "CZ",
          "IT",
          "SK",
          "US"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:37:08.957Z"
}