{
  "movieId": "youtube--1UuKmwVKpY",
  "title": "When it flies, Someone dies! | The Bat (1959) Colorized Movie | Vincent Price, Agnes Moorehead",
  "year": 1959,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=-1UuKmwVKpY",
      "id": "-1UuKmwVKpY",
      "title": "When it flies, Someone dies! | The Bat (1959) Colorized Movie | Vincent Price, Agnes Moorehead",
      "description": "Mystery writer Cornelia Van Gorder has rented a country house called “The Oaks”, which not long ago was the scene of some murders committed by a strange and violent criminal known as “The Bat”. Meanwhile, the house’s owner, bank president John Fleming, has recently embezzled one million dollars in securities and has hidden the proceeds in the house, but is killed before he can retrieve it.\n\nOriginal title: The Bat (1959)\n\nBlack & White version: https://youtu.be/cDfYhyhyCVE\n\nDirector: Crane Wilbur\nWriters: Crane Wilbur, Crane Wilbur \nStars: Vincent Price, Agnes Moorehead, Gavin Gordon\nGenres: Colorized classics, Horror, Mystery, Thriller\n\nThis film is available with English, French, German, Italian & Spanish dubbed audio.  Go to video settings ⚙️  to change your audio / subtitle language options.\n\n00:00 Full Movie\n01:08  Miss Cornelia Van Gorder rents a house called the Oaks for the summer, where mysterious events unfold.\n06:11  A bank officer and his doctor plot to steal a million dollars worth of securities and fake the officer's death.\n12:42  A woman and her maid experience strange occurrences in their house, including the presence of a notorious criminal called the Bat.\n18:30  Miss Van Gorder and her maid encounter mysterious events in their new house, including a potential rabid bat.\n30:03  A bat bites a maid in the house, leading to concerns about rabies and a missing fortune.\n33:09  Miss Van Gorder receives a signed first edition of a book from Judie, and they discuss the new servants and a leaking pipe in the house.\n43:47  A murder occurs in a house and the Bat is believed to be the killer.\n46:49  A police lieutenant investigates a series of murders committed by a mysterious criminal known as The Bat.\n55:45  A mysterious killer known as the Bat terrorizes a group of people in a house.\n1:10:01  Miss Van Gorder goes missing and the house is in chaos as the detective investigates the murders and the disappearance of Dr. Wells.\n1:18:01  The Bat is revealed to be Warner, who was trying to hide stolen money, and Lieutenant Anderson solves the case.\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:40:45.476Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/-1UuKmwVKpY/maxresdefault.webp?v=65273f1c",
      "duration": 4804,
      "language": "en",
      "year": 1959,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:40:45.581Z"
}