{
  "imdbId": "youtube-LOk7kc5SeIs",
  "title": "The Sleeping Tiger (1954, Film-Noir) Wild temptation turns a saint into a sinner",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=LOk7kc5SeIs",
      "title": "The Sleeping Tiger (1954, Film-Noir) Wild temptation turns a saint into a sinner",
      "description": "Hidden deep within every woman is a Sleeping Tiger ... when aroused it can turn a saint into a sinner!\nFrank Clemmons, a convicted criminal, agrees to a rehabilitation program after breaking into a psychotherapist's home. However, the psychotherapist's wife, Glenda, becomes attracted to him, leading to dangerous consequences.\n\nThe Sleeping Tiger is a 1954 British film noir directed by Joseph Losey.\n\n\nMain Actors:\nDirk Bogarde - Frank Clemmons\nAlexis Smith -  Glenda Esmond\nAlexander Knox - Dr. Clive Esmond\nHugh Griffith - The Inspector\nPatricia McCarron - Sally the maid\nMaxine Audley - Carol\nGlyn Houston - Bailey\n\nBlack & White version: https://youtu.be/at6lWjNFblM\n\n\n00:00 -  Full Movie with subtitles\n01:55 - Dr. Esmond confronts Frank Clemens, a young criminal, and offers him a chance at rehabilitation instead of prison.\n05:26 - Glenda Esmond returns home, skeptical of Frank's presence, and tension builds between the household members.\n20:47 - Frank begins to challenge Glenda's composed exterior, leading to a heated exchange that reveals deeper emotions.\n41:08 - Glenda and Frank's relationship takes a dangerous turn as they grow closer, testing the boundaries of trust and loyalty.\n1:00:32 - Frank's criminal past resurfaces, and Inspector Simmons intensifies his investigation, putting everyone on edge.\n1:15:21 - Together they plan to escape together, but their conflicting emotions and loyalties create chaos.\n1:22:50 - A tragic confrontation leads to Glenda's desperate actions, culminating in a fatal car accident.\n\n@CultCinemaClassics",
      "id": "LOk7kc5SeIs",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:33:24.109Z"
}