{
  "imdbId": "youtube-DvcPmd1JEmE",
  "title": "Das Massaker von Katyn (KRIEGSFILM in voller Länge, Kriegsdrama Film auf Deutsch, zweiter Weltkrieg)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=DvcPmd1JEmE",
      "title": "Das Massaker von Katyn (KRIEGSFILM in voller Länge, Kriegsdrama Film auf Deutsch, zweiter Weltkrieg)",
      "description": "💙 Filme auf Deutsch anschauen in voller Länge - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Im September 1939 überfallen Nazi-Deutschland und die Sowjetunion Polen. Anna sucht verzweifelt ihren Mann Andrej, einen polnischen Offizier. Doch kurz nach dem Wiedersehen wird er verschleppt und zusammen mit tausenden anderen in den Wäldern von Katyn von der sowjetischen Armee ermordet – ein Verbrechen, das später den Nazis angelastet werden soll...\n\nDAS MASSAKER VON KATYN (2007)\nOriginaltitel: Katyn\nMit: Andrzej Chyra, Maja Ostaszewska, Artur Zmijewski\nRegie: Andrzej Wajda\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nAls die Sowjetunion am 17. September 1939 in Polen einmarschiert, verlässt Anna Aleksandrowna ihr Haus in Krakau, um nach ihrem Mann, dem polnischen Hauptmann Andrzej, zu suchen. Sie findet ihn zusammen mit anderen Offizieren, die von der Roten Armee gefangen genommen wurden, aber einige Minuten später wird er in einen Zug gestoßen, der alle polnischen Offiziere in ein Gefangenenlager in Kozelsk in Russland bringen wird. Anna und ihre Tochter Nika sitzen nun in der sowjetischen Besatzungszone fest und können nicht nach Krakau in der deutschen Zone zurückkehren, bis ein mutiger russischer Hauptmann ihnen zur Flucht verhilft. Am 3. April 1940 wird Andrzej aus dem Gefangenenlager in Kozelsk in den Wald von Katyn gebracht, wo Tausende von polnischen Offizieren getötet werden. Im Jahr 1943 erobern die Deutschen dieses Gebiet und finden die Massengräber. Am 13. April 1943 beginnen sie, die Namen der identifizierten Leichen über Lautsprecher in Krakau zu verkünden. Anna ist froh, dass Andrzej auf keiner der Katyn-Listen steht, was ihr etwas Hoffnung gibt. Am 18. Januar 1945 befreit die Rote Armee Krakau von den Nazis. Die Russen machen die Deutschen für das Massaker von Katyn verantwortlich und behaupten, es sei 1941 und nicht 1940 geschehen. Jeder weiß, dass dies nicht stimmt, aber diejenigen, die sich weigern, die sowjetische Version zu akzeptieren, werden von der Roten Armee inhaftiert oder getötet.\n#Netzkino #ganzerFilm #kriegsfilm\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "DvcPmd1JEmE",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:55:16.127Z"
}