{
  "imdbId": "youtube-T0MiZnCvb7s",
  "title": "Spring of Korean Peninsula (Ban-do-ui bom)(1941)",
  "year": 1941,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=T0MiZnCvb7s",
      "title": "Spring of Korean Peninsula (Ban-do-ui bom)(1941)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00151\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00151\n\n영화글 : https://www.kmdb.or.kr/story/10/1019\n\n감독(Director) : 이병일(Lee Byung-il )\n출연 : 김일해(이영일),김소영(김정희, 춘향),서월영(허훈(영화감독)),백란(안나),김한(한계수),복혜숙(모경숙),이금룡(영화사사장),최남호(작곡가),모리 타츠조(김창수),현지섭(사법주임),손일평(신문사사장),정두천(집주인),이재호(연가 선생),강정애(하숙집 할머니),권영팔(몽룡),윤정룡(향단),전택이(방자)\n\n줄거리 : 영화 ᐸ춘향전ᐳ을 만들던 중 이영일(김일해)에게 친구의 동생이자 영화배우 지망생인 김정희(김소영)가 찾아온다. 영일은 영화에 마땅한 자리가 없어 정희를 음반회사에 소개시켜주고 돌봐준다. ᐸ춘향전ᐳ의 여주인공 안나(백란)는 영일에게 호감을 보이지만 정작 영일은 그녀에게 관심이 없고, 안나의 애인이자 뒤를 봐주던 음반회사의 문예부장 한계수(김한) 역시 정희에게 관심을 보인다. 한편 영일과 함께 영화 〈춘향전〉을 촬영하던 감독 허훈(서월영)은 안나가 말썽을 부리자 다툼 끝에 그녀를 내치고, 대신 정희를 춘향으로 기용한다. 정희의 투입으로 촬영이 순조롭게 진행되던 즈음, 영일과 허훈은 제작비 부족으로 곤란을 겪게 되고, 영일은 공금에 손을 대고 감옥에 갇힌다. 정희는 영일의 면회를 가지만 만나지 못한다. 영일이 안나의 도움으로 이미 풀려나왔기 때문이다. 수감 생활로 심신이 허약해진 영일은 안나의 극진한 간호를 받아 건강을 회복한다. 그 사이에 영화인들의 의기투합으로 반도영화주식회사가 설립되고, 회사의 든든한 지원으로 ᐸ춘향전ᐳ이 완성되어 대성공을 거둔다. ᐸ춘향전ᐳ 개봉을 축하하기 위해 영일이 돌아오지만, 내심 영일의 행방을 걱정했던 정희는 그의 옆에 안나가 있는 것을 야속해하며 쓰러진다. 이후 정희는 영일에 대한 오해를 풀고, 둘은 동료들의 배웅을 받으며 일본영화계 시찰을 위해 기차에 몸을 싣는다.\n\nCasts : Kim So-wen, Kim Il-hae, Seo Wel-young, Yoon Jung-ran, Bok Hae-sook.\n\nSYNOPSIS : Film producer Lee Yeong-il is introduced to Jeong-hee, his friend's little sister.  Unable to find an appropriate slot for her in his movie, he gets her a job in a record company and watches out for her.  In time, their love grows deeper.  Meanwhile, director Heo Hoon, who is making the film 'The Story of Chun-hyang' with Yeong-il, fires the lead actress of the film, Anna, when she causes too much trouble.  Instead, Jeong-hee is hired in her place.  Just as Jeong-hee proves herself worthy of the casting and the film-making progresses smoothly, Yeong-il and Heo Hoon face financial difficulties.  Yeong-il turns to embezzlement in desperation and is thrown in jail.",
      "id": "T0MiZnCvb7s",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:24:44.535Z"
}