{
  "movieId": "youtube-bT_ciQ8NrDo",
  "title": "Django the Last Killer (Western, 1967) George Eastman, Dragomir Bojanic-Gidra | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=bT_ciQ8NrDo",
      "id": "bT_ciQ8NrDo",
      "title": "Django the Last Killer (Western, 1967) George Eastman, Dragomir Bojanic-Gidra | Full Movie",
      "description": "Lessons in death lead to the ultimate showdown...\nRamon’s parents are killed by men of landowner John Barrett. While trying to get revenge, Ramon is wounded but has saved the life of Rezza, an old disillusioned killer. While nursing his wounds, the men become reluctanfriends and Rezza teaches Ramon the art of shooting, surviving and the loneliness a killer has to bear. Ramon becomes threat for Barrett, the landowner engages Rezza to kill Ramon.\n\nOriginal title: L'ultimo killer (1967)\n\nThis film has English and Italian audio options, and subtitles in many more languages.\n\nDirector: Giuseppe Vari\nWriter: Augusto Caminito\nStars: George Eastman, Dragomir Bojanic-Gidra, Dana Ghia\nGenres: Drama, Western\n\n\n00:00 Full Movie (with subtitles)\n00:18 A confrontation between Ramón and Barrett over land ownership leads to tension and violence.\n11:52 Django confronts a group of thieves and is accused of theft in a Western setting.\n17:04 Action-packed dialogue between characters planning a high-paying job involving violence and deception in the Wild West.\n26:48 A summary of a Western movie involving a gambling dispute, a shooting, and a love triangle.\n44:45 Lessons in gunfighting and life from a seasoned cowboy in a beautiful valley.\n51:45 The life of a lone killer in the Wild West, learning survival instincts and facing the challenges of friendship and betrayal.\n58:08 Django confronts a deceitful attacker, leading to a tense standoff and a revelation about retirement plans.\n1:05:00 A summary of the Western movie 'Django the Last Killer' involving a character named Ramón and a deal for killing.\n1:17:58 A tale of revenge and justice unfolds as Django confronts his past and seeks vengeance against Barrett in a Wild West setting.\n\n\n@CultCinemaClassics .\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:39:11.627Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/bT_ciQ8NrDo/maxresdefault.webp?v=65a9be08",
      "duration": 4997,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "ES",
          "IT"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:39:11.735Z"
}