{
  "imdbId": "youtube-vJgpNvHxjNA",
  "title": "Anarchie (GANGSTER THRILLER | Unzensiert exklusiv für Netzkino-Members)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=vJgpNvHxjNA",
      "title": "Anarchie (GANGSTER THRILLER | Unzensiert exklusiv für Netzkino-Members)",
      "description": "ANARCHIE (2014)\nOriginaltitel: Cymbeline\nMit: Ethan Hawke, Milla Jovovich, Ed Harris, Dakota Johnson, Penn Badgley\nRegie: Michael Almereyda\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nIrgendwo in den USA, in einer namenlosen Kleinstadt.\nHier führt der Drogenboss Cymbeline (Ed Harris) seine Biker-Gang, die Britons, mit eiserner Hand. Seine Frau Queen (Milla Jovovich) ermuntert ihn, der Polizei fortan keinerlei Schutzgeld mehr zu zahlen, weswegen ein regelrechter Krieg zwischen den beiden Seiten entbrennt. Unterdessen hat sich seine zarte Tochter, Imogen (Dakota Johnson) in Posthumus (Penn Badgley), ein Mitglied seiner eigenen Bande verliebt. Doch Cymbline hat andere Pläne für Imogens Zukunft im Sinn. Was der liebende Vater nicht weiß, ist, dass die beiden bereits heimlich geheiratet haben...\nDa kommt der hinterlistige Iachimo (Ethan Hawke) ins Spiel, der wirklich keinerlei Skrupel kennt: Er wettet mit Posthumus, dass es ihm gelingt, seine Frau Imogen zu verführen. Um die Wette zu gewinnen, verletzt Iachimo ihre Privatsphäre. Während sie schläft, fotografiert er ihren Intimbereich und kann so einen vermeintlichen Beweis dafür vorlegen, dass er mit Imogen geschlafen hat. Posthumus reagiert wütend und rasend vor Eifersucht beauftragt er seinen Biker-Kumpel Pisanio (John Leguizamo) damit, die der Untreue verdächtigte Frau zu töten. Doch dieser führt den Auftrag nicht aus, sondern hilft Imogen unterzutauchen und wird dafür wiederum von Cymbeline fürchterlich bestraft.\nDer Bandenkrieg eskaliert nun immer weiter. Denn auch Cymbelines Frau Queen wittert für sich und ihren mit in die Ehe gebrachten Sohn Cloten (Anton Yelchin) die Chance, die Macht über die Biker-Gang zu übernehmen. Wird es ihr gelingen den eigenen Mann Cymbeline vom Thron zu stoßen oder kann sogar der skrupellose Iachimo das Ruder übernehmen?\n#Netzkino #ganzerFilm #EthanHawke\n\nCOPYRIGHT:\nSpotfilm Networx GmbH is a serious and legal video on demand company located in Berlin, Germany. We are holding a proper license for all of our published movies. For any questions contact copyright@spotfilm-networx.com",
      "id": "vJgpNvHxjNA",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-23T23:59:47.627Z"
}