{
  "imdbId": "youtube-OLnNmQy4oT0",
  "title": "Speak Easily (MGM, 1932) BUSTER KEATON🍕 THELMA TODD🍕 JIMMY DURANTE",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=OLnNmQy4oT0",
      "title": "Speak Easily (MGM, 1932) BUSTER KEATON🍕 THELMA TODD🍕 JIMMY DURANTE",
      "description": "PizzaFLIX Presents CLASSIC MOVIE MONDAY\nStars: Buster Keaton, Jimmy Durante, Thelma Todd, Charlotte Greenwood\nDirected by: Lloyd Bacon\nhttps://www.youtube.com/playlist?list=PLmHgXUJMN1TUzR3YhpzxOuBM6YrZ91UVG\n🍕 NEW HD UPGRADE🍕 \nHold onto your hats! The Great Stone Face, Buster Keaton meets motor-mouthed dynamo Jimmy Durante in MGM’s rip-roaring backstage romp! Stealing scenes alongside them is the Ice Cream Blonde Thelma Todd—bringing her Hal Roach slapstick chops into the spotlight. Three comedy greats, one pre-Code gem… and a whole lotta laughs.\n\nSet in a seaside resort hotel, the story follows two couples who decide to switch partners temporarily—leading to a series of comedic misunderstandings, flirtations, and surprises. Known for her tall frame and comedic timing, Charlotte Greenwood lights up the screen with her signature high kicks and razor-sharp wit. With a supporting cast including Patsy Ruth Miller, Grant Withers, and Claude Gillingwater, the film delivers classic farce with a musical twist.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\nBe sure to LIKE, COMMENT, and SUBSCRIBE for more rare, vintage films every WEEK on PizzaFLIX.\n\nAdapted from the stage hit by Oliver Morosco and Elmer Harris, this screen version retains the original's playful tone and lively spirit, enhanced by synchronized sound and early musical numbers. As one of Warner Bros.'s early ventures into sound-era entertainment, the film captures a unique moment in cinema history—when Broadway stars met the talkies.\n\nIdeal for fans of early musicals, stage-to-screen adaptations, and vintage Hollywood comedies.\n\n#fullmovie #Pre-CodeComedy #CharlotteGreenwood #PreCodeHollywood#ClassicMovieMonday #PizzaFLIX",
      "id": "OLnNmQy4oT0",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "relatedMovies": [],
  "collections": [
    {
      "id": "buster-keaton",
      "name": "Buster Keaton"
    }
  ],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-24T01:02:59.115Z"
}