{
  "imdbId": "youtube-wCK9VfNF9EM",
  "title": "A Woman After a Killer Butterfly (Sal-innabileul jjochneun yeoja)(1978)",
  "year": 1978,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=wCK9VfNF9EM",
      "id": "wCK9VfNF9EM",
      "title": "A Woman After a Killer Butterfly (Sal-innabileul jjochneun yeoja)(1978)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/03288\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/03288\n\n영화글  \nhttps://www.kmdb.or.kr/story/10/891\nhttps://www.kmdb.or.kr/story/74/1646\nhttps://www.kmdb.or.kr/story/177/4784\n\n감독(Director) : 김기영(Kim Ki-Young)\n출연 : 남궁원,김자옥,김정철,김만,박암,이향,여포,유순철,이강배,김소조,정재희,이화시\n\n줄거리 : 우연히 만난 여인이 권한 음료수를 마시는 바람에 죽음의 문턱까지 갔다 살아온 주인공. 그 후 어쩐지 삶의 의지를 잃은 그는 몇 번이고 자살을 기도하지만 그렇다고 특별한 이유가 있어서도 아니다. 다만 “하루에 밥을 몇 번을 먹어도 배가 고프니 그만 죽어야겠다”며 기둥에 목을 매는 그. 그런 그에게 한 책장수가 찾아와 삶의 의지를 설파한다. 책장수는 사소한 다툼 끝에 죽게 되지만 몇 번을 죽어도 그 때마다 되살아나 ‘삶의 의지’를 외친다. 기이한 일을 겪은 주인공은 친구와 함께 오래 된 동굴을 찾고 그 곳에서 천 년된 뼈조각을 주워온다. 집에 돌아와 모든 뼈 조각을 맞추자 천년 전 살았던 아름다운 여인으로 되살아난다. 그 후 그는 유골을 수집하는 박사와 나비를 박제시켜 판화를 만드는 아름답지만 도도한 딸이 있는 수상한 집에서 지내게 된다\n\nCasts : Kim Ja-Ok,  Kim Jeong-Cheol,  Kim Man,  NamGung Won\n\nSYNOPSIS : Suk Yong-bin became paranoid since the car accident but has a vision that convinces him that he can get over any hardships. He goes on an exploration of a cave with a well-known archaeologist Jang Im-du and brings back a several thousand year old skull. That night he sees the spirit of the skull and goes back to work for the professor Jang. He starts dreaming about the Jang's daughter Hye-won. When he wakes up, he shares love with her in reality.\n\nHe is almost on the verge of death after drinking a beverage handed to him by a woman whom he happens to meet. Afterward, he loses the will to live and attempts suicide several times for no reason. He hangs himself with a strap from a column, thinking to himself, \"I will die because I am always starving to death no matter how many meals I eat a day.\" Just then, a book peddler finds him and preaches to him on the will to live. The book peddler is killed at last in an argument with him, but he comes back to life and cries for life no matter how many times he dies. \nHaving experienced such strange thing, he goes on an exploration of a cave with friends and brings back a several thousand years' old skull. He comes back home and puts all the bone fragments together. Then, the spirit of the skull returns, and a beautiful woman who lived a thousand years ago stands before his eyes. He stays in the house of an archeologist who collects remains and has a beautiful and elegant daughter who makes prints using stuffed butterflies.",
      "addedAt": "2025-12-26T00:25:07.589Z",
      "thumbnail": "https://i.ytimg.com/vi/wCK9VfNF9EM/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCa0_y9_zjgcDyICpkQMeXe_Llh0w",
      "duration": 7028,
      "language": "ko",
      "year": 1978,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:25:07.616Z"
}