{
  "imdbId": "youtube-koIuOUda9W8",
  "title": "Lost City of the Jungle 1946 Movie serial marathon (Directed by Ray Taylor) All Episodes",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=koIuOUda9W8",
      "title": "Lost City of the Jungle 1946 Movie serial marathon (Directed by Ray Taylor) All Episodes",
      "description": "Recent atom tests show a certain element - Meteorium 245 - as a defense against the atomic bomb. The evil Eric Hazarias (Lionel Atwill) has traced a Meteorium deposit to the Himalayan nation of Pendrang, ruled by casino owner Indra (Helen Bennett). Hazarias fakes his own death and shows up in Pendrang as philanthropist Geoffrey London. With him is Malborn (John Mylong), his faithful secretary who is actually the real mastermind, Hazarias being his decoy. Thus begins a search for Meteorium, under the guise of seeking the lost city of Pendrang. On the trail of Hazarias is United Peace Foundation operative Rod Stanton (Russell Hayden), there to unmask London as Hazarias and put a stop to his evil schemes.\n\nColorized version: https://youtu.be/lIOXuaBjV3w\n\nMain actors:\nRussell Hayden - Rod Stanton, United Peace Foundation operative\nJane Adams - Marjorie Elmore\nKeye Luke - Tal Shan\nLionel Atwill - Sir Eric Hazarias/ Geoffrey London\nJohn Mylong - Malborn, the \"real\" villain of the serial, posing as Geoffrey London's servant\nGeorge Lynn - Marlow, one of Hazarias' henchmen\nDick Curtis - Johnson, one of Hazarias' henchmen\nHelen Bennett - Indra\nTed Hecht - Doc Harris\nJohn Eldredge - Doctor Elmore\nJohn Miljan - Doctor Gaffron\nJohn Gallaudet - Professor Grebb\nArthur Space - \"System\" Reeves\nFrances Chung - Lakana Shan\nGene Roth - Police Captain Hammond\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=PL2gsu7VGzgdbhxA5EJhvw91BaULvBKCfc",
      "id": "koIuOUda9W8",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:33:02.437Z"
}