{
  "imdbId": "youtube-hn2MQcCa7Ls",
  "title": "Lost City - Das Gesetz der Straße (SCI FI ganzer Film Deutsch 2025, Action Sci Fi Filme ansehen)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=hn2MQcCa7Ls",
      "title": "Lost City - Das Gesetz der Straße (SCI FI ganzer Film Deutsch 2025, Action Sci Fi Filme ansehen)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Nach einem Industrieunglück ist Süditalien verödet – nur Fischer und Banden sind geblieben. Zwei Teenager wollen Teil einer Gang werden, doch das nötige Verbrechen bringt ihre Freundschaft in Gefahr.\n\nLOST CITY - DAS GESETZ DER STRAßE (2021)\nOriginaltitel: Mondocane\nMit:  Dennis Protopapa; Giuliano Soprano; Alessandro Borghi\nRegie: Alessandro Celli\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nIn einer nahen Zukunft ist Süditalien zu einer giftigen Einöde geworden – abgeschottet von Stacheldrahtzäunen und kontrolliert von skrupellosen Banden. Mitten in den Überresten der Stadt Taranto träumen der junge Pietro (Dennis Protopapa) und sein letzter verbliebener Freund Cristian (Giuliano Soprano) davon, ihrem trostlosen Dasein zu entfliehen. Ihr Ziel: das verheißungsvolle New Taranto auf der anderen Seite der Absperrung. Um zu überleben, schließen sie sich dem charismatischen, aber unberechenbaren Bandenführer Testacalda (Alessandro Borghi) an – ein Mann, dessen Spitzname nicht ohne Grund „Hitzkopf“ lautet. Doch während Cristian rasch innerhalb der Gang Karriere macht, gerät ihre Freundschaft ins Wanken. Als auch noch die attraktive Sabrina (Ludovica Nasti) zwischen die beiden tritt und eine fanatische Polizistin (Barbara Ronchi) erbarmungslos die Jagd auf sie eröffnet, droht ihr gemeinsamer Traum endgültig zu zerbrechen.\n#Netzkino #ganzerFilm #scifi\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "hn2MQcCa7Ls",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:55:16.127Z"
}