{
  "imdbId": "youtube-FLh9Lb3G8JU",
  "title": "The Daughters of Kim's Pharmacy ( Gimyakguk-ui Ttaldeul )(1963)",
  "year": 1963,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=FLh9Lb3G8JU",
      "title": "The Daughters of Kim's Pharmacy ( Gimyakguk-ui Ttaldeul )(1963)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00860\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00860\n\n영화글 : https://www.kmdb.or.kr/story/10/4934\n\n감독(Director) : 유현목(Yoo Hyeon-Mok)\n출연 : 최지희(용란),엄앵란(용빈),황정순(한실댁),김동원(김약국),강미애,황해(한돌),박노식(기두),허장강(연학),이민자(용숙),신성일,최성진,최성호,남춘역,주선태(정국주),최승이,백송,김석강,석금성,복혜숙,박은애,유민,심상우,최장호,임해림,권옥남,김혜경,강석제,이경희\n\n줄거리 : 통영 유지 김성수(김동원) 집안은 일제강점기에 접어들면서 신약이 보급됨에 따라 약국을 접고, 어장 노른자위마저 일본인에게 뺏겨 가세가 기울어지고 있다. 설상가상으로 집안의 딸들 역시 순조롭지 않은 인생을 보낸다. 셋째 딸 용란(최지희)은 애욕에 넘치는 본능적인 여성으로 하인인 한돌(황해)과 정을 통하다 김성수에게 발각된다. 한돌은 쫓겨나고 용란은 아편쟁이인 연학(허장강)에게 시집가지만 연학의 폭력과 학대에 처가로 도망 오기 일쑤다. 젊은 나이에 과부가 된 큰딸 용숙(이민자)은 아들을 돌보던 의사와 정을 통해 낳은 아기를 살해하여 집안으로부터 거의 버림을 받고, 악착같이 돈만 모으며 살아간다. 어려운 사정을 타개하기 위해 김성수는 큰돈을 빌려 기관선을 사지만 사고가 나 선원들이 죽고, 그 보상금으로 가산을 탕진한다. 김성수는 어장을 관리해오던 기두(박노식)와 넷째 딸 용옥(강미애)을 맺어주지만, 어장은 계속 어렵고 기두는 술에 절어 산다. 거기에 시아버지는 용옥을 겁간하기 위해 호시탐탐 노린다. 그러던 어느 날 다시 찾아온 한돌과 밀회하던 용란을 발견한 연학이 그들을 죽이려 하자, 이를 말리던 어머니(황정순)는 연학의 도끼에 맞아 죽고 용란은 미치고 만다. 이러한 비극에 교사 생활을 하는 신여성 둘째딸 용빈(엄앵란)은 통영을 영원히 떠나고자 하지만, 그녀를 흠모하는 강극의 설득으로 아버지의 땅에 남기로 한다.\n\nCasts : Kim Dong-Won, Eom Aeng-Ran, Choi Ji-Hee, Lee Min-Ja, Hwang Jeong-Sun\n\nSYNOPSIS : Kim has been running an herb shop for 20 years in Tongyeong. He has four daughters. The oldest daughter is selfish, the second is intelligent and rational, the third is a sensual hussy, and the fourth is a modest and honest Christian. All four of them suffer from unhappy marriages.",
      "id": "FLh9Lb3G8JU",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:24:30.382Z"
}