{
  "imdbId": "youtube-mOcG8ZEfvCE",
  "title": "Alfred Hitchcock | Sabotage (1936) Film-Noir, Crime, Thriller | Colorized Full Movie",
  "year": 1936,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mOcG8ZEfvCE",
      "title": "Alfred Hitchcock | Sabotage (1936) Film-Noir, Crime, Thriller | Colorized Full Movie",
      "description": "A Bomb Plot ...A Killing ...Justice \nA Scotland Yard undercover detective is on the trail of a saboteur who is part of a plot to set off a bomb in London. He becomes suspicious of a seemingly ordinary movie theater owner named Karl Verloc, the officer must race against time to uncover the truth and stop the planned sabotage. But when the detective's cover is blown, the plot begins to unravel.\n\nOriginal title: Sabotage (1936) AKA: The Hidden Power / I Married a Murderer\n\nBlack & White version: https://youtu.be/9aJ5j8HH46w\n\n\nDirector: Alfred Hitchcock\nWriters: Joseph Conrad, Charles Bennett, Ian Hay\nStars: Sylvia Sidney, Oscar Homolka, Desmond Tester\nGenres: Colorized Classics, Crime, Thriller, Film-Noir\nThis film is available with subtitles in many languages.\n\n\n00:00 Full Movie\n01:50 A chaotic situation unfolds in a theater as the audience demands their money back due to a power outage.\n08:34 A chaotic and comedic series of events unfold in a theater, involving refunds, misunderstandings, and personal troubles.\n14:52 A series of conversations and events leading to a mysterious assignment.\n21:35 A mysterious and intriguing conversation unfolds at a restaurant, hinting at secrets and hidden agendas.\n26:42 A mysterious conversation takes place, involving discussions about canaries, a planned event on Saturday, and a potential criminal activity.\n31:54 A mysterious encounter at Mr. Verloc's place leads to suspicion and plans to evade a detective from Scotland Yard.\n40:35 A woman is questioned about her husband's involvement in suspicious activities, while also dealing with a surprise for her son.\n46:27 A demonstration of a dental product at a theater, followed by a conversation about gathering information.\n49:21 A chaotic and suspenseful scene unfolds in a film, involving a bomb explosion, a busload of people, and a mysterious character named Verloc.\n1:01:10 A dramatic story unfolds involving a murder, a confession, and a desperate attempt to escape the consequences.\n1:12:28 A bomb explosion at a cinema leaves Mr. Verloc dead and chaos ensues.\n\n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.tiktok.com/@cultcinemaclassics\nhttps://www.instagram.com/cultcinemaclassics",
      "id": "mOcG8ZEfvCE",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [
    {
      "id": "alfred-hitchcock",
      "name": "Alfred Hitchcock"
    }
  ],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:40:12.497Z"
}