{
  "movieId": "youtube-51wDNOlnxdo",
  "title": "Locked Up – Jail Bait 2 (THRILLER full movie German, prison movies German completely new 2025)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=51wDNOlnxdo",
      "id": "51wDNOlnxdo",
      "title": "Locked Up – Jail Bait 2 (THRILLER full movie German, prison movies German completely new 2025)",
      "description": "💙 Ganze Filme komplett auf Deutsch streamen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Kämpfen oder Sterben im Frauenknast! Die weibliche Version vom Stallone-Kultfilm Lock up: Endlich der offizielle Nachfolger zu dem knallharten und erfolgreichen Frauenknast-Actioneer Jail Bait - Überleben im Frauenknast. Ein provokanter Mix aus \"Orange Is The New Black\" und \"Kill Bill\".\n\nLOCKED UP – JAIL BAIT 2: KÄMPFEN ODER STERBEN IM FRAUENKNAST (2017)\nOriginaltitel: Locked Up\nMit: Kelly McCart, Katrina Grey, Christiana Chaiwanna, Anastasia Maslova\nRegie: Jared Cohen\nFSK: Freigegeben ab 18 Jahren\n\nINHALTSANGABE:\nMallory (Kelly McCart), eine junge amerikanische Studentin aus reichem Haus, verbringt ein Studienjahr in Thailand bei ihrem Onkel Tommy (Jared Cohn). Doch auf dem Campus ist sie, die Amerikanerin, immer wieder Opfer brutalster Mobbing-Attacken. Als sie sich eines Tages zur Wehr setzt und eine Angreiferin schwer mit einer Eisenstange verletzt, wird sie von einem thailändischen Gericht zu zwei Jahren Haft in einem speziellen Erziehungsheim für junge Frauen verurteilt. Doch das Heim entpuppt sich schnell als brutales Frauengefängnis, das von einer äußerst sadistischen Direktorin geleitet wird. Die jungen Frauen müssen hier buchstäblich mit den Fäusten ums nackte Überleben kämpfen. Während Onkel Tommy - unwissend über die Zustände - verzweifelt versucht, fünf Millionen Dollar Kaution aufzutreiben, scheinen Mallorys Tage gezählt, denn neben den anderen Insassen haben auch alle Wärter ein Auge auf sie geworfen.\n#Netzkino #ganzerFilm #ThrillerFilm\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:49:24.819Z",
      "thumbnail": "https://i.ytimg.com/vi/51wDNOlnxdo/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBjeGwTZFjtNl_TLrRBWGS-SOT14w",
      "duration": 4993,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.128Z"
}