{
  "movieId": "youtube-Fl-ns4OVC2g",
  "title": "Whale Hunting (Goraesanyang)(1984)",
  "year": 1984,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Fl-ns4OVC2g",
      "id": "Fl-ns4OVC2g",
      "title": "Whale Hunting (Goraesanyang)(1984)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/03778\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/03778\n\n감독(Director) : 배창호(Bae Chang-Ho)\n출연 : 김수철(병태),이미숙(춘자),안성기(민우),이대근(여인촌사장),황건,남포동,이해룡,지계순,김은선,최재호,남수정,박용팔,최성관,안진수,김신명,장인한,이장미,곽건,김수경,김경란,전현숙\n\n줄거리 : 소심한 병태(김수철)는 짝사랑하던 여대생 미란에 대한 구애에 실패하고 좌절을 느껴 고래사냥을 위해 가출한다. 그는 거리를 배회하다가 술에 취한 한 여자를 도와주지만 억울하게 누명을 써 경찰서에 가게 된다. 그곳에서 거렁뱅이 민우(안성기)를 만나고 병태는 자유로워 보이는 민우를 따라간다. 도시를 유랑하던 그들은 술을 마시고 윤락가로 간다. 거기서 깡패들에게 손님 받기를 거부한다는 이유로 구타를 당하고 있던 벙어리 여인 춘자(이미숙)를 만난다. 병태는 민우의 도움을 얻어 춘자의 잃어버린 말과 고향을 찾아주기로 하고 그녀를 구출해 귀향길에 오른다. 그러나 돈은 없고 깡패들은 그들을 뒤쫓는다. 어렵고 괴로운 여행을 하면서도 춘자의 고향인 우도에 도착하지만, 마지막 순간에 깡패들에게 붙잡힌다. 춘자는 자신을 구하기 위해 깡패들에게 얻어맞는 병태를 보다가 긴박함에 말을 되찾는다. 깡패 두목(이대근)은 그들의 끈끈한 우정과 사랑에 감동하고 춘자를 놓아준다. 춘자는 드디어 어머니의 품에 안기고, 병태와 민우는 놀러오겠다는 약속을 하며 길을 떠난다.\n\nCasts : Ahn Seong-Ki, Lee Mi-Suk, Kim Su-Cheol, Lee Dae-Keun, Hwang Keon, Nam Po-Dong\n\nSYNOPSIS : The shy Byung-tae has a crush on Mi-ran, a college student. He fails to win her over. Disheartened, Byung-tae runs away from home in search of something more. He wanders the streets when he meets and hangs out with Min-wu, a beggar. They walk around the city when they meet Chun-ja, a mute maiden, in the red district. With Min-wu's support, Byung-tae wants to help recover Chun-ja's voice and find her hometown. They rescue Chun-ja and head for her hometown. Through the hard, painful journey, Chun-ja recovers her voice. The mother she had been missing embraces her. And Byung-tae realized that whales are not in the far ocean but in giving love to your neighbors.",
      "addedAt": "2025-12-26T00:23:23.834Z",
      "thumbnail": "https://i.ytimg.com/vi/Fl-ns4OVC2g/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLB4SjdYbChsRcmRUKcXWY6oTW960w",
      "duration": 6579,
      "language": "ko",
      "year": 1984,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:23:23.888Z"
}