{
  "imdbId": "youtube-Ncbd_j7Vab4",
  "title": "Sinbad and the Caliph of Baghdad (1973) Robert Malcolm, Sonia Wilson | Adventure Movie",
  "year": 1973,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Ncbd_j7Vab4",
      "title": "Sinbad and the Caliph of Baghdad (1973) Robert Malcolm, Sonia Wilson | Adventure Movie",
      "description": "The sailor Sinbad is dragged by two cheaters on board a ship on which the beautiful Sherazade travels, promised to the Caliph of Baghdad.\n\nOriginal title: Simbad e il califfo di Bagdad\n\nDirector & Writer: Pietro Francisci\nStars: Robert Malcolm, Sonia Wilson, Luigi Bonos \nGenre: Action, Adventure\n\nThis film is available with English & Italian audio. \nGo to video settings ⚙️  to change your audio / subtitle language options.\n\n\n0:00 Full Movie opening scene - Murder on the dance floor\n05:23 A sailor named Sinbad returns to Baghdad to find his home confiscated and faces trouble.\n12:03 A sailor finds himself on a mysterious ship and faces challenges and intrigue.\n28:00 A comedic and chaotic scene unfolds as characters interact in a kitchen setting.\n34:50 A princess and Sinbad plan to escape from a forced marriage while facing challenges on a ship.\n42:39 Two men stranded at sea on a small boat find a sunken ship and try to survive.\n52:34 A thrilling adventure involving hot air balloons, treasure, and a fight for power.\n1:04:28 A dramatic story unfolds at the Bazar Incognito involving auctions, deception, and a mysterious medicine.\n1:12:43 A tale of deception and power struggles in Persia involving twin brothers.\n1:23:16 A dramatic tale of betrayal, escape, and power struggles in Persia and Baghdad.\n\n@CultCinemaClassics",
      "id": "Ncbd_j7Vab4",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "ES",
          "IT"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:39:45.848Z"
}