{
  "imdbId": "youtube-ULFNZvEDSaQ",
  "title": "A Young Girl’s Quest to Save Christmas | The Christmas Dragon | Hallmark Christmas Movie HD",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ULFNZvEDSaQ",
      "title": "A Young Girl’s Quest to Save Christmas | The Christmas Dragon | Hallmark Christmas Movie HD",
      "description": "A Young Girl’s Quest to Save Christmas | The Christmas Dragon | Hallmark Christmas Movie HD - Father Christmas is a fading memory, after Christmas hasn’t come for several years. A young orphan girl receives a magic crystal from a dying elf, with a warning that the North has lost its magic, and that she alone can save Christmas.\n\nWatch The Christmas Dragon, a full Hallmark Christmas movie where the magic of the North is fading and Father Christmas has become a distant memory. When a young orphan girl receives a magical crystal from a dying elf, she learns that only she can restore the lost magic and save Christmas. Perfect for fans of Hallmark Christmas movies, magical holiday films, full free Hallmark Christmas movies, heartwarming festive adventures, and enchanting winter stories, The Christmas Dragon delivers wonder, excitement, and the true spirit of Christmas for viewers of all ages.\n\nStars: Bailee Michelle Johnson, Paris Warner, David DeVilliers\n*Licensed from Uncork'd. All rights reserved*\n\n*Welcome to Movie Central, SUBSCRIBE NOW!* - https://bit.ly/3mRDJox\r\n\r\nAll of the content on this channel is UNDER LEGAL LICENSE (We have written contracts) from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - rights@vamedianetwork.com\r\nMovie Central is owned and operated by VA Media Ltd. All rights reserved.\r\n\r\n#hallmarkmovie #hallmarkchristmasmovies #FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "id": "ULFNZvEDSaQ",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "CA",
          "US"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T23:59:24.110Z"
}