{
  "movieId": "youtube-1rP5pkH9Xdo",
  "title": "피아골(1955) /Piagol (Pi-agol)",
  "year": 1955,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1rP5pkH9Xdo",
      "id": "1rP5pkH9Xdo",
      "title": "피아골(1955) /Piagol (Pi-agol)",
      "description": "TBS 영화해설 : https://www.youtube.com/watch?v=Sfdgd0l1PFw\n\n영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail//movie/K/00278\n(English) https://www.kmdb.or.kr/eng/db/kor/detail//movie/K/00278\n\n영화글 : https://www.kmdb.or.kr/story/10/5287 \n\n감독(Director) : 이강천(Lee Kang-cheon)\n출연 : 노경희(애란),이예춘(대장, 아가리),김진규(철수),허장강(만수),윤왕국,송곽상,이원철,김영희,조남석,곽건,김익환\n\n줄거리 : 휴전 후에도 지리산에 남아 있는 소수의 빨치산 중 아가리(이예춘)라는 별명을 가진 인물이 대장을 맡고 있는 부대는 온갖 만행을 저지른다. 공산주의 이념에 회의를 느끼기 시작한 철수(김진규)는 당성이 높고 냉철한 여자 대원 애란(노경희)의 연모를 받으며 고민한다. 어느 날 다른 부대로 뽑혀 갔던 여자 대원 소주가 어깨에 총상을 입은 채 피아골로 돌아온다. 만수(허장강)는 부상당한 소주를 범하고 그 와중에 소주는 숨을 거둔다. 만수는 자신의 죄를 숨기기 위해 동료 빨치산을 살해하고, 달석에게 모든 죄를 덮어씌운 후 달석마저 죽인다. 지리산 공비 토벌이 시작되자 빨치산들은 모두 죽임을 당할 상황에 처한다. 애란과 철수는 빨치산 생활에 환멸을 느끼고 귀순에 대해 이야기하다 아가리에게 발각된다. 철수와 다투던 아가리는 철수를 죽이고, 애란은 아가리를 사살한 후 홀로 산을 내려온다.\n\nCasts :  Kim Jin-Kyu, No Kyeong-Hee, Lee Ye-Chun, Heo Jang-Kang\n\nSynopsis : After the armistice a military unit led by a person nicknamed \"Agari\" (Le Ye-chun) commits all the wrong-doings in Jiri Mountain. Cheol-su (Kim Jin-gyu), who sick and tired of communism, is loved by cold-minded Ae-ran (No Gyeong-hui), who is committed to her party. One day So-ju, a female agent who was relocated to another camp, comes to Piagol with her shoulder wounded. Man-su (Heo Jang-gang) rapes her and she dies while being raped. Man-su kills his communist peer to hide his sin, and makes Dal-seok responsible for all his wrong-doings, He later also kills Dal-seok. All the communist troupes are about to be killed due to a government crackdown. Ae-ran and Cheol-su abhor living in the mountain and plan to free themselves from being communists, but their conversation is overheard by Agari. Agari kills Cheol-su during a quarrel. Ae-ran at last kills Agari, and descends the mountain alone.",
      "addedAt": "2025-12-26T00:23:13.992Z",
      "thumbnail": "https://i.ytimg.com/vi/1rP5pkH9Xdo/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBAmZ5sGImp0PLPkUhZB-SiZsabYw",
      "duration": 6506,
      "language": "ko",
      "year": 1955,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:23:14.011Z"
}