{
  "imdbId": "youtube-fs5ChxH1R04",
  "title": "Holodomor - Bittere Ernte - Historienfilm - Ganzen Film kostenlos in HD schauen bei Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=fs5ChxH1R04",
      "title": "Holodomor - Bittere Ernte - Historienfilm - Ganzen Film kostenlos in HD schauen bei Moviedome",
      "description": "*GANZER FILM - UKRAINISCHER HISTORIENFILM*\nDen *bewegenden Historienfilm* „Holodomor - Bittere Ernte“ kostenlos und in voller Länge auf Moviedome schauen.\n\n*So bewerten Filmfans* „Holodomor - Bittere Ernte“:\nIMDb: *5,9* von 10\nAmazon: *4* von 5\n\n*Die Handlung von „Holodomor - Bittere Ernte“*\nSowjetunion 1932. Ukrainische Bauern leisten heftigen Widerstand gegen die Kollektivierung ihres Eigentums. Um ihren Willen zu brechen, zwingt Stalin die Ukrainer, immer mehr von ihrer Ernte abzuführen. Die Bevölkerung der Ukraine beginnt zu hungern.\n\n►Mehr ganze Filme auf Moviedome entdecken! http://bit.ly/MoviedomeAbo\nJetzt den ganzen Spielfilm „Holodomor - Bittere Ernte“ kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo\n►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzerFilm #ganzeFilme #FilmeKostenlos\n\nOriginaltitel: Bitter Harvest\nLaufzeit: 103 Minuten\nRegie: George Mendeluk\nFSK: 12\nErstveröffentlichung: 2017\n\n\n*Das sind die Schauspieler*\nMax Irons (bekannt aus „Terminal - Rache war nie schöner“)\nin der Rolle des Yuri\nSamantha Barks (bekannt aus „Les Misérables“)\nin der Rolle der Natalka\nTerence Stamp (bekannt aus „Der Plan“, „Last Night in Soho“)\nin der Rolle des Ivan\nAneurin Barnard (bekannt aus „Dunkirk“, „Der Distelfink“)\nin der Rolle des Mykola\n\n\n*Die Handlung und Szenen von „Holodomor - Bittere Ernte“*\nHolodomor bezeichnet die durch die Politik Joseph Stalins (Gary Oliver) ausgelöste Hungersnot in den Jahren 1932 und 1933, zwischen den beiden Weltkriegen. Während der Dikator versucht, eine große und florierende Sowjetunion zu errichten, kämpft der in der Ukraine geborene Künstler Yuri (Max Irons) gegen den Hunger und versucht seine große Liebe Natalka (Samantha Barks) vor den tragischen Umstände zu retten. Schließlich tritt Yuri einer Widerstandsbewegung gegen die Bolschewiki bei und gibt alles für eine gemeinsame Zukunft mit Natalka und einer freien Ukraine. Es entwickelt sich eine Geschichte um Liebe, Ehre und Rebellion, die ein Licht auf die Situation in der ersten Hälfte des 20. Jahrhunderts von Stalin unterdrückten Ukraine wirft. Wird Yuri Land und Liebe retten können?\n\nJetzt ganze Filme bei #Moviedome anschauen\nFinde Movies in ganzer Länge diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \nJetzt den Spielfilm „Holodomor - Bittere Ernte“ in voller Länge auf deutsch ansehen.",
      "id": "fs5ChxH1R04",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:33:50.509Z"
}