{
  "imdbId": "youtube-02pYaQtqNdY",
  "title": "Titanium – Strafplanet XT-59 (SCIFI ACTION ganzer Film Deutsch in 4K, Actionfilme in voller Länge)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=02pYaQtqNdY",
      "title": "Titanium – Strafplanet XT-59 (SCIFI ACTION ganzer Film Deutsch in 4K, Actionfilme in voller Länge)",
      "description": "► Ganze Filme auf Deutsch anschauen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n► Mit neun anderen Gefangenen wird Aktivistin Kristina auf einen Marsch in den scheinbar sicheren Tod geschickt... Eine orwell'sche Zukunftsvision mit Vinnie Jones und guten Effekten in einem Science-Fiction-Abenteuer aus Russland. \n\nTITANIUM - STRAFPLANET XT 59 (2014)\nOriginaltitel: Bычислитeль (Englischer Titel: The Calculator)\nMit: Anya Chipovskaya, Evgeniy Mironov, Vinnie Jones, Irene Muskara, Nikita Panfilov\nRegie: Dmitriy Grachev\nFSK: Freigegeben ab 12 Jahren\n\nINHALTSANGABE:\nAuf dem von Menschen kolonisierten Planet XT-59 überwacht ein totales Kontrollsystem die Daten aller Bewohner. Ein Zentralcomputer trifft alle Entscheidungen für die Bürger. Von der Außenwelt sind sie völlig isoliert. Wer sich nicht einfügt, landet in den Sümpfen. Hier ist der schwarze, von dunklen Wolken verhangene Planet so lebensfeindlich wie nirgendwo sonst. Wer nicht versinkt, fällt grauenvollen Kreaturen zum Opfer oder verhungert. Zehn Gefangene werden am Rand der Todeszone ausgesetzt. Doch dieses Mal ist etwas anders: Einer von ihnen gehörte vorher zum innersten Zirkel der Macht…\nÜberzeugte Demokraten sind die Siedler, die von der Erde kamen, um Planet XT-59 zu kolonisieren, wohl nicht gewesen. Sie haben auf dem kargen Land eine wohlhabende Gesellschaft geschaffen, die einhergeht mit einem totalen Überwachungsstaat, der seine Bürger mittels Datenkontrolle beherrscht. Durchgesetzt werden die Regeln mit einem archaisch anmutenden Strafsystem, in dem unangepasste Bürger einfach in ein so lebensfeindliches Gebiet geschickt werden, dass sie keine Chance haben.\nWenn man sich die rasante Entwicklung des Data-Mining und die intensive Forschung im Bereich der Auswertung sehr großer Datenmengen vor Augen führt, dann gehört das Herrschaftssystem auf Planet XT-59 gar nicht mehr so weit ins Reich der Fiktion. Wissenschaft und Technik sind auf dem besten Weg, alle dafür notwendigen Instrumente zur Verfügung zu stellen. Wenn einer der großen Datensammler der Erde einen fremden Planeten vereinnahmen würde, könnte das Leben dort genau so aussehen. Die Filmemacher haben nur einen bereits möglichen Weg zu Ende gedacht. Parallelen zur früheren Sowjetunion und zum heutigen Russland sind dabei in dieser düsteren Vision aus modernster russischer Filmschmiede sicher nicht zufällig. \n#Netzkino #ganzerFilm #SciFiFilm\n\n\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinem monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum Streamen, kostenlos & legal auf http://bit.ly/NetzkinoWebsite\n✘ Abonniere unseren Trailerkanal für die neusten Kinotrailer:  http://bit.ly/NetzkinoTrailer\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nFOLGE UNS!\n✘ Facebook - https://www.facebook.com/netzkino\n✘ Twitter - https://twitter.com/netzkino\n✘ Instagram - https://www.instagram.com/netzkino/\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "02pYaQtqNdY",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-24T00:05:32.383Z"
}