{
  "imdbId": "youtube-5DE8uwBTOgc",
  "title": "Moon of the Wolf 1972 (Horror, Thriller) David Janssen, Barbara Rush | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5DE8uwBTOgc",
      "id": "5DE8uwBTOgc",
      "title": "Moon of the Wolf 1972 (Horror, Thriller) David Janssen, Barbara Rush | Movie",
      "description": "Beware the Bayou Moon: where humanity meets horror.\nIn the picturesque Louisiana bayou, a sheriff uncovers a string of brutal murders, but his hunt for a killer takes a hair-raising turn when evidence points to a suspected werewolf on the loose\n\nOriginal title: Moon of the Wolf (1972)\n\nThis film has English, Portuguese & Spanish audio options, and is subtitled in many languages.\n\nDirector: Daniel Petrie\nWriters: Alvin Sapinsley, Les Whitten\nStars: David Janssen, Barbara Rush, Bradford Dillman  \nGenres: Cult Classic, Horror, Thriller \n\n\n00:00 Full Movie (with subtitles)\n01:39 A mysterious death by wild dogs sparks suspicions of foul play.\n06:28 Ellie Burrifors' murder case reveals shocking secrets and raises more questions.\n12:55 Characters discuss past romances and unfolding drama in their small town.\n19:32 Secrets and suspicions deepen as the investigation into a mysterious death intensifies.\n23:01 Past secrets ignite conflict, sending characters back to their ancestral home, shaking the town.\n27:17 A woman returns to her farmhouse, only to face family pressures and a strange illness.\n35:54 The sheriff's murder investigation heats up as suspicions swirl among the townspeople.\n43:39 Mysterious murders grip the town, while the police chief searches for answers.\n51:35 A murder involving drugs and a beautiful victim uncovers dark motives in a tense conversation.\n54:25 Werewolf suspicions emerge as a series of brutal murders prompts a deadly hunt.\n1:02:01 A horror-thriller filled with lycanthropy, mysterious deaths, and buried family secrets.\n\n\n@CultCinemaClassics \n\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:37:01.560Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/5DE8uwBTOgc/maxresdefault.webp?v=67203d5e",
      "duration": 4454,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:37:01.636Z"
}