{
  "imdbId": "youtube-MAoSY7zhpqE",
  "title": "Incident on a Dark Street (Crime, 1977) by Buzz Kulik | James Olson, William Shatner | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=MAoSY7zhpqE",
      "title": "Incident on a Dark Street (Crime, 1977) by Buzz Kulik | James Olson, William Shatner | Movie",
      "description": "The streets just got a little darker ...\nA small-time hood is murdered just as he is about to blow the whistle on an organized crime ring.\n\nOriginal title: Incident on a Dark Street (1977) \n\nThis film is available with subtitles in many languages.\n\nDirector: Buzz Kulik\nWriters: E. Jack Neuman \nStars: James Olson, David Canary, Robert Pine & William Shatner\nGenres: Crime, Drama, Made for TV\n\n00:00 Full Movie\n01:40 A mysterious encounter involving Vinny, Frank, and Pete, leading to a potential investigation by FBI and other agencies.\n09:12 Legal proceedings and construction project discussed in a movie scene.\n13:33 Investigation into a suspicious financial situation involving Wallace and Leopold.\n22:19: 🔍 Investigation into a crime involving FBI, Miami, and connections between individuals.\n28:05 Tensions rise as Frank is questioned about the murder of Vinny, leading to a confrontation and a potential deal for the Portland project.\n39:39 Legal proceedings unfold as Arthur Lloyd Trenier faces drug trafficking charges, requesting a one-week pause for defense considerations.\n40:48 Legal proceedings involving Francis Begnomino Romeo and his connection to criminal activities are discussed in court.\n46:45 Undercover agent confesses to unknowingly assisting in drug trafficking and faces legal consequences.\n54:42 Intense confrontation and negotiation between characters, involving threats, money, and coercion.\n1:03:38 A meeting between two individuals leads to a discussion about sensitive information and potential consequences.\n1:11:43 A conversation about protecting evidence and a plan to prevent a man from going to prison unfolds amidst a crime investigation.\n1:19:02 Shilling seeks help from Leopold regarding a valuable information, but Leopold warns him to stay away from trouble. Hirsch questions Pearson about Shilling, and Wallace demands a share of the Portland project funds.\n1:29:50 A discussion about a dangerous criminal, Leopold, and a potential plan to take him down.\n\n\n@CultCinemaClassics .\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "MAoSY7zhpqE",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:38:56.717Z"
}