{
  "movieId": "youtube-YCA0mJAeMrM",
  "title": "Body Moves 1990 (Dance, Romance) Lindsley Allen, Kirk Rivera, Steve Messina | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YCA0mJAeMrM",
      "id": "YCA0mJAeMrM",
      "title": "Body Moves 1990 (Dance, Romance) Lindsley Allen, Kirk Rivera, Steve Messina | Full Movie",
      "description": "Feel The Heat!\nThe battle between two dance groups is called the \"Hot Steps Contest\", a competition to be held at the Neptune disco.\n\nOriginal title: Hot steps - passi caldi\n\nDirector: Gerry Lively\nWriter: Daniele Stroppa\nStars: Lindsley Allen, Kirk Rivera, Steve Messina\nGenres: Musical, Romantic Comedy, Dance\n\n\n00:00 Full movie\n00:15 Dance audition, medical treatment, and morning routine unfold as characters navigate relationships and aspirations.\n11:30 Dance group prepares for contest, faces challenges and conflicts.\n23:42 A story of dance, romance, and financial struggles unfolds, involving a group of characters and their relationships.\n35:20 Drama unfolds as a dance school faces closure due to financial struggles and personal conflicts.\n43:45 Dance rehearsals face challenges as relationships and health issues arise, leading to conflicts and a risky plan to continue practicing.\n56:58 Drama unfolds as relationships are tested, secrets are revealed, and a dangerous encounter occurs late at night.\n1:09:37 Romantic drama involving jealousy, betrayal, and friendship, leading to a dance contest and a new love interest.\n1:21:34 Dance competition drama unfolds as Nancy faces health challenges, but with support, she overcomes obstacles and the group delivers a successful performance.\n1:30:51 Dance performance with technical difficulties and deliberation by judges.\n\n@CultCinemaClassics .\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:39:09.978Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/YCA0mJAeMrM/maxresdefault.webp?v=67b54eae",
      "duration": 5841,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "ES",
          "IT"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:39:10.088Z"
}