{
  "movieId": "youtube-1bOydHrHL_E",
  "title": "Rio Rita (RKO,1929) FLORENZ ZIEGFELD 🍕BEBE DANIELS 🍕FULL MOVIE",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1bOydHrHL_E",
      "id": "1bOydHrHL_E",
      "title": "Rio Rita (RKO,1929) FLORENZ ZIEGFELD 🍕BEBE DANIELS 🍕FULL MOVIE",
      "description": "It's Friday@PizzaFLIX \nProduced by: Florenz Ziegfeld\nStarring: Bebe Daniels, John Boles, Bert Wheeler and Robert Woolsey\nDirected by: Luther Reed\nhttps://www.youtube.com/playlist?list=PLmHgXUJMN1TXEBMtSqYpWfok-xg95KXao\n🍕FILM DEBUT OF WHEELER & WOOSLEY🍕\nExperience a landmark in early Hollywood history with this Radio Pictures adaptation of Florenz Ziegfeld’s Broadway triumph. Produced in 1929 by RKO Productions, this groundbreaking musical \"talkie\" was directed by Luther Reed and features a star-studded cast including Bebe Daniels, John Boles, and the film debut of comedy duo Bert Wheeler and Robert Woolsey.\n\nThis milestone of the early sound era combines romance, intrigue, and song along the Texas-Mexico border—bringing Ziegfeld’s signature theatrical flair to the screen. Originally filmed in early two-color Technicolor, sadly, only the final reel survives in its original color format, making it a rare and partially lost cinematic treasure that reflects both the innovation and limitations of 1920s film technology.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\n🍕 Be sure to LIKE, COMMENT, and SUBSCRIBE for more rare, vintage films every Friday on PizzaFLIX.\n\nInitially released in early two-color Technicolor, only the final reel survives in color today—offering a rare glimpse into the visual style of late 1920s cinema. Also featuring Don Alvarado and Geoffrey Kerr, this film remains a significant artifact from the transitional period between silent movies and synchronized sound.\n\n#fullmovie #RioRita #FlorenzZiegfeld #ClassicHollywood #EarlyTalkies #Technicolor #BebeDaniels #WheelerAndWoolsey #RKO #RadioPictures #1929Films #GoldenAgeMusicals #PizzaFLIX",
      "addedAt": "2025-12-24T01:03:06.072Z",
      "thumbnail": "https://i.ytimg.com/vi/1bOydHrHL_E/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLATQSp_pt7-aq9zwRkqneaRzrunbA",
      "duration": 6208,
      "language": "en",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T01:03:06.072Z"
}