{
  "imdbId": "youtube-hXLqXEo2QFs",
  "title": "Däumelinchen und die Vögel (ZEICHENTRICKFILM ganzer Film Deutsch, Märchenfilme in voller Länge)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=hXLqXEo2QFs",
      "title": "Däumelinchen und die Vögel (ZEICHENTRICKFILM ganzer Film Deutsch, Märchenfilme in voller Länge)",
      "description": "► Ganze Spielfilme kostenlos anschauen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n► Erlebt die Geschichte vom kleinen Mädchen Däumelinchen nach dem weltberühmten Märchen von Hans Christian Andersen!\n\nDÄUMELINCHEN UND DIE VÖGEL - THUMBELINA (1993)\nOriginaltitel: Thumbelina\nMit: Rachel King, Gennie Nevinson\nRegie: Richard Slapczynski\nFSK: Freigegeben ab 6 Jahren\n\nINHALTSANGABE: Die Geschichte beginnt mit einer guten Fee, welche einer Frau mit lang gehegtem Kinderwunsch ein Samenkorn schenkt. Dieses entwickelt sich zu einer wunderschönen Blume, inmitten welcher ein winziges Mädchen steht. Nicht größer als ein Daumen, bekommt sie den Namen: \"Däumelinchen\".\nFür ihren Gesang wird Däumelinchen von vielen bewundert. So lernt sie eines Nachts den Feenprinzen Cornelius kennen, in welchen sie sich verliebt.\nDoch noch in der selben Nacht wird Däumelinchen entführt, denn auch die Fröschin Cassandra möchte sich an ihrem Gesang erfreuen und sie zur Frau ihres Sohnes machen\nAls Cornelius von der Entführung erfährt, fleht er seine Eltern an den Winter aufzuhalten und macht sich selbst auf die Suche nach Däumelinchen, während diese bereits dem nächsten Entführer, Karl dem Käfer, entkommen ist. Mit Anbruch des Winters wird Däumeline von Frieda Fledmaus gefunden, die sie mit zu sich nach Haus nimmt und Meister Mole, einem Maulwurf vorstellt. Auch dieser möchte Däumeline heiraten. Da sie glaubt, dass Cornelius im kalten Winter gestorben sei, willigt sie schließlich ein. Doch kurz vor dem Altar merkt sie, dass sie Cornelius nicht vergessen kann und entschließt sich erneut zu flüchten.\nWährend ihr die Flucht gelingt, besiegt Cornelius die Fröschin Grundel. Die beiden Liebenden treffen im Tal der Feen aufeinander und heiraten dort. Schlussendlich bekommt Däumelinchen sogar ihre eigenen Flügel. \n#Netzkino #ganzerFilm #Zeichentrickfilm\n\n\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinem monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum Streamen, kostenlos & legal auf http://bit.ly/NetzkinoWebsite\n✘ Abonniere unseren Trailerkanal für die neusten Kinotrailer:  http://bit.ly/NetzkinoTrailer\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nFOLGE UNS!\n✘ Facebook - https://www.facebook.com/netzkino\n✘ Twitter - https://twitter.com/netzkino\n✘ Instagram - https://www.instagram.com/netzkino/\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "hXLqXEo2QFs",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T00:05:29.761Z"
}