{
  "imdbId": "youtube-McKrgRHoI-A",
  "title": "The Beach Turns Into A Feeding Frenzy | Jersey Shore Shark Attack | Full Shark Action Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=McKrgRHoI-A",
      "title": "The Beach Turns Into A Feeding Frenzy | Jersey Shore Shark Attack | Full Shark Action Movie",
      "description": "The Beach Turns Into A Feeding Frenzy | Jersey Shore Shark Attack | Full Shark Action Movie - Underwater drilling brings a horde of man-eating sharks to a beachside community, and the only people aware of the problem are unable to convince anyone of the danger.\n\nWatch Jersey Shore Shark Attack, a full shark action movie where a beachside community faces a terrifying feeding frenzy. Underwater drilling unleashes a horde of man-eating sharks, and the few who know the truth struggle to warn anyone before it’s too late. This thrilling action-packed shark movie delivers nonstop suspense, deadly encounters, and high-stakes survival, making it a must-watch for fans of shark attacks and edge-of-your-seat adventures.\n\nWatch one of our brand new 2025 Action Movies Here - https://youtu.be/seeEhOxdeGQ\n\n*Welcome to Movie Central, SUBSCRIBE NOW!* - https://bit.ly/3mRDJox\r\n\nStars: Jack Scalia, Jeremy Luke, Joseph Russo\n*Licensed from Tesera. All rights reserved*\n\nAll of the content on this channel is UNDER LEGAL LICENSE (We have written contracts) from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - rights@vamedianetwork.com\r\nMovie Central is owned and operated by VA Media Ltd. All rights reserved.\r\n\r\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies\n00:00:00 Skip the opening credits\n00:00:31 Full Jersey Shore Shark Attack Movie\n01:25:22 Skip the credits",
      "id": "McKrgRHoI-A",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "US"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T23:59:34.414Z"
}