{
  "movieId": "youtube-wSlMXSs899c",
  "title": "Wackiest Wagon Train in the West (Western, 1976) Bob Denver, Forrest Tucker, Ivor Francis | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=wSlMXSs899c",
      "id": "wSlMXSs899c",
      "title": "Wackiest Wagon Train in the West (Western, 1976) Bob Denver, Forrest Tucker, Ivor Francis | Movie",
      "description": "The misadventurous journey of a hapless wagonmaster and his clumsy assistant as they lead a diverse group of seven passengers, including two wealthy Bostonians, an aspiring showgirl, a teacher, and a bachelor, through the Wild West. As mishaps unfold, the group must use their wit to overcome challenges and reach their destination in California.\n\nOriginal title: The Wackiest Wagon Train in the West (1976)\n\nThis movie is subtitled in many languages.\n\nDirectors: Jack Arnold, Earl Bellamy\nWriters: Sherwood Schwartz, Elroy Schwartz \nStars: Bob Denver, Forrest Tucker, Ivor Francis, Jeannine Riley\nGenres: Western, Comedy \n\n\n00:00 Full Movie (with subtitles)\n04:34 A chaotic wagon train journey is further complicated by the discovery of a wounded Indian boy.\n13:38 Unconventional rescue mission led by wagon train members to save Betsy and Andy from the Hackamaws.\n25:22 Dusty's adventures with a wild horse and a broken telegraph key.\n28:45 Courtroom drama unfolds as Dusty faces accusations of horse theft, leading to a surprising turn of events.\n36:59 A comedic western unfolds as Dusty and his friends face a hanging, an escape, and a wild stallion.\n44:50 A group prepares to defend against cattle thieves by using a clever disguise strategy.\n53:27 A comedic Western film where two women are kidnapped by outlaws seeking to get friendly with them.\n1:06:09 A group of travelers arrives at a deserted town and senses trouble lurking as they explore.\n1:09:23 Unraveling a mystery in a deserted town, a group encounters outlaws and comedic chaos ensues.\n1:15:26 A comedic western film where a brave wagon master faces off against dangerous outlaws to save a town.\n1:23:18 A comedic western film where a character impersonates Bat Masterson to outsmart the Skullner brothers.\n\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:36:09.629Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/wSlMXSs899c/maxresdefault.webp?v=669c8961",
      "duration": 5238,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:09.861Z"
}