{
  "imdbId": "youtube-uSzoXUtGZTM",
  "title": "Hollywood Revue of 1929 (MGM) JOAN CRAWFORD🍕 ALL-STAR EXTRAVAGANZA",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=uSzoXUtGZTM",
      "id": "uSzoXUtGZTM",
      "title": "Hollywood Revue of 1929 (MGM) JOAN CRAWFORD🍕 ALL-STAR EXTRAVAGANZA",
      "description": "PizzaFLIX Presents CLASSIC MOVIE MONDAY\nMasters of Ceremony: Jack Benny, Conrad Nagel\nStars: John Gilbert, Joan Crawford, Buster Keaton, Norma Shearer, Laurel & Hardy\nDirector: Charles Reisner, Christy Cabanne, Norman Houston\n🍕FEATURED HIGHLIGHTS🍕\n0:00            PizzaFLIX Intro\n07:17          \"Got a Feeling for You\" Joan Crawford \n20:18          \"You Were Meant for Me\" Conrad Nagel, Anita Page, Charles King\n31:59          \"Cut Up\" comedy skit featuring William Haines & Jack Benny\n34:12          \"I Never Knew I Could Do a Thing Like That\" Bessie Love\n43:59          \"Magic Act\" introduced by Jack Benny, featuring Laurel and Hardy\n01:07:20    \"The Dance of the Sea\", an \"underwater\" sequence performed by Buster Keaton\n01:24:14    \"Romeo and Juliet\" (Technicolor) John Gilbert and Norma Shearer\n01:31:00    \"Singin' in the Rain\" Ukulele Ike & The Brox Sisters\n01:49:38    \"Orange Blossom Time\" (Technicolor) Charles King to Myrtle\n01:56:39    \"Singin' in the Rain\" (finale) (Technicolor), sung by the entire cast\n\nStep into the dazzling early days of talking pictures with this all-star musical extravaganza from Metro-Goldwyn-Mayer, produced by Harry Rapf and directed by Charles Reisner. A landmark in film history, this 1929 variety-style revue showcases MGM’s top talent in a lively celebration of sound-era innovation, filmed in early two-color Technicolor sequences.\n\nFeaturing a stellar ensemble cast including Joan Crawford, Buster Keaton, Norma Shearer, John Gilbert, Marion Davies, Lionel Barrymore, Laurel and Hardy, and many more, this production offers a rare glimpse of silent-era stars adapting to the new world of sound. Musical highlights include “Singin’ in the Rain,” performed by Cliff Edwards, as well as show-stopping dance numbers, comedy sketches, and operatic performances that marked a cinematic turning point.\n\n🎭 Subscribe for more Oscar-winning films, vintage musicals, and Pre-Code Hollywood gems!\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\nWith Conrad Nagel and Jack Benny serving as charming masters of ceremonies, this film delivers nonstop entertainment and historical significance. A must-see for fans of classic Hollywood, early musicals, and the dawn of the talkie era.\n\n#HollywoodRevueOf1929 #ClassicHollywood #EarlyMusicals #MGMStudios #TalkieEra #JoanCrawford #BusterKeaton #LaurelAndHardy #NormaShearer #FilmHistory #1920sCinema #AFICatalog #TechnicolorClassic",
      "addedAt": "2025-12-24T01:03:56.059Z",
      "thumbnail": "https://i.ytimg.com/vi/uSzoXUtGZTM/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDom1dMdDvyPVi2odqAxVhEKWIMRA",
      "duration": 7144,
      "language": "en",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T01:03:56.059Z"
}