{
  "imdbId": "youtube-QF2TEV9bu70",
  "title": "The 13th Chair (MGM, 1929) BELA LUGOSI🍕 LEILA HYAMS",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QF2TEV9bu70",
      "title": "The 13th Chair (MGM, 1929) BELA LUGOSI🍕 LEILA HYAMS",
      "description": "It's Friday @PizzaFLIX \nDirector: Tod Browning\nStars: Bela Lugosi, Leila Hyams, Margaret Wycherly, Conrad Nagle\nhttps://www.youtube.com/playlist?list=PLmHgXUJMN1TXEBMtSqYpWfok-xg95KXao\nThe master of the macabre, Tod Browning, and the Prince of Darkness, Bela Lugosi, two years before their immortal pact in Dracula! \n\nFor the director and star, it was their first bite into talkies. But this time, Bela steps out of the shadows and into the role of a sleuth. His prime suspect? The luminous blonde Leila Hyams, with more secrets than the cover of night can conceal.\n\nStep into the shadowy world of this Old Dark House Whodunit from Metro-Goldwyn-Mayer and legendary filmmaker Tod Browning. The iconic Bela Lugosi stars in his first English-speaking role, foreshadowing his rise to horror stardom. Alongside him are Leila Hyams,  Margaret Wycherly, and Conrad Nagle, bringing mystery and intrigue to a tangled web of murder, séances, and family secrets.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\n🍕 Be sure to LIKE, COMMENT, and SUBSCRIBE for more rare, vintage films every Friday on PizzaFLIX.\n\nSet in a dark, brooding mansion, the film follows a group of suspects brought together for a séance to solve a mysterious murder. With expert direction from Tod Browning and eerie atmosphere throughout, this film is a hallmark of the “Old Dark House” mystery genre and a must-see for BELA LUGOSI fans.\n\n#TheThirteenthChair #BelaLugosi #TodBrowning #LeilaHyams #OldDarkHouse #ClassicMystery #PreCodeHollywood #VintageHorror #MGMStudios #PizzaFLIX",
      "id": "QF2TEV9bu70",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-24T01:03:19.387Z"
}