{
  "imdbId": "youtube-eHDWPJg-w2U",
  "title": "El Pabellón №6 | DRAMÁTICA | por Karen Shakhnazarov",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=eHDWPJg-w2U",
      "id": "eHDWPJg-w2U",
      "title": "El Pabellón №6 | DRAMÁTICA | por Karen Shakhnazarov",
      "description": "El guión de la película está basado en la historia de A.P. Chéjov \"El Pabellón №6\", pero la acción de la película se ha trasladado al presente. Otra innovación de los creadores de la película es que la narración se realiza en forma de entrevistas con personas, de forma documental. Evgeny Khobotov es el nuevo médico jefe de un hospital psiquiátrico. Nos presenta a Ivan Gromov, que tiene una manía de persecución. Resulta que el anterior médico jefe, el Dr. Ragin, lo consideraba... un profeta. Ahora Ragin está en este hospital como paciente. \n\nPero, ¿cómo sucedió que una persona sana, después de comunicarse con un enfermo mental, pierde la cabeza? ¿Cómo cruzó esta línea? Y, en general, ¿no es ilusoria la línea entre los enfermos mentales y las personas normales? ¿Quizás sería cierto decir que usted y yo sufrimos diferentes formas de enfermedad mental? De una forma u otra, los colegas y familiares del Dr. Ragin están tratando de comprender por qué la visita a la sala número 6 fue fatal para el médico jefe.\n\nAño de producción: 2006\n\nDirectores: Shakhnazarov Karen, Gornovsky Alexander\nEscritores: Alexander Borodyansky, Karen Shakhnazarov\nCompositor: Evgeniy Kadimsky\nOperador: Kuznetsov Alexander\nDiseño de producción: Kusakova Lyudmila\n\nReparto: Pankratov-Cherny Alexander, Ilyin Vladimir, Zharkov Alexey, Stychkin Evgeniy, Soloviev Victor, Vertkov Alexey, Evtushevskaya Albina, Kuznetsov Alexander",
      "addedAt": "2025-12-23T03:43:58.431Z",
      "thumbnail": "https://i.ytimg.com/vi/eHDWPJg-w2U/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLA2hLnG-IKymHQe0VG1MxYHU0wMwg",
      "duration": 5205,
      "language": "ru",
      "channelName": "Mosfilm",
      "channelId": "UCm5U4zqpahzyNXBv5ZT51Jw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-23T03:43:58.431Z"
}