{
  "imdbId": "youtube-56egSZFJ9Ko",
  "title": "ELYAS M'BAREK in HEITER BIS CLOUDY (Romantic comedy full movie in German, comedy in full length)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=56egSZFJ9Ko",
      "title": "ELYAS M'BAREK in HEITER BIS CLOUDY (Romantic comedy full movie in German, comedy in full length)",
      "description": "💙 Filme in voller Länge auf Deutsch anschauen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Beste Freunde teilen alles - manchmal auch bescheuerte Ideen. So haben Tim und Can zum Beispiel eine besondere Masche, um Frauen rumzukriegen: Sie geben sich als unheilbar krank aus. Mit \"Fuck Ju Göthe\" Star ELYAS M'BAREK.\n\nHEITER BIS WOLKIG (2012)\nOriginaltitel: heiter bis wolkig\nMit: Max Riemelt, ELYAS M'BAREK, Anna Fischer, Jessica Schwarz\nRegie: Marco Petry \nFSK: Freigegeben ab 6 Jahren\n\nINHALTSANGABE:\nTim und sein Freund Can gehen in Bars und lügen den Mädchen vor, dass einer von ihnen unheilbar krank sei, damit sie Sympathie gewinnen und sich eine „Nummer“ für die Nacht sichern können. Tim lernt Marie kennen und macht mit ihr rum, aber natürlich verlieben sich die beiden ineinander. Marie kümmert sich jedoch um ihre ältere Schwester Edda, die krank ist und die „Lebensfreude“ verloren hat und viel Zeit im Bett verbringt, um auf den Tod zu warten. Obwohl Marie immer noch glaubt, dass Tim unheilbar krank ist, weiß Edda, dass Tim nur so tut.\n#Netzkino #ganzerFilm #elyasmbarek\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "56egSZFJ9Ko",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.127Z"
}