{
  "imdbId": "youtube-R7Jhdqp3UUE",
  "title": "어느 여대생의 고백(1958) / A College Woman's Confession (Eoneu yeodaesaeng-ui gobaeg)",
  "year": 1958,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=R7Jhdqp3UUE",
      "title": "어느 여대생의 고백(1958) / A College Woman's Confession (Eoneu yeodaesaeng-ui gobaeg)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00382\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00382\n\n영화글 : https://www.kmdb.or.kr/story/10/1932\n\n감독(Director) : 신상옥(Shin Sang-ok)\n출연 : 최은희(소영),김승호(최림),유계선(부인),최현(상호),김숙일(희숙),황정순(여피고),최남현(하숙주인),최승이(하숙주인 부인),황남(박관식),박암(검사),김용덕(점원),고미향(옥분),주선태(사장),윤왕국(비서),최성호(청년),이기호(취객),임동훈(취객),남춘역(노인),문일봉(박관식 부인),송정자(하녀),연영(의사),이예자(간호원),염석주(김변호사),김학(판사),김진광(배심),김도일(배심),정철(서기)\n\n줄거리 : 불우한 환경 속에서 법학을 전공하는 여대생 최소영(최은희)은 학비를 보내주시던 할머니가 돌아가시자, 학비를 조달하지 못해 어려움에 처한다. 소설가를 꿈꾸는 친구 희숙(김숙일)의 동정 어린 연극으로 소영은 국회의원 최림(김승호)의 딸로 위장해 그의 집에서 지내게 된다. 그녀는 열심히 공부하여 변호사가 되고, 첫 변론으로 어느 여죄수(황정순)의 변호를 맡는데 공교롭게도 그 여죄수의 과거는 자신의 과거와 흡사했다. 소영은 여죄수를 변호하면서 연약한 여성이 냉정한 자본주의 사회에서 살아가기가 얼마나 힘겨운지 강변하고 여인의 권리를 눈물겹게 주장한다. 변론을 성공적으로 마친 후 소영은 집으로 돌아와 최림의 아내(유계선)에게 자신의 죄를 고백한다.\n\nCast : Choi Eun-hee, Kim Seung-ho, Hwang Jeong-sun, Yoo Kye-seon, Choi Hyeon, Choi Nam-hyeon, Kim Suk-il, Kim Yong-deok, Ko Mi-hyang, Joo Seon-tae, Yoon Wang-kuk, Choi Seong-ho, Lee Ki-ho, Lim Dong-hun, Nam Chun-yeok\n\nSYNOPSIS (CONTAINS SPOILERS) : Choi So-young (Choi Eun-hee), a poor female law student is in trouble because her grandmother, who had been sending her tuition money, passes away. With the help of her friend Hee-suk, (Kim Suk-il) who dreams of becoming a writer, So-young fools Choi Rim (Kim Seung-ho), a lawmaker, into believing she is his daughter and moves in his house. She studies hard and becomes a lawyer. At her first trial, she defends a female inmate (Hwang Jeong-sun). Coincidentally, the story of the inmate is very much similar to hers. So-young defends her, saying how difficult it is for a woman to survive in a cold capitalism, arguing for her rights in tears. After she wins the case, she goes home and confesses her crime to Choi Rim's wife (Yu Gye-seon).",
      "id": "R7Jhdqp3UUE",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:24:26.037Z"
}