{
  "movieId": "youtube-8vYusvJe8YQ",
  "title": "이조잔영(1967) /Traces (Ijojanyeong) (1967)",
  "year": 1967,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8vYusvJe8YQ",
      "id": "8vYusvJe8YQ",
      "title": "이조잔영(1967) /Traces (Ijojanyeong) (1967)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/01559\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/01559\n\n감독(Director) : 신상옥(Shin Sang-ok)\n출연 : 오영일 , 문희 , 이대엽 , 이순재 , 황해\n줄거리 : 일제 말이 배경. 박동호(이대엽)는 노구찌(오영일)와 함께 징용병 열차에 앉아 지난 날을 회상한다. 한국의 여학교에서 교편을 잡고 있는 일본인 미술가 노구찌(오영일)는 일경에게 쫓기던 조선 독립군 박동호(이대엽)를 위기에서 구해준다. 박동호는 그 대가로 노구찌에게 이조 시대의 전통춤을 보여주기로 약속하고, 전통무용 전수자인 김영순(문희)을 소개한다. 영순의 춤을 보고 깊이 감동받은 노구찌는 그녀를 사랑하게 되고, 영순이 춤추는 모습을 화폭에 담고 싶어한다. 일본군에게 부모를 잃은 영순은 일본인을 극도로 혐오하지만 자기도 모르게 노구찌에게 빠져든다. 결혼을 허락받기 위해 노구찌의 집을 찾은 영순은 노구찌의 아버지가 바로 3.1 독립운동 당시, 자신의 아버지를 죽인 일본군이라는 사실을 알고 집을 뛰쳐나온다. 영순과 헤어진 후 노구찌는 영순의 그림을 완성하고, 여기에 '이조잔영'이라는 제목을 붙여 국선에 출품한다. 다시 현재의 징용 열차 안. 노구찌는 동호로부터 영순이 자신을 떠난 이유를 알게 된다. 영순에게 용서를 빌기로 결심한 노구찌는 기차에서 탈출할 것을 결심한다. 동호 역시 일본을 위해 싸울 이유가 없다며 노구찌와 함께 탈출을 감행하지만 경성으로 향하는 도중에 부상을 입고 죽는다. 한편, 이들이 탈출하는 동안, 조선은 해방을 맞고 노구찌의 아버지는 조선 청년들에게 살해된다. 간신히 살아서 경성에 도착한 노구찌는 영순의 집을 찾아가지만 일본 제국주의에 대한 분노가 가시지 않은 영순은 문을 열어주지 않는다. 좌절한 노구찌는 머리에 총을 겨눠 스스로 목숨을 끊는다.\n\nCasts : O Yeong-il, Moon Hee, Lee Dae-yub, Lee Soon-jae, Hwang Hae\n\nSYNOPSIS : A Japanese fine art teacher helps a Korean independence fighter to escape from a threat of being arrested by the Japanese police. The Korean man introduces him a gisaeng (Koran geisha) who learned Korean traditional court dance and he falls in love with her. However she hates Japanese because her parents died in the hands of Japanese and already has a Korean man who she is attached to. He is a fervent patriot, but his father is a strong supporter for Japanese colonizers. So he is drafted to the Second World War (1939-1945), while the Japanese kills himself out of desperation. As Korea is liberated from Japan on August 15, 1945, he comes back with his body injured only to die as soon as he arrives at home. The pro-Japanese family's house is set on fire by crowds of people.",
      "addedAt": "2025-12-26T00:22:33.922Z",
      "thumbnail": "https://i.ytimg.com/vi/8vYusvJe8YQ/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBxxvyNf2gufDoYhpUW3OLR2YEtew",
      "duration": 4854,
      "language": "ko",
      "year": 1967,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:22:33.980Z"
}