{
  "imdbId": "youtube-fwttitYSH08",
  "title": "Leather Jacket Jungle / Teenage Gang Debs (1966, Crime) by Sande N. Johnsen | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=fwttitYSH08",
      "title": "Leather Jacket Jungle / Teenage Gang Debs (1966, Crime) by Sande N. Johnsen | Movie",
      "description": "They all talk, fight and love just one way--DIRTY!\nA no-good Manhattan girl moves in on a Brooklyn gang. Using her obvious charms she gets the leader killed in a fight over her and then takes up with the victor and new head man. Then she starts pushing him to get out onto the streets to mix it with rival gangs.\n\nColorized version: https://youtu.be/TtW-At6_4yE\n\n\nOriginal title: Teenage Gang Debs (1966) AKA: Leather Jacket Jungle\n\nThis film is subtitled in many language options.\n\nDirector: Sande N. Johnsen\nWriters: Hy Cahl, William Shakespeare (uncredited)\nStars: Diane Conti (as Terry the Lady Macbeth character), Linda Gale, Eileen Dietz\nGenres:  Classics, Crime, Literary\n\n\n00:00 Full Movie (with subtitles)\n00:35 Teenage gang dynamics unfold as new member Terry faces challenges and intrigue within the group.\n11:14 Teenage gang dynamics unfold with power struggles, relationships, and initiation rituals in a new environment.\n22:16 Teenage gang members navigate loyalty, love, and conflicts in a rumble-filled environment.\n29:07 Teenage gang violence erupts in Brooklyn, leading to a deadly confrontation and a disturbing aftermath.\n36:08 Teenage gang members plan a violent raid on a rival group's turf, leading to a deadly showdown.\n51:39 Teenage gang members discuss avoiding police attention, planning a party, and plotting against a rival gang.\n56:47 Teenage gang members discuss quitting the club and a upcoming rumble, leading to tension and conflict.\n1:02:54 Teenage gang members plan to take revenge on a former member for betraying their group.\n1:09:28 A warning to stay away from a girl to avoid gang violence and retaliation.\n\n\n@CultCinemaClassics\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "fwttitYSH08",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:37:50.888Z"
}