{
  "imdbId": "youtube-w6We3nzPtv8",
  "title": "Los rebeldes de Arizona (1970) Cine del Oeste - Película en español",
  "year": 1970,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=w6We3nzPtv8",
      "id": "w6We3nzPtv8",
      "title": "Los rebeldes de Arizona (1970) Cine del Oeste - Película en español",
      "description": "Peggy y Allen, recién casados por el alcalde de Tombstone, piden refugio en una hacienda mexicana para pasar la noche. Los dueños de la hacienda están amenazados por el banquero de Tombstone, que intenta apoderarse de sus tierras. Solucionan el problema dando dinero a los propietarios y después asaltan el banco para recuperarlo.\n\nDirección José María Zabalza\nReparto: Carlos Quiney, Claudia Gravy, Miguel de la Riva\n\nTítulo original: Los rebeldes de Arizona (Adios Cjamango)\n\n00:00 Película Completa\n01:15 Una pareja desesperada busca matrimonio de un dueño de cantina convertido en alcalde\n03:14 La nueva esposa de Jackson presencia su mortal tiroteo\n07:36 Conspiradores del ferrocarril planean apoderarse de las tierras vitales de los recién casados\n12:32 Misteriosos incendiarios queman el rancho de la pareja\n25:35 El sheriff confronta a Peggy sobre el dinero robado del banco\n39:11 Rancheros mexicanos se unen para defender la hacienda de Juan\n52:58 Traficantes de armas cierran un trato peligroso con guerreros Apache\n1:18:21 La confrontación final de un padre con la justicia tribal sella su destino\n1:21:51 Peggy y Jackson descubren los secretos de una mina de oro abandonada\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:34:14.126Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/w6We3nzPtv8/maxresdefault.webp?v=6720be30",
      "duration": 5178,
      "language": "en",
      "year": 1970,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "AD",
          "ES",
          "IT"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:34:14.304Z"
}