{
  "imdbId": "youtube-iDjxLQfVLKc",
  "title": "Astral City: Unser Heim (SCIFI FANTASY | Unzensiert exklusiv für Netzkino-Members)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=iDjxLQfVLKc",
      "id": "iDjxLQfVLKc",
      "title": "Astral City: Unser Heim (SCIFI FANTASY | Unzensiert exklusiv für Netzkino-Members)",
      "description": "ASTRAL CITY: UNSER HEIM (2010)\nOriginaltitel: Nosso Lar\nMit: Renato Prieto, Fernando Alves Pinto, Rosanne Mulholland, Inez Viana, Rodrigo dos Santos\nRegie: Wagner de Assis\nFSK: Freigegeben ab 12 Jahren\n\nINHALTSANGABE:\nAls der Arzt Dr. André Luiz seine Augen aufschlägt, muss er erkennen, dass er tot ist. In einer bedrohlich wirkenden Wüste beginnt die abenteuerliche Reise von Luiz. Er stößt dabei auf die mysteriöse Astral City, die jedoch nicht der Himmel, sondern eine Art Heimat in der spirituellen Dimension ist. Luiz ist also nicht am Ende seiner Reise angekommen, sondern viel mehr am Anfang.\nWas passiert eigentlich mit mir, wenn ich tot bin? Das ist definitiv immer noch die am kontroversesten diskutierte Frage der Menschheitsgeschichte, eben weil sie nicht zu beantworten ist. Oder vielleicht doch? Zumindest gibt sich der brasilianische Film Astral City – A Spiritual Journey (Orig.: Nosso Lar) auf die spirituelle Suche nach der Antwort auf die Frage aller Fragen und das mit einem Aufwand an Special Effects, die bis dato im brasilianischen Film so noch nie zu sehen waren...\nBasierend auf dem in Brasilien mehr als zwei Millionen Mal verkauften Buches Nosso Lar des Mediums Chico Xavier, der durch zahlreiche Fernsehauftritte und Publikationen den Spiritualismus in seinem Heimatland populär machte, brachte Regisseur Wagner de Assis dieses Werk im Jahre 2010 auf die Leinwand. Zu diesem Zeitpunkt war Astral City – A Spiritual Journey die teuerste Produktion in Brasilien überhaupt und gewann zudem auch einige Filmpreise.\nNeben der faszinierenden Optik des Films ist es vor allem die Story, die den Zuschauer automatisch in seinen Bann zieht. Denn als der erfolgreiche, aber selbstsüchtige Arzt Dr. André Luiz (Renato Prieto) seine Augen aufschlägt, muss er erkennen, dass er tot ist. Er befindet sich in einer bedrohlich wirkenden Wüste, die angefüllt ist mit den Schreien der Wesen, die in den Schatten leben. Er spürt Hunger, Durst und eine durchdringende Kälte. Seine Schmerzen und Zweifel werden immer größer. Was für ein Schicksal ist das?, denkt er sich, das kann es doch noch nicht gewesen sein- und begibt sich auf eine abenteuerliche Reise. Dabei stößt er auf die mysteriöse Astral City, eine Stadt in den obersten Schichten der Erdatmosphäre…und macht dort eine extrem wichtige Entdeckung: Sich selbst! Neue Erfahrungen und Wissen durchströmen ihn in seiner Zeit in Astral City und er lernt das Leben in dieser anderen Dimension kennen und schätzen. Doch nach wie vor sehnt er sich danach zur Erde zurückzukehren und seine geliebte Familie wiederzusehen. Doch als ihm dieser Wunsch erfüllt wird, erkennt Andre Luiz die ganz große, einzige Wahrheit: Das Leben geht eines Tages für jeden Menschen weiter...\n#Netzkino #ganzerFilm #ScienceFiction\n\nCOPYRIGHT:\nSpotfilm Networx GmbH is a serious and legal video on demand company located in Berlin, Germany. We are holding a proper license for all of our published movies. For any questions contact copyright@spotfilm-networx.com",
      "addedAt": "2025-12-24T00:01:17.214Z",
      "thumbnail": "https://i.ytimg.com/vi/iDjxLQfVLKc/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLC9jhVg1j0lrGarQ65pMD5XcSCmOQ",
      "duration": 6560,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T00:01:17.214Z"
}