{
  "imdbId": "youtube-hPgYOeRadX4",
  "title": "I See Naked / Vedo nudo 1969 (Italian Comedy) starring Nino Manfredi",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=hPgYOeRadX4",
      "title": "I See Naked / Vedo nudo 1969 (Italian Comedy) starring Nino Manfredi",
      "description": "Seven sketches with seven funny characters all played by great Nino Manfredi.  Including the title sketch “I See Naked” in which a fashion editor begins to see naked women everywhere he goes.\n\nOriginal title: Vedo nudo (1969)\n\n\nThis film is available with Italian audio, and subtitled in many languages.\n\nDirector: Dino Risi\nWriters: Ruggero Maccari, Fabio Carpi, Dino Risi\nStars: Nino Manfredi, Sylva Koscina, Véronique Vendell\nGenres: Italian cinema, Comedy, Foreign Film\n\n\n00:00 - Full Movie (with subtitles)\n05:55 - An actress charms hospital staff with her beauty and kindness while offering help to an injured man.\n12:29 - A comedic Italian film unfolds in a hospital, blending romance and quirky courtroom antics.\n18:45 - Misunderstandings and chance encounters spark a hilarious court case over a bizarre incident.\n26:46 - Secrets and misunderstandings complicate relationships as characters navigate unexpected meetings.\n34:32 - An unexpected encounter in Rome leads to a shared meal and engaging conversation between Ercole and Carlo Alberto.\n41:02 - A comedic dinner conversation delves into relationships, preferences, and family quirks.\n49:06 - A man’s wild night out spirals into unexpected situations and humorous misunderstandings.\n1:00:36 - Themes of deception and infidelity culminate in a dramatic manhunt for a captured murderer.\n1:18:18 - Relationships and desires are explored during a rainy evening filled with misunderstandings.\n1:29:34 - Hallucinations and intoxication lead to awkward encounters in this comedic Italian romp.\n1:47:24 - A humorous exploration of perception and nudity unfolds in a clinic setting.\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "hPgYOeRadX4",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:34:47.603Z"
}