{
  "imdbId": "youtube-Zhcfx_07LHA",
  "title": "A Special Investigator, One-Armed Kim Jong-Won (Teugbyeolsusabonbu oepal-i Gim Jongwon)(1975)",
  "year": 1975,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Zhcfx_07LHA",
      "title": "A Special Investigator, One-Armed Kim Jong-Won (Teugbyeolsusabonbu oepal-i Gim Jongwon)(1975)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/02919\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/02919\n\n감독(Director) : 이원세(Lee Won-Se)\n출연 : 박근형,우연정,이치우,문오장,이종만,김남일,김애경,최성,나시찬,이강조,박동룡,권오상,최무웅,황건,최재호,장춘언,임해림,왕은희,전효진,차서영,현주,김경희,노사강,최은하,안진수,나갑성,박용일,임생출,이예성,최민규,최석,이석구,한명환,정규영,박종설\n\n줄거리 : 남로당과는 별개의 조직을 갖고 있는 김종원을 눈의 가시처럼 여기던 김삼룡은 심복부인 임충자와 그 오빠 임충복을 시켜 새로운 지령을 주고 특별수사본부에 정보를 제공, 습격하게 한다. 빠져나온 김종원은 공산주의와 남로당에 회의를 느끼고 특별수사본부에 협력하여 김삼룡의 조직을 하나 둘씩 파괴한다. 특별수사본부는 김종원에게 빨치산 사령관 임충자의 체포에 협조해 줄것을 종용하나 이미 그녀는 싸늘한 시체가 되고 만다. 법정은 김종원에게 사형선고에서 무죄를 선고하나 모든 것을 상실한 김종원은 이미 삶의 의욕이 없다.\n\nCasts : Park Keun-Hyeong, Woo Yeon-Jeong, Moon Oh-Jang\n\nSYNOPSIS : Kim Sam-Ryong, who thinks Kim Jong-Won a pin in the neck because he has a separate organization from Namro-Dang, gives a new order to Lim Chung-Ja and her brother Lim Chung-Bok and makes them attack the special investigation department, offering information to them. Escaping from his organization, he is skeptical about Namro-Dang and Communism, cooperates with the special investigation department, and destroys Kim Sam-Ryong's organizations one by one. The special investigation department persuades Kim Jong-Won to help to arrest Lim Chung-Ja, a partisan, but she is already dead. The court finds Kin Jong-won with death penalty not guilty, but he has already lost the will to live.",
      "id": "Zhcfx_07LHA",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:23:57.407Z"
}