{
  "imdbId": "youtube-mzpKPcCFlX0",
  "title": "Paranormal Vitality - Ganzen Film kostenlos schauen in HD bei Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mzpKPcCFlX0",
      "title": "Paranormal Vitality - Ganzen Film kostenlos schauen in HD bei Moviedome",
      "description": "Jetzt den Mystery-Thriller \" Paranormal Vitality \" in ganzer Länge bei #Moviedome sehen. Mehr #ganzeFilme entdecken: Abonnieren ► http://bit.ly/MoviedomeAbo \n\nIm März 2006 startet die Ärztin Dr. Helen Jara (Mercè Montalà) ein gewagtes Experiment: Sie will beweisen, dass einige Formen der Schizophrenie ihren Ursprung in der Paranormalität haben. Dafür versammelt sie mit Hilfe des Parapsychologen Matías Kram (Raúl Álvarez) fünf Patienten in einem Haus, in dem es schon zu vielen übernatürlichen Geschehnissen gekommen ist. Doch der Horror steht den Beteiligten in Gestalt von Ainara (Cláudia Pons), der jüngsten der Patientinnen, erst noch bevor... \nDer Film basiert auf den ärztlichen Notizen von Dr. Jara und Bild- und Tonaufnahmen ihres Experiments, von dem manche sogar behaupten, es hätte tatsächlich stattgefunden. Paranormal Vitality geht unter die Haut, ein beunruhigender Film, der nicht unbedingt für zarte Seelen geeignet ist.\n\nJetzt “ Paranormal Vitality ” kostenlos als ganzen Film auf Deutsch sehen.\n\n\n►Abonniere #Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo ►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social-Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #Horror #movie #film #spielfilm #ganzer Film #HD #kostenlos #typhoid #Geister #paranormal #Irrenanstalt #mystery #thriller\n \nFilmlänge: 77 Minuten \nDVD-Start (DE): 2012\n\nDie Darsteller: \nMiriam Planas in der Rolle der Lis\nMerce Montala in der Rolle der Dra. Lara\nClaudia Pons in der Rolle der Ainara\nDafnis Balduz in der Rolle des Kai\n\n\nJetzt ganze Filme bei #Moviedome anschauen \n\nFinde Movies in ganzer Länge diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf Deutsch schauen.\n\nGanzer Film auf Deutsch \nDen Mystery-Thriller “ Paranormal Vitality ” in voller Länge auf Deutsch ansehen.",
      "id": "mzpKPcCFlX0",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:35:40.868Z"
}