{
  "imdbId": "youtube-jb-_n_N7M7A",
  "title": "Anatomy of a Psycho 1961 | Ronnie Burns, Pamela Lincoln | Full Movie | with subtitles",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=jb-_n_N7M7A",
      "title": "Anatomy of a Psycho 1961 | Ronnie Burns, Pamela Lincoln | Full Movie | with subtitles",
      "description": "A Psychotic Killer prowls the night! ... Will he be stopped before he kills again?\nThe crazed brother of a condemned killer sent to the gas chamber swears vengeance on those he holds responsible for his brother's execution.\n\nOriginal title: Anatomy of a Psycho (1961)\n\nColorized version: https://youtu.be/9LindFpzy6Q\n\nDirector: Boris Petroff \nWriters: Jane Mann, Don Devlin, Edward D. Wood Jr.\nStars: Ronnie Burns, Pamela Lincoln, Darrell Howe \nGenres: Classics, Cult Film, Crime, Drama, Thriller\n\n00:00 Full Movie\n00:46 💔 A man named Jim Slade is sentenced to two and a half years of hard labor for refusing to fight in a war, but is later pardoned when the war ends.\n21:02 💰 A group of strangers hold up a bank in Galveston, looking for a large sum of money that was supposed to arrive but is not there.\n24:51 🎵 A stranger is offered money to help defend a town against a gang of killers who want to steal a large sum of money.\n32:53 🔥 A group of unstable individuals are causing havoc in Galveston, including setting fire to a building and being held temporarily in a jail cell.\n56:06 🤝 A deal is proposed to prevent someone from taking a large sum of money, involving a staged fight and a hold-up.\n1:06:54 💰 A plan is devised to rob a bank and kill the sheriff, but the mastermind has ulterior motives and betrays his accomplices.",
      "id": "jb-_n_N7M7A",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:41:28.919Z"
}