{
  "imdbId": "youtube-wsI8N9GQJLQ",
  "title": "현상붙은 사나이(1961) / A Wanted Man(1961)",
  "year": 1961,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=wsI8N9GQJLQ",
      "title": "현상붙은 사나이(1961) / A Wanted Man(1961)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00654\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00654\n\n감독(Director) : 김묵(Kim Muk)\n출연 : 황해, 엄앵란, 박노식, 김석훈, 장동휘, 이흥섭, 조기삼, 이동수, 서경희, 이예춘, 최봉, 이용, 양일민, 장혁, 남춘역\n\n줄거리 : 어린 시절에 같은 고아원에서 자란 창오와 여동생 옥이 그리고 친구 명구와 영수. 창오는 조직폭력배 우두머리로 성장하고 경찰 경위가 된 명구로부터 쫓기는 신세다. 한편, 고아원 시절부터 서로 좋아해 온 옥이와 영수는 재회하게 되면서 결혼을 다짐하나 창오는 라이벌 조직의 운전사로 일하는 영수를 받아들이지 않는다. 두 조직 사이의 긴장이 고조되고 조직과 경찰과의 전쟁이 치열해지자 모두의 목숨이 위험해진다.\n※ 본 영화는 전반 약 32분만 현존하며 내용의 이해를 돕기 위해 줄거리 요약 화면자막을 삽입하였다. \n\nCAST : Hwang Hae, Um Aing-ran, Park Nou-sik, Kim Seok-hun, Jang Dong-hee, Lee Heung-seop, Seo Kyeong-hui, Lee Yea-chun, Choe Bong, Lee Yong, Yang Il-min, Chang Hyeok, Nam Chun-yeok\n\nSYNOPSIS : Chang-o and his younger sister Ok and their pals Myeong-gu and Young-soo all grew up together on the same orphanage. Years later, Chang-o is now a ruthless gang leader and is being chased by Myeong-gu, who has himself become a cop. Meanwhile, Ok and Young-soo, who have been fond of one another since childhood, reunite and profess their love for each other. However, because Young-soo is working for a rival gang, Chang-o vehemently opposes the relationship. And as rival gangs wage war amongst themselves and with the police, everyone is thrust into perilous danger.\n※ Only the first 32 minutes of the film currently exists today. The plot summary has been added in the form of title cards to aid the viewing experience.",
      "id": "wsI8N9GQJLQ",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:22:45.903Z"
}