{
  "imdbId": "youtube-SJcx8qDs8jM",
  "title": "That's Hicksploitation: The Origin Of Southern Cinema",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=SJcx8qDs8jM",
      "title": "That's Hicksploitation: The Origin Of Southern Cinema",
      "description": "The fascinating origins of \"hicksploitation\"—the subgenre that brought moonshiners, feuding families, and outrageous stereotypes to the big screen. Joyner explores how smaller theaters in the South, unable to afford studio films, paved the way for indie filmmakers and a new kind of exploitation cinema.\n\nFrom the silent era’s “Moonshine Molly” to the controversial “Child Bride,” https://youtu.be/KgxJ4CY5L_U, this documentary traces how Hollywood and independent filmmakers turned the American South into a land of melodrama, taboo, and unforgettable characters.\n\nExplore how low-budget filmmakers thrived outside the studio system, pushing boundaries with stories of rural life, forbidden romance, and even horror in the swamps. See how these films shaped pop culture, inspired TV hits like “The Beverly Hillbillies,” and paved the way for classics like “Bonnie and Clyde” and “Deliverance.”\n\n\nDirected by Daniel Griffith\n\n\n0:00:00 C. Courtney Joyner introduces the roots of Southern cinema and the rise of hicksploitation.\n0:06:02 Joyner recounts how filmmakers like Christie Cabanne and May Marsh ignite early Southern melodrama with “Moonshine Molly.”\n0:12:25 Kroger Babb shocks small-town audiences by marketing “Mom and Dad” as both educational and sensational.\n0:18:10 Joyner spotlights Judy Canova’s rise as the beloved “Nightingale of the Ozarks” in Republic Pictures’ rural comedies.\n0:24:35 Joyner reveals how controversial films like “Child Bride” and “Baby Doll” push boundaries and spark debate.\n0:31:01 Robert Mitchum races through the South in “Thunder Road,” blending moonshine legends with car-chase thrills.\n0:37:45 Joyner explores how Southern horror films like “Attack of the Giant Leeches” and “2000 Maniacs” turn swamps into nightmares.\n0:44:10 Joyner connects the legacy of hicksploitation to modern pop culture, from “The Beverly Hillbillies” to Burt Reynolds’ Southern icons.\n\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA\n\n@CultCinemaClassics",
      "id": "SJcx8qDs8jM",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:30:45.513Z"
}