{
  "imdbId": "youtube-r-vWPHzI7ZI",
  "title": "The Wedding Day (Sijibganeun nal)(1956)",
  "year": 1956,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=r-vWPHzI7ZI",
      "title": "The Wedding Day (Sijibganeun nal)(1956)",
      "description": "TBS 영화해설 : https://youtu.be/o1fto7kocSI\n\n영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00313\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00313\n\n영화글 : https://www.kmdb.or.kr/story/10/989\n\n감독(Director) : 이병일(Lee Byeong-Il)\n출연 : 조미령(입분),김승호(맹진사),최현(미언),김유희(갑분),송해천,서월영,석금성,하지만,황남,정민,주선태,김칠성,김정옥,이일선,변기종,임운학,정철,강철,나옥주,장아영,이경자,김옥경,이정희,김문숙 무용연구소(특별출연)\n\n줄거리 : 딸을 가진 맹 진사(김승호)는 도라지골 판서댁 아들 미언을 사위로 맞아 세도가의 사돈이 되리라고 몹시 뽐낸다. 딸 갑분(김유희)도 판서댁에 시집가는 것을 내심 반긴다. 어느 날 마을을 지나는 한 선비(주선태)가 맹 진사댁에 며칠 묵기를 청하고, 처음 그를 내치려던 맹 진사는 그가 도라지골에서 왔다는 소리에 태도를 바꿔 극진히 대접한다. 선비는 무심결에 김 판서댁 아들 미언이 절름발이라는 말을 흘리고, 이 소문은 삽시간에 온 동네에 퍼진다. 세도가의 사돈이 되는 것도 좋지만 딸 갑분(김유희)을 절름발이에게 시집보낼 수는 없다고 생각한 맹 진사는 잔꾀를 내어 딸의 몸종 입분(조미령)을 대신 시집보내기로 한다. 그런데 혼인날 막상 행례청에 나타난 미언(최현)은 절름발이가 아닌 늠름하고 당당한 사나이였고, 며칠 전 맹 진사네에 머물었던 도라지골 선비는 김 판서의 아우로, 맹 진사의 됨됨이를 알아보기 위해 거짓 소문을 퍼트렸던 것임이 밝혀진다. 상황을 바로잡기 위해 맹 진사는 평소 입분을 연모하던 머슴 삼돌(황남)에게 윗마을에 숨어 있는 갑분을 데려오면 그를 입분이와 혼인시켜주겠다고 약속한다. 이 말에 삼돌은 부리나케 갑분이를 데리고 온다. 그러나 때는 이미 늦어 몸종 입분이가 미언과 혼례를 치르게 된다. 첫날밤을 보내는 자리, 입분은 미언에게 모든 사실을 고백하지만, 미언은 입분의 참된 마음에 오히려 기뻐한다. 이튿날 입분은 미언과 함께 도라지골로 떠나고, 갑분과 맹 진사는 그 모습을 바라보며 눈물을 흘린다.\n\nCasts : Cho Mi-Ryeong,Kim Seung-Ho,Choi Hyeon,Kim Chil-Seong,Kim Yu-Hee,Choi Nam-Hyeon\n\nSYNOPSIS : Master Maeing (Kim Seung-ho) is very proud that an influential family will soon be his esteemed in-laws when his loving daughter, Mi-yeon, marries their son. A few days before the wedding Maeing hears a rumor that his future son-in-law has a cripple leg. Regretting that he can't give his lovely daughter to a cripple, he decides to marry his maid to him instead. Unexpectedly the future son-in-law shows up at the wedding hall and he is not a cripple, but a healthy and handsome youth. Feeling embarrassed, there is no way but to wed the maid to him.",
      "id": "r-vWPHzI7ZI",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:25:21.281Z"
}