{
  "movieId": "youtube-is9izUA6was",
  "title": "A 1945 Film-Noir Nightmare: Strange Illusion | Dreams Reveal Danger. Reality Holds The Key.",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=is9izUA6was",
      "id": "is9izUA6was",
      "title": "A 1945 Film-Noir Nightmare: Strange Illusion | Dreams Reveal Danger. Reality Holds The Key.",
      "description": "Strange Illusion is a 1945 film noir directed by Edgar G. Ulmer. Loosely inspired by Hamlet, it was envisioned as a modern crime film.  According to noir historian Spencer Selby the film is \"a stylish cheapie by the recognized master of stylish cheapies.\"\n\nSynopsis: \nA college student named Paul begins having bizarre, recurring dreams about a faceless, sinister man. As the dreams intensify, he grows increasingly suspicious of his widowed mother's suitor, believing he may have ulterior motives.\n\nMain Actors:\nJames Lydon - Paul Cartwright\nWarren William - Brett Curtis\nSally Eilers - Virginia Cartwright\nRegis Toomey - Dr. Vincent\nCharles Arnt - Professor Muhlbach\nGeorge H. Reed - Benjamin\nJayne Hazard - Dorothy Cartwright\nJimmy Clark - George\nMary McLeod - Lydia\nPierre Watkin - Armstrong\nSonia Sorel - Miss Farber\nVic Potel - Mac-Game Warden\nGeorge Sherwood - Langdon\nGene Stutenroth - Sparky\nJohn Hamilton  Mr. Allen\n\nBlack & White version: https://youtu.be/m6yPRZ6KbvM\n\n\n00:00 Full movie (with subtitles)\n01:35 Paul Cartwright reveals his father, Judge Albert Cartwright, was killed in a mysterious accident two years ago.\n03:07 Paul wakes up from a vivid nightmare involving his mother and a mysterious man.\n08:37 Paul returns home unexpectedly and learns about Brett Curtis, his mother’s new suitor.\n24:15 Paul discovers a file on Claude Barrington, a dangerous criminal, in his father’s records.\n32:36 Brett Curtis meets with Professor Muhlbach, revealing a sinister plan involving Paul’s family.\n47:56 Paul voluntarily checks into Muhlbach’s facility to investigate Curtis and Muhlbach further.\n1:06:52 Paul uncovers a critical clue—a truck part linked to his father’s death—at an abandoned farm.\n1:15:07 Police confirm Brett Curtis is actually Claude Barrington, using fingerprints and past records.\n1:19:00 Paul escapes Muhlbach’s facility as the police close in on Curtis.\n1:23:29 Paul confronts Curtis at a boathouse, saving Dorothy and exposing Curtis’s true identity.\n1:24:24 The film concludes with Paul and his family finding closure and moving forward.",
      "addedAt": "2025-12-27T00:33:50.043Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/is9izUA6was/maxresdefault.webp",
      "duration": 5113,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:33:50.207Z"
}