{
  "movieId": "youtube-EowGrcan0DI",
  "title": "Zombie Invasion War (ZOMBIE ACTION mit DANNY TREJO | Ungeschnitten exklusiv für Netzkino-Members)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=EowGrcan0DI",
      "id": "EowGrcan0DI",
      "title": "Zombie Invasion War (ZOMBIE ACTION mit DANNY TREJO | Ungeschnitten exklusiv für Netzkino-Members)",
      "description": "ZOMBIE INVASION WAR (2012)\nOriginaltitel: Rise of the Zombies\nMit: Mariel Hemingway, Ethan Suplee, LeVar Burton, Danny Trejo\nRegie: Nick Lyon\nFSK: Freigegeben ab 18 Jahren\n\nINHALTSANGABE:\nNach einer weltweiten, rätselhaften Virusinfektion wird auch San Francisco von einer riesigen Horde Zombies überrannt. Einer kleinen Gruppe Überlebender gelingt jedoch die Flucht. Sie wollen nach Alcatraz, da sie hoffen, in dem Hochsicherheitsgefängnis geschützt zu sein. Doch nur eine schwangere Frau erreicht letztendlich das Gefängnis. Dort trifft sie auf eine weitere Gruppe Überlebender. Zu ihrem Unglück stellen sie alsbald fest, dass die Zombies sogar schwimmen können und nun das Gefängnis belagern. Währenddessen verbreitet sich die Nachricht, dass ein Wissenschaftler ein Heilmittel für die Infizierten in einer nahegelegenen Universität gefunden hätte. Da dies ihre letzte Überlebenschance zu sein scheint, macht sich die Gruppe auf den gefährlichen Weg dorthin …\n#Netzkino #ganzerFilm #DannyTrejo\n\nCOPYRIGHT:\nSpotfilm Networx GmbH is a serious and legal video on demand company located in Berlin, Germany. We are holding a proper license for all of our published movies. For any questions contact copyright@spotfilm-networx.com",
      "addedAt": "2025-12-24T00:04:55.885Z",
      "thumbnail": "https://i.ytimg.com/vi/EowGrcan0DI/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLA1CQBBi7ZVtCxY9nM7cnAT4mGe4w",
      "duration": 5231,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T00:04:55.885Z"
}