{
  "movieId": "youtube-cY1ssR--Dr8",
  "title": "Confession of an Actress ( Eoneu Yeobaeu-ui Gobaek )(1967)",
  "year": 1967,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=cY1ssR--Dr8",
      "id": "cY1ssR--Dr8",
      "title": "Confession of an Actress ( Eoneu Yeobaeu-ui Gobaek )(1967)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/01451\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/01451\n\n감독(Director) : 김수용(Kim Su-Yong)\n출연 : 김진규,남정임,한성,허장강,황정순,전계현,전창근,김정옥,석금성,임해림,문미봉,석운아,조덕성,황인철,추봉,최준,최무웅,윤일주,박철,태무진\n\n줄거리 : 지금은 폐인이 된 왕년의 명배우 김진규(김진규)는 어느 영화 촬영 현장을 지나다 옛 동료 황정순(황정순) 여사를 만나 추억에 잠긴다. 그 옛날 김진규는 동료 여배우인 정미영(남정임)과 결혼을 약속했던 사이. 영화사에서는 김진규의 상대역을 맡은 정미영이 출산으로 당장의 출연이 불가능해지자 여배우를 교체하려고 한다. 김진규는 그럴 수는 없다고 우기다 영화사에 미운 털에 박히고 설상가상으로 정미영은 김진규의 아이를 낳다 죽는다. 그 뒤 김진규는 폐인처럼 살아왔던 것이다. 오랜만의 해후의 자리에서 황 여사는 김진규의 딸이 살아있다는 사실을 밝힌다. 황 여사가 말한 술집으로 찾아가 딸(남정임)을 만난 김진규는 차마 자신을 아버지라고 밝히지 못하고 돌아온다. 대신 옛 동료를 통해 딸을 영화배우로 데뷔시킨다. '남정임'이라는 예명으로 데뷔한 딸은 스타로 급성장하고 김진규는 그런 딸에게 편지를 보내 배우로서의 몸가짐과 연기 방법을 지도한다. 김진규에게 혈육의 정을 느낀 남정임은 김진규를 찾아가지만 김진규는 그녀를 피한다. 남정임은 영화사에 요구해 김진규와의?공연을 성사시키고, 두 사람은 극중에서 부녀로 출연한다. 극중 아버지가 죽는 장면을 찍던 날, 김진규는 실제 숨을 거둔다. 뒤늦게 김진규가 아버지임을 안 남정임은 아버지의 시체를 부여잡고 오열한다. (영화)\n\nCasts : Kim Jin-Kyu, Nam Jeong-Im, Han Seong, Heo Jang-Kang\n\nSYNOPSIS : Once-a-succesful-actor, but now a loser by chance finds his lost, now a grown-up daughter at a pub. He is shameful of himself as he is now, so hides his identity and helps her to debut as an actress. She emerges as a star in the film community and comes to know that the man is her father when he has already disappeared. She searches for her lost father by tracing rumors only to find him dead.",
      "addedAt": "2025-12-26T00:23:25.500Z",
      "thumbnail": "https://i.ytimg.com/vi/cY1ssR--Dr8/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBMYefPIfV3pKhf-Z0lX-7XYH1LMg",
      "duration": 5233,
      "language": "ko",
      "year": 1967,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:23:25.534Z"
}