{
  "imdbId": "youtube-ETrXL2QP1Kc",
  "title": "장남(1984) / The Oldest Son (Jangnam)",
  "year": 1984,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ETrXL2QP1Kc",
      "id": "ETrXL2QP1Kc",
      "title": "장남(1984) / The Oldest Son (Jangnam)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/03833\n(English) https://www.kmdb.or.kr/eng/db/kor/detail//movie/K/03833\n\n영화글 : https://www.kmdb.or.kr/story/10/5105\n\n감독(Director) : 이두용(Lee Doo-yong)\n출연 : 신성일(장남), 태현실(맏며느리), 김일해(아버지),황정순(어머니),김희라(차남)  \n줄거리 : 어느 컴퓨터 회사의 기술개발 실장으로 있는 장남은 현대인의 표본 같은 인물이다. 고향이 수몰지구로 선정되어 평범한 촌부로 살던 노부모님이 상경하게 된다. 그러나 시골에서만 살아온 노부모님은 갑작스런 연립주택 생활이 불편하게 되어 널찍한 공터에 임시가옥을 지어놓고 사는 막내에게로 옮긴다. 그 공터는 노부모님을 편히 모실 단독주택을 짓기 위해 장남이 오래전에 준비해 둔 대지였다. 막내의 결혼으로 다시 쓸쓸해진 부모님을 위해 예정을 앞당겨 주택 건축을 착수한다. 그럴 즈음 장남은 공장신축의 감독을 맡아 제주도로 내려가게 되어 주택 짓기의 현장책임자를 차남이 맡는다. 매일 현장에 나와 흐뭇하게 지켜보는 노부부. 이윽고 온 가족이 다함께 모여 살아가자던 꿈의 보금자리인 주택의 완성을 눈앞에 둔 어느 날 노모께서 홀연히 숨을 거둔다. 제주도에서 뒤늦게 비보를 듣고 달려온 장남. 효도하고 잘할 때까지 어머니는 기다려 주시지 않는다고 슬퍼한다.\n\nCasts : Shin Seong-il , Tae Hyun-sil , Kim Il-hae , Hwang Jung-seun , Kim Hee-ra \n\nSynopsis : The oldest son is a typical modernized man. When his hometown is filled with water for a new dam, his elderly parents leave and come to Seoul. However, his parents are uncomfortable with the sudden move to a tenement apartment. They move in with their youngest who has built a temporary house on a vacant lot which the oldest son has prepared in order to build his parents a house. Around this time, the oldest son goes to Jeju Island on business. He leaves the responsibility to his brother to watch over the construction of their parents' house. His elderly parents go to the construction site every day and watch with great satisfaction. Soon, a day when their new house is almost finished, the mother suddenly passes away. The oldest son belatedly hears the sad tidings. As he reaches Seoul, he stands before his mother's body and sobs sadly.",
      "addedAt": "2025-12-26T00:23:12.141Z",
      "thumbnail": "https://i.ytimg.com/vi/ETrXL2QP1Kc/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDwvhEtIcGTfqRzD-ptAklzCMcxew",
      "duration": 6518,
      "language": "ko",
      "year": 1984,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:23:12.156Z"
}