{
  "movieId": "youtube-lYx6pHtubLI",
  "title": "Magic on the Frozen Lake | A Miracle on Christmas Lake | Hallmark 2025 Christmas Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=lYx6pHtubLI",
      "id": "lYx6pHtubLI",
      "title": "Magic on the Frozen Lake | A Miracle on Christmas Lake | Hallmark 2025 Christmas Movie",
      "description": "Magic on the Frozen Lake | A Miracle on Christmas Lake | Hallmark 2025 Christmas Movie - After a teenage boy loses his best friend and his Dad both around Christmas he quits his favorite sport of hockey and turns from is friends. When an ice rink magically appears on the frozen lake near his home, he reminisces the good times.\n\nWatch A Miracle on Christmas Lake, a full Hallmark Christmas movie where a teenage boy faces heartbreak after losing his best friend and his father during the holiday season. Turning away from hockey and drifting from his friends, his world begins to change when a magical ice rink appears on the frozen lake near his home, reminding him of happier times and the joy of Christmas. Perfect for fans of Hallmark Christmas movies, heartwarming holiday films, full free Hallmark Christmas movies, festive family stories, and magical winter tales, A Miracle on Christmas Lake delivers hope, nostalgia, and the true spirit of the season.\n\nStars: Kristian Wang, Anne Hawthorne, Jayson Therrien\n*Licensed from Vision Films. All rights reserved*\n\n*Welcome to Movie Central, SUBSCRIBE NOW!* - https://bit.ly/3mRDJox\r\n\r\nAll of the content on this channel is UNDER LEGAL LICENSE (We have written contracts) from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - rights@vamedianetwork.com\r\nMovie Central is owned and operated by VA Media Ltd. All rights reserved.\r\n\r\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-24T01:34:01.999Z",
      "thumbnail": "https://i9.ytimg.com/vi/lYx6pHtubLI/hqdefault_custom_1.jpg?sqp=CJiErcoG-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDMD7qjAFB0N6PWTXa6SVjwZvMasA",
      "duration": 6653,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T01:34:01.999Z"
}