{
  "imdbId": "youtube-HVjfLYNSdhY",
  "title": "The Legend of 5 Mile Cave 2019 (Western, Action) with Adam Baldwin, Jeremy Sumpter",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=HVjfLYNSdhY",
      "title": "The Legend of 5 Mile Cave 2019 (Western, Action) with Adam Baldwin, Jeremy Sumpter",
      "description": "The Adventure of Two Lifetimes.\nA mysterious drifter bonds with a boy with tales of the West. Past and present collide when a lawman appears seeking long-lost gold.\n\nOriginal title: The Legend of 5 Mile Cave (2019) \n\n\nDirector: Brent Christy\nWriters: Dustin Rikert, William Shockley\nStars: Adam Baldwin, Jeremy Sumpter, Jill Wagner\nGenres: Action, Adventure, Western movie\n\n\n00:00 Full Movie (with subtitles).\n08:22 A captivating book leads to unexpected adventures in the Wild West.\n14:39 Exploring the tale of Shooter Green and his legendary stagecoach robbery in the Wild West.\n20:53 A sharpshooter impresses a crowd with his skills and catches the attention of a mysterious woman.\n26:57 Secret love between Josie and Shooter hindered by societal expectations and financial constraints.\n33:28 Farm faces foreclosure after owner's passing, despite efforts to save it.\n38:57 Shooter contemplates proposing to Josie but needs money for an engagement ring, leading him to stay put instead of moving on.\n44:57 A secret wedding ceremony takes place between Josie and Sam, officiated by a pastor.\n51:27 A heartfelt farewell between Shooter and Josie before Shooter embarks on his final journey.\n56:58 Plans to spread a false story about a shootout to cover up their crime.\n1:03:34 Bud rents a room in a boarding house run by Susan and Mr. Tabor.\n1:11:30 Confrontation between two characters over missing gold and escape from captivity in a western setting.\n1:15:54 A grandfather heroically saves his family from a dangerous foe in a Western action scene.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "HVjfLYNSdhY",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "AM",
          "AT",
          "BA",
          "BY",
          "CY",
          "CZ",
          "DE",
          "EE",
          "GE",
          "HR",
          "LT",
          "LV",
          "MD",
          "ME",
          "MK",
          "PT",
          "RS",
          "SI",
          "SK",
          "UA",
          "US"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:35:20.135Z"
}