{
  "imdbId": "youtube-tEsehhPMO68",
  "title": "The Girl Was Young (1937) by Alfred Hitchcock (Crime, Mystery, Romance, Thriller) Colorized",
  "year": 1937,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=tEsehhPMO68",
      "title": "The Girl Was Young (1937) by Alfred Hitchcock (Crime, Mystery, Romance, Thriller) Colorized",
      "description": "Another Great Mystery Thriller Romance!\nRobert Tisdall finds a corpse of a woman he knew. Others wrongly conclude that he is the murderer. Fleeing, he desperately attempts to prove that he is not the killer. Erica becomes embroiled in the effort.\n\nOriginal title: Young and Innocent (1937)\n👉 go to video settings ⚙️ to choose subtitle language.\n\nBlack & White version: https://youtu.be/eUkE_v8l4K4\n\n\nDirector: Alfred Hitchcock\nWriters: Josephine Tey, Charles Bennett, Edwin Greenwood\nActors: Nova Pilbeam, Derrick De Marney, Percy Marmont\nGenres: Colorized, Crime, Mystery, Romance, Thriller\n \n\n00:00 Full Movie (with subtitles)\n01:26 Interrogation of a suspect in a murder case reveals lies and deception, financial motives, and a missing belt.\n07:40 Mysterious events unfold during a court case as characters navigate through unexpected twists and turns.\n12:10 Investigation of stolen coat and hat leads to unexpected twists and turns.\n19:21 A summary of a crime, mystery, romance, and thriller movie from 1937 directed by Alfred Hitchcock.\n23:38 Investigation into a dangerous suspect unfolds with a twist of innocence and uncertainty.\n30:23 Investigation into a stolen coat leads to unexpected revelations and a mysterious encounter.\n36:51 A mysterious encounter leads to a forgotten birthday party and a game of suspense.\n42:07 A summary of interactions and conversations at a party, involving Erica, Harold, and others.\n46:20 A recap of a mysterious and thrilling scene from a classic Hitchcock film.\n50:29 Investigation into a mysterious disappearance leads to unexpected twists and turns.\n58:55 Investigation into a missing coat leads to a murder mystery with conflicting evidence and suspects.\n1:04:20 Investigation into a murder suspect turns to a man wrongly accused of the crime.\n1:14:36 Mysterious events unfold as characters navigate through a series of encounters and misunderstandings.\n\n\n@CultCinemaClassics \n\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "tEsehhPMO68",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:37:25.539Z"
}