{
  "imdbId": "youtube-z4Py2zedWcg",
  "title": "City of Gold (ABENTEUERFILM | Unzensiert exklusiv für Netzkino-Members)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=z4Py2zedWcg",
      "id": "z4Py2zedWcg",
      "title": "City of Gold (ABENTEUERFILM | Unzensiert exklusiv für Netzkino-Members)",
      "description": "CITY OF GOLD (2018)\nOriginaltitel: The City of Gold\nMit: Vernon Wells, Christopher Atkins, Branscombe Richmond, John Charles Meyer, Riley Dandy, Robbie Allen\nRegie: Harry Locke IV\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nJonathan Davenport sucht Ablenkung von seinen Schuldgefühlen, seit sein Vater Richard, ein Medienmogul, völlig überraschend Suizid begangen hat. Um seinen dunklen Phantasien zu entfliehen, begleitet er seine Ex-Freundin Liz, eine aufstrebende Galeristin, ins peruanische Amazonas-Gebiet, um dort einen vielversprechenden Künstler zu besuchen. Doch was als abenteuerlicher Kunst-Trip geplant war, entpuppt sich schon bald als hochriskante Reise in eine gefährliche Welt. Denn in den Rebellengebieten ist ein Menschenleben nicht viel wert. Doch nicht nur von den Rebellen droht Gefahr, je weiter die Beiden in den Dschungel vordringen, desto stärker spürt Jonathan eine dämonische Kraft in sich, die eine mysteriöse, blutige Verbindung in die Vergangenheit zu haben scheint.\n#Netzkino #ganzerFilm #Abenteuerfilm\n\nCOPYRIGHT:\nSpotfilm Networx GmbH is a serious and legal video on demand company located in Berlin, Germany. We are holding a proper license for all of our published movies. For any questions contact copyright@spotfilm-networx.com",
      "addedAt": "2025-12-24T00:01:13.639Z",
      "thumbnail": "https://i.ytimg.com/vi/z4Py2zedWcg/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLA2O61OpcNTip5YKt1NZxb9jxUx8A",
      "duration": 6146,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T00:01:13.639Z"
}