{
  "imdbId": "youtube-uuRSCdqeb6E",
  "title": "초대받은 사람들 (1981) / The Invited Ones (Chodaebad-eun salamdeul)",
  "year": 1981,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=uuRSCdqeb6E",
      "id": "uuRSCdqeb6E",
      "title": "초대받은 사람들 (1981) / The Invited Ones (Chodaebad-eun salamdeul)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요. \nFor detailed information on this film, visit : \n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/03550\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/03550\n\n감독(Director) : 최하원(Choi Ha-won)\n출연 : 이영하 , 원미경 , 박암 , 남성훈 , 장혁 \n줄거리 :  1784년 천주교가 들어와 이승훈은 정약종,약용 형제와 복음을 펼치나 복음이 당쟁의 도구로 이용되어 박해받는다. 하상과 정은는 신유박해때 고초와 감시를 피해 흩어진 교우들을 모아 교세를 확장한다. 우의정 이지연의 서자 이항주는 위기에 처한 정은를 구출하고 첫눈에 끌린다. 항주와 정은는 부친들 사이에 정혼이 약속되었지만 한사람은 진리를 위해 처형되고 다른 사람은 재상이 되어 가까이할 수 없다. 정은는 진리와 성교를 위해 항주의 사랑을 피하나 항주는 필사적으로 사랑을 쫓는다. 천주교 박해로 수많은 성직자가 형장의 이슬로 사라질때 항주는 성령을 받는다.\n\nCasts: Lee Young-ha , Won Mi-kyung , Park Am , Nam Sung-Hoon , Chang Hyeok \nSYNOPSIS : Catholicism entered Korea in 1784. Lee Seung-hun spreads the words with the brothers of Jung Yak-jong and Jung Yak-yong. The religion is used as an impetus for dispute between political parties so it becomes persecuted. During the Sin-yu Persecution, Ha-sang and Jung-eun avoid torture and surveillance and gather the parishioners, expanding the church's power. Lee Hang-ju, the illegitimate child of Lee Ji-yeon a high ranking official, rescues Jung-eun from danger and is drawn to her at first glance. Hang-ju and Jung-eun's fathers give their blessing to their marriage but one is executed for truth and the other becomes a high ranking official whom no one can approach. Jung-eun avoids Hang-ju's love for the truth and the teachings of the church. Hang-ju desperately chases after his love. When many parishioners disappear like dew on the gallows during the Roman Catholic persecution, Hang-ju receives the Holy Spirit.",
      "addedAt": "2025-12-26T00:21:57.469Z",
      "thumbnail": "https://i.ytimg.com/vi/uuRSCdqeb6E/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBAfbls7GfkBFBi1vtoPUi-Ma2JYw",
      "duration": 7005,
      "language": "ko",
      "year": 1981,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:21:57.505Z"
}