{
  "imdbId": "youtube-29M-P2EF3jw",
  "title": "Callaghan is back (1961, Crime) Antony Wright, Geneviève Kervine | French Film",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=29M-P2EF3jw",
      "title": "Callaghan is back (1961, Crime) Antony Wright, Geneviève Kervine | French Film",
      "description": "The wrestling racket is exploited by a couple of adventurers, the Baron - Ray Rollando - and Ruby la Dorure. During a match rigged by the two accomplices, in which \"the White-Toothed Mask\", \"the Justice of the Beyond\" and \"the Arizona Bearded Man\", terror of the Prairie, clash, Slim Callaghan confuses them by substituting himself for the White-Toothed Mask. Duped, the Baron and his gang swear revenge. Slim Callaghan then sets his sights on a new, even more high-profile case, the notorious theft of the High Sangha diamonds. With the help of his pretty blonde secretary Carola, Callaghan boards a luxury yacht in the Mediterranean. From there, he enters a sumptuous villa where a transvestite party is taking place. Carola, disguised as a fakir, and himself a Salvation Army auxiliary, steal the precious diamonds in an illusionist's trick. A frenzied chase, full of incredible twists and turns, unmasks the perpetrators of this colossal swindle. This eventful investigation is a success for Callaghan, both professionally, as he arrests a fearsome bandit, and personally, as his secretary becomes his charming wife.\n\nColorized version: https://youtu.be/cd5Gs0X-nXw\n\nOriginal title: Callaghan remet ça (1961)\nAlternative title: Callaghan is back \n\nDirector: Willy Rozier\nWriters: Peter Cheyney, Willy Rozier\nActors: Antony Wright, Geneviève Kervine, André Luguet, Fabienne Dali\nGenres: French cinema, Crime, Drama",
      "id": "29M-P2EF3jw",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:30:55.161Z"
}