{
  "imdbId": "youtube-8ArzTT7jsLs",
  "title": "Fast on the Draw 1950 | Western | Shamrock Ellison, Lucky Hayden | Colorized Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=8ArzTT7jsLs",
      "title": "Fast on the Draw 1950 | Western | Shamrock Ellison, Lucky Hayden | Colorized Movie",
      "description": "SUDDEN DEATH AT THEIR HIPS!\nAs a boy, Shamrock’s parents were killed. He took possession of a pistol belonging to his father, a famous marshal. Now that he is grown, he takes the job of marshal and uses the same gun, but he still has to solve the mystery of what happened to his parents.\n\nOriginal title: Fast on the Draw (1950) AKA: Sudden Death\n\nBlack & White version: https://youtu.be/gztbC56kUFM\n\nDirector: Thomas Carr\nWriters: Ron Ormond, Maurice Tombragel, Richard Martinsen\nCast: James Ellison, Russell Hayden, Raymond Hatton, Fuzzy Knight, Julie Adams, Tom Tyler\nGenre: Colorized classics, Western\n\n\n00:00 Wild West showdown with Shamrock Ellison and Lucky Hayden in a colorized western movie.\n14:55 Escape and encounter with the family and Native Americans lead to unexpected events and a potential new role.\n26:37 Wild West lawman Shamrock Ellison is appointed as the new deputy of Lawless, receiving congratulations and a badge from the townspeople.\n32:19 A new deputy arrives in a small town, causing tension and suspicion among the locals.\n34:45 Western showdown unfolds as characters discuss facing Cat, a notorious figure. Tex reveals a plan involving the deputy and the police chief. Tension rises as the group plans their next move.\n38:48 Gunfight and confrontation between characters in a Western setting.\n46:06 Wild West showdown and unexpected revelation\n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.tiktok.com/@cultcinemaclassics\nhttps://www.instagram.com/cultcinemaclassics",
      "id": "8ArzTT7jsLs",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:41:02.597Z"
}