{
  "imdbId": "youtube-A95sb1wh8Vs",
  "title": "Prinz Rama – Im Reich der Mythen – Jetzt den ganzen Film kostenlos schauen in HD bei Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=A95sb1wh8Vs",
      "id": "A95sb1wh8Vs",
      "title": "Prinz Rama – Im Reich der Mythen – Jetzt den ganzen Film kostenlos schauen in HD bei Moviedome",
      "description": "Jetzt den Animations-Film \" Prinz Rama – Im Reich der Mythen und Legenden „ in ganzer Länge bei #Moviedome sehen. Mehr #ganzeFilme entdecken: Abonnieren ► http://bit.ly/MoviedomeAbo \n\n\n\nPrinz Rama lebt in dem Königreich Kosala zusammen mit seinen drei Brüdern. Als er alt genug ist, zieht er aus, um Dämonen zu töten. Auf seiner Reise kommt er an den Hof von Videha, wo der König Janaka seine Tochter Sita nur dem zur Frau geben will, der es schafft, den Bogen der Familie zu spannen. Rama stellt sich der Aufgabe, spannt den Bogen mühelos und erhält Sita zur Ehefrau. Als Rama jedoch Kronprinz werden soll, schreitet seine Stiefmutter ein, um ihren eigenen Sohn auf den Thron zu heben. Rama und seine Frau Sita müssen in die Verbannung... \nDas \"Ramayana\" ist eines der indischen Nationalepen, das aus insgesamt sieben Büchern mit rund 24.000 Versen besteht. Diese wunderschöne Geschichte daraus wird hier in einem liebevoll gestalteten Film erzählt und ist für jeden Fan der indischen Filmkunst und Kultur, aber auch für jeden Freund qualitativ hochwertiger Animationsfilme, damit ein absolutes Muss!\n\n\nJetzt “ Prinz Rama – Im Reich der Mythen und Legenden ” kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere #Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo ►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzer Film #kostenlos #movie #film #spielfilm #HD #Krimi #Crime #action #thriller #Science Fiction #Abenteuer #Animation\n \n\nFilmlänge: 102 Minuten \nDVD-Start (DE): 2012\n\nDie Darsteller\nAshutosh Rana in der Rolle des Ravana\nJuhi Chawla in der Rolle der Sita\nManoj Bajpai in der Rolle des Rama\nMukesh Rishi in der Rolle des Hanuman\n\n\nJetzt ganze Filme bei #Moviedome anschauen \n\nFinde Movies in ganzer Länger diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \nDen Animations-Film „ Prinz Rama – Im Reich der Mythen und Legenden ” in voller Länge auf deutsch ansehen.",
      "addedAt": "2025-12-26T00:35:30.276Z",
      "thumbnail": "https://i.ytimg.com/vi/A95sb1wh8Vs/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBmemobzibAXQK_oIsrA0XZOEr5MQ",
      "duration": 6092,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:35:30.349Z"
}