{
  "imdbId": "youtube-OVPVXuYgM9Y",
  "title": "KOFA코멘터리극장: 춘몽(1965) / KOFA Cinema with Commentary: The Empty Dream  (1965)",
  "year": 1965,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=OVPVXuYgM9Y",
      "id": "OVPVXuYgM9Y",
      "title": "KOFA코멘터리극장: 춘몽(1965) / KOFA Cinema with Commentary: The Empty Dream  (1965)",
      "description": "일곱 번째로 공개되는 ‘KOFA 코멘터리극장’은 유현목 감독 탄생 100주년을 기념하여 1965년작 “춘몽”을 선정했습니다. “춘몽”은 한국 상업영화의 지형에서 드물게 탄생한 실험적 예술영화로, 영화사적 의미가 매우 큽니다. \n영화비평가 정성일은 “춘몽”을 단지 독일 표현주의나 초현실주의적 형식의 실험으로만 보지 말고, 러시아 변증법적 몽타주를 통해 제시되는 암호를 새롭게 읽어야 한다고 제안합니다. 그는 몽타주 공식인 A + B = C에서, 유현목 감독이 +B 속에 감추어 둔 의미에 주목하며, 현실의 부조리함을 폭로한 “오발탄”과 “춘몽”이 긴밀히 맞닿아 있음을 지적합니다. \n한국영화를 사랑하는 여러분이 이번 코멘터리를 통해 한국 고전영화를 새롭게 발견하고 흥미롭게 감상하길 바랍니다. 더불어 여러분의 새로운 해석과 의견이 한국영화 담론을 한층 풍부하게 만들어주리라 믿어 의심치 않습니다.\n\nThe seventh edition of KOFA Cinema with Commentary celebrates the 100th anniversary of director Yu Hyun-mok’s birth with a special presentation of his 1965 masterpiece “The Empty Dream” (Chunmong), a rare experimental art film within the landscape of Korean commercial cinema that holds a distinguished place in Korean film history for its bold artistic vision and modernist sensibility.\nFilm critic Chung Sung-il proposes that “The Empty Dream” should not be regarded merely as an experiment in German Expressionism or Surrealist form, but rather re-examined through the codes embedded in Russian dialectical montage. He draws attention to what Yu Hyun-mok conceals within the +B element of the montage formula A+B=C, suggesting a profound connection between “The Aimless Bullet” (“Obaltan”) and “The Empty Dream” in their shared exposure of the absurdity of reality.\nThrough this commentary, KOFA invites audiences to rediscover the beauty and depth of Korean classic cinema. We hope viewers will find fresh inspiration in Yu Hyun-mok’s work, and that their diverse interpretations and insights will continue to enrich the ongoing discourse on Korean film culture.\n\n영화 “춘몽“ 본편 감상 (streaming the film, The Empty Dream)\nhttps://www.youtube.com/watch?v=rh3pwN7z6oM&t=690s\n\n기획 및 제작 진행: 정종화(Chung Chong-hwa), 윤서연(Yoon Seo-yeon)\n제작: 블루키노(Blue Kino)\n영문 자막 번역: 더블디 번역",
      "addedAt": "2025-12-26T00:21:13.057Z",
      "thumbnail": "https://i.ytimg.com/vi/OVPVXuYgM9Y/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAIblgltsGjRAbihvgzwEFGqni0SQ",
      "duration": 4283,
      "language": "ko",
      "year": 1965,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:21:13.106Z"
}