{
  "movieId": "youtube-RgKe0yo-NjI",
  "title": "Fraternity Scandals Exposed! For Men Only (1952) Crime, Drama | Full Colorized Movie",
  "year": 1952,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=RgKe0yo-NjI",
      "id": "RgKe0yo-NjI",
      "title": "Fraternity Scandals Exposed! For Men Only (1952) Crime, Drama | Full Colorized Movie",
      "description": "Professor Stephen Brice becomes suspicious of a student's accidental death, suspecting it was connected to his refusal to participate in a dangerous hazing ritual. As he investigates against the university's wishes, he unravels a web of deceit and endangerment.\n\nOriginal title: For Men Only (1952)  AKA: The Tall Lie / Hell Night\n\nOriginal Black & White version: https://youtu.be/VZjEq9cFyCw\n\n\nDirector: Paul Henreid\nWriters: Herb Margolis, Lou Morheim\nStars: Paul Henreid, Margaret Field, James Dobson\nGenres: Colorized classics. Crime, Drama\n\n00:00 Full Movie & introduction\n01:40  A group of individuals are going through an initiation process for a fraternity.\n11:37  Tod is going through a tough initiation process for a fraternity and his girlfriend is worried about him.\n17:36  A group of fraternity pledges go through a series of psychological and physical tasks as part of their initiation.\n28:38  A fraternity initiation goes wrong when a dog is killed, leading to a investigation and conflicting stories.\n34:52  A conversation takes place between various characters regarding a dog incident and its potential consequences.\n48:34  A student at Wake University is hospitalized after suffering humiliation during a fraternity initiation.\n49:51  A college scandal involving fraternity hazing sparks a debate among faculty members.\n55:14  Dr. Brice's colleagues express their fear of supporting a meeting publicly, while his wife tries to convince him to cancel the meeting to secure a dean's appointment.\n1:07:59  Dr. Brice is falsely accused of misconduct and is ultimately fired from his teaching position at Wake College.\n1:16:18  A person reflects on leaving a school and the controversy surrounding a girl named Tracy Norman.\n1:21:37  Dr. Brice tries to find Mr. Brown and discovers that Beanie Brown lied about contacting the Board of Regents.\n1:28:34  A football player's hand injury leads to a confrontation with his professor and the revelation of a cover-up.\n\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:39:48.960Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/RgKe0yo-NjI/maxresdefault.webp?v=658e9fca",
      "duration": 5694,
      "language": "en",
      "year": 1952,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:39:49.035Z"
}