{
  "movieId": "youtube-kzFEAJLVH5o",
  "title": "Die Prinzessin und das Pony - Jetzt den ganzen Film kostenlos schauen in HD bei Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=kzFEAJLVH5o",
      "id": "kzFEAJLVH5o",
      "title": "Die Prinzessin und das Pony - Jetzt den ganzen Film kostenlos schauen in HD bei Moviedome",
      "description": "Jetzt den Familienfilm \" Die Prinzessin und das Pony “ in ganzer Länge bei #Moviedome sehen.\n\nEvelyn ist die wohlbehütete Prinzessin eines kleinen Landes inmitten von Europa. Eines Tages bedrohen innenpolitische Machenschaften die Sicherheit der Region und so muss die kleine Prinzessin ihre Heimat verlassen. Um ihre Identität zu schützen, soll sie vorübergehend bei entfernten Verwandten in Amerika leben. Dort hat es das schüchterne und unerfahrene Mädchen schwer, Anschluss zu finden, doch das ändert sich, als sie in einem bezaubernden Pony einen neuen, treuen Freund findet. Das Pony ist genauso einsam wie Evelyn und die beiden werden unzertrennliche Freunde. Das Tier befindet sich jedoch im Besitzt eines zwielichtigen und gemeinen Zirkusdirektors. Als dieser erkennt, dass die kleine Evelyn eine echte Prinzessin ist, schmiedet er finstere Pläne. Und nicht nur das Mädchen gerät in Gefahr, auch das kleine Pony muss um sein Leben bangen. Wird es der kleinen Prinzessin gelingen, das Pony und damit ihre ungewöhnliche Freundschaft zu retten?\n\nMehr #ganzeFilme entdecken: Abonnieren ► http://bit.ly/MoviedomeAbo\nJetzt “ Die Prinzessin und das Pony ” kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere #Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo ►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n\n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzer Film #kostenlos #movie #film #spielfilm #HD #Krimi #Crime #action #thriller #Abenteuer #Action #Krieg #Drama #Familienfilm\n \nFilmlänge: 84 Minuten \nRegie: Rachel Goldenberg\nFSK: 6\nDVD-Start (DE): 2012\n\nDie Darsteller\nFiona Perry in der Rolle der Prinzessin Evelyn Cottington\nBill Oberst Jr. in der Rolle des Theodore Snyder\nBobbi Jo Lathan in der Rolle der Aunt Fay\nRon Hajak  in der Rolle des Lawrence\n\nJetzt ganze Filme bei #Moviedome anschauen \n\nFinde Movies in ganzer Länger diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. \n\nJetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \n\nDen Familienfilm \" Die Prinzessin und das Pony “ in voller Länge auf deutsch ansehen.",
      "addedAt": "2025-12-26T00:35:10.616Z",
      "thumbnail": "https://i.ytimg.com/vi/kzFEAJLVH5o/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDPD2576ZrURDVx9FliPhQfL2OnEA",
      "duration": 5268,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:35:10.680Z"
}