{
  "imdbId": "youtube-lfN5JbhBxRs",
  "title": "Der Geisterturm - Behind the Wall - Horror - Jetzt den ganzen Film kostenlos schauen bei Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=lfN5JbhBxRs",
      "title": "Der Geisterturm - Behind the Wall - Horror - Jetzt den ganzen Film kostenlos schauen bei Moviedome",
      "description": "Jetzt den Horror-Film \" Der Geisterturm - Behind the Wall “ in ganzer Länge bei #Moviedome sehen.\n\nKatelyn kehrt nach über 20 Jahren in ihren Heimatort Henderson Bay zurück. Hier lebte sie mit ihren Eltern in einem Leuchtturm, bis ihre Mutter auf mysteriöse Weise ermordet wurde. Ihr Vater wurde damals für die Tat verurteilt. Nun soll ein neues Bauprojekt den Leuchtturm zur Touristenattraktion machen. Das jedoch versucht ein Geistlicher verzweifelt zu verhindern, denn manche Geister aus der Vergangenheit sollte man ruhen lassen…\n\nMehr #ganzeFilme entdecken: Abonnieren ► http://bit.ly/MoviedomeAbo\n\nJetzt den #Horror Film \" Der Geisterturm - Behind the Wall “ kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere #Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo \n►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzerFilm #kostenlos #movie #film #spielfilm #HD #Krimi #Crime #action #thriller #Abenteuer #Action #Krieg #Drama #Geisterfilm #Gruslig #Spukfilm\n\nEnglischer Originaltitel: Behind the Wall\nFilmlänge: 94 Minuten \nRegie: Paul Schneider\nFSK: 16\nDVD-Start (DE): 2009\n\n\nDie Darsteller\nLindy Booth (bekannt aus „Dawn oft he Dead“, „Wrong Turn“, „Cry Wolf“) in der Rolle der Katelyn Parks\nLawrence Dane (bekannt aus „Chucky und seine Braut“, „Scanners – Ihre Gedanken können töten“ ) in der Rolle des Vater Hendry\nJames Thomas (bekannt aus „House at the End of the Street“,  “Girlhouse”) in der Rolle des Drew Cabot\nSuzie Pollard (bekannt aus „Dark Blue“, „CSI: New York“) in der Rolle der Monica\n\nJetzt ganze Filme bei #Moviedome anschauen\n\nFinde Movies in ganzer Länge diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \n\nJetzt den Thriller \" Der Geisterturm - Behind the Wall “ in voller Länge auf deutsch ansehen.",
      "id": "lfN5JbhBxRs",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:34:50.682Z"
}