{
  "imdbId": "youtube-dSBchGJzCJY",
  "title": "Bela Lugosi | The Corpse Vanishes (1942) Colorized | Horror, Sci-Fi | Full Movie",
  "year": 1942,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=dSBchGJzCJY",
      "id": "dSBchGJzCJY",
      "title": "Bela Lugosi | The Corpse Vanishes (1942) Colorized | Horror, Sci-Fi | Full Movie",
      "description": "Keeper of the Grotto of Torture!\nDr. Lorenz, a sinister scientist abducts young, virginal brides to extract their bodily fluids to rejuvenate his aging wife. A plucky young reporter investigates the mysterious disappearances, leading to a chilling confrontation with Dr. Lorenz and his gruesome secrets.\n\nOriginal title: The Corpse Vanishes (1942) AKA The Case of the Missing Brides\n\n\nBlack and white version: https://youtu.be/_Pr7zysHS-o\n\nDirector: Wallace Fox\nWriters: Sam Robins, Gerald Schnitzer, Harvey Gates\nStars: Bela Lugosi, Luana Walters, Tristram Coffin \nGenres: Colorized classics, Cult Film, Horror, Sci-Fi \n\n00:00 Full length movie.\n01:30 A wedding ceremony takes a shocking turn when the bride suddenly dies and her body is kidnapped.\n08:54 A series of mysterious deaths and disappearances of brides wearing a specific orchid leads to an investigation.\n23:05 A reporter named Patricia Hunter is trying to interview Professor Lorenz, who is working on finding a cure for his wife.\n23:31 A newspaper woman visits Professor Lorenz and his wife, who are described as eccentric and peculiar, and asks for an interview about orchids.\n34:10 A woman has a terrifying experience at a mysterious house.\n44:49 A journalist and a doctor discuss the case of the vanishing brides, with the journalist claiming to have found orchids like the one that disappeared from her bag and the doctor suggesting she may have been hypnotized.\n49:04 Doctor Foster believes that Doctor Lorenz is using dead or alive young girls as human guinea pigs to sustain his wife in a youthful state.\n51:39 A newspaper plans to stage a phony wedding to track down the person stealing dead brides' bodies.\n55:37 A chaotic wedding ceremony takes place, but it turns out to be a ruse to catch a criminal.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=PL2gsu7VGzgdYT_Zk0DHuuOUVtCef1TewS\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:40:48.852Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/dSBchGJzCJY/maxresdefault.webp?v=653774fd",
      "duration": 3779,
      "language": "en",
      "year": 1942,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:40:48.942Z"
}