{
  "imdbId": "youtube-KOCijcVcV2Y",
  "title": "Piccoli equivoci / Little Misunderstandings (Comedy, 1989) by Ricky Tognazzi | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=KOCijcVcV2Y",
      "title": "Piccoli equivoci / Little Misunderstandings (Comedy, 1989) by Ricky Tognazzi | Movie",
      "description": "Paolo is an actor still in love with Francesca, his former partner, and wanders around the apartment where they are loved and separated. He is determined to stay there.\n\nOriginal title: Piccoli equivoci (1989) AKA: Little Misunderstandings\n\nThis film has Italian audio, with subtitles in many languages,\n\nDirector: Ricky Tognazzi\nWriters: Claudio Bigagli, Simona Izzo, Ruggero Maccari\nStars: Sergio Castellitto, Lina Sastri, Nancy Brilli\nGenres: Italian cinema, Comedy, Romance\n\n\n00:00 Full Italian Movie (with subtitles)\n03:59 A comedic conversation unfolds between two individuals discussing relationships, misunderstandings, and living arrangements.\n09:13 Series of misunderstandings and miscommunications among friends leading to confusion and frustration.\n16:22 A series of comedic misunderstandings unfold during phone conversations and interactions between characters.\n23:25 Hilarious misunderstandings unfold as characters navigate relationships and culinary adventures.\n28:23 A comedic scene unfolds as characters interact during a meal, discussing various topics and misunderstandings.\n33:49 A comedic scene unfolds backstage involving misunderstandings, relationships, and personal reflections.\n40:15 A comedic scene unfolds with misunderstandings and humorous interactions among characters.\n51:12 Hilarious misunderstandings and conversations unfold in a comedic movie scene.\n58:03 Relationship misunderstandings and conversations between friends about love, beauty, and living arrangements.\n1:03:43 Misunderstandings and confessions unfold between friends in a comedic movie scene.\n1:11:50 Confusion ensues as characters navigate misunderstandings and romantic entanglements in a comedic movie scene.\n\n@CultCinemaClassics\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "KOCijcVcV2Y",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "ES",
          "IT"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:38:23.291Z"
}