{
  "movieId": "youtube-lWdvpv-BF90",
  "title": "Reg Park | Hercules and the Captive Women (1961, Adventure film) directed by Vittorio Cottafavi",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=lWdvpv-BF90",
      "id": "lWdvpv-BF90",
      "title": "Reg Park | Hercules and the Captive Women (1961, Adventure film) directed by Vittorio Cottafavi",
      "description": "The Might! The Muscle! The Splendour! Heroic Hercules battles the seductive powers of the wicked Queen of Atlantis who is plotting to take over the world with superhuman warriors.\nIn search of a predicted threat to Greece, King Androcles commands a ship with Hercules on board. After Hercules falls overboard in a fog, he saves Ismene from the evil Proteus and is taken to Atlantis. There, he discovers Queen Antinea has captured Androcles. Hercules plans to rescue him and stop Antinea's world conquest dream.\n\nOriginal title: Ercole alla conquista di Atlantide (1961)\nAlternative titles: Hercules Conquers Atlantis, La conquista de la Atlántida, Hercule à la conquête de l'Atlantide, Hércules a la conquista de la Atlántida, Herkules erobert Atlantis, Hércules na Conquista de Atlântida, Геркулес покоряет Атлантиду, Hércules y la conquista de la Atlantida\n\n\nDirector: Vittorio Cottafavi\nWriters: Vittorio Cottafavi, Sandro Continenza, Duccio Tessari\nMain Cast: \nReg Park as Ercole (Hercules) \nFay Spain as La regina Antinea (Queen Antinea)  \nEttore Manni as Androclo\nLaura Efrikian as Ismene \nGenres: Adventure, Comedy, Fantasy, History\n\n\n00:00 - Full Movie (with subtitles)\n01:33 - Legendary Greek kings unite against a mysterious threat from afar.\n08:56 - Hercules sets sail on an enigmatic journey, joined by unexpected allies, filled with intrigue.\n17:01 - An adventure to a perilous land brings Hercules face-to-face with a monstrous serpent and the fabled Atlantis.\n32:48 - Hercules intervenes to save a mother and daughter from a tragic sacrificial ceremony in Atlantis.\n39:56 - A fierce confrontation erupts as Hercules defies the powerful forces of Atlantis.\n48:00 - Betrayal and imprisonment challenge Hercules as he fights for freedom in Atlantis.\n1:02:06 - Ancient gods, mystical rocks, and a queen's dark ambitions unfold in a tale of power.\n1:08:00 - Hercules battles Antinea for control and liberation in the heart of Atlantis.\n1:26:13 - A daring rescue mission culminates in a dramatic showdown against sacrificial captors on a ship.\n\n\nNext Hercules movie: \nHercules in the Haunted World (1961) https://youtu.be/DvYA00MxSXs\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:34:45.592Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/lWdvpv-BF90/maxresdefault.webp?v=66fb518b",
      "duration": 5713,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:34:45.728Z"
}