{
  "movieId": "youtube-2wKp1uo2D0I",
  "title": "Final Days of an Icon: James Dean (Biography, Documentary)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2wKp1uo2D0I",
      "id": "2wKp1uo2D0I",
      "title": "Final Days of an Icon: James Dean (Biography, Documentary)",
      "description": "The documentary chronicles the life and legacy of James Dean, a pioneering figure in Hollywood known for his dramatic life and career.  It explores his rise as a legendary icon and the impact of his untimely death, capturing the enduring fascination with his persona. The film delves into his final days, including his passion for racing, his iconic Porsche, and his fatal car accident on September 30, 1955.  The film also focuses on the enduring global legacy and commercialization of Dean's image over the past 50 years.\n\n\nThis video is available with English, German, Indonesian, Portuguese & Spanish dubbed audio options.  Go to settings ⚙️ to select your languages.\n\n\n00:00 Full Documentary (with audio & subtitles)\n00:43 The lasting legacy of James Dean, a Hollywood pioneer known for his dramatic life and career.\n06:13 The rise of James Dean as a legendary icon and the impact of his untimely death.\n12:33 The last days of James Dean, a Hollywood Rebel, remembered through stories and celebrations in Fairmount, Indiana.\n18:37 The final days of James Dean, a legendary racer and actor, and his iconic Porsche.\n24:08 The tragic final days of the iconic actor James Dean captured through photos and memories.\n30:20 Tragic details of James Dean's fatal car accident in 1955 and its aftermath.\n36:03 Tragic death of a Hollywood star leads to mourning, speculation, and scrutiny of his life.\n42:08 The enduring legacy and commercialization of James Dean's image and persona.\n47:37 Legacy and enduring popularity of James Dean, attracting fans globally for over 50 years.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:37:11.464Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/2wKp1uo2D0I/maxresdefault.webp?v=66d7fc53",
      "duration": 3110,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:37:11.547Z"
}