{
  "imdbId": "youtube-lXy4f7-i7vU",
  "title": "Horror Movie | Ring Of Terror 1961 | by Clark Paylow | Colorized | with subtitles",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=lXy4f7-i7vU",
      "title": "Horror Movie | Ring Of Terror 1961 | by Clark Paylow | Colorized | with subtitles",
      "description": "Some fears never die - 'Ring of Terror' will haunt your dreams.\nA medical student named Lewis Moffitt is tasked with stealing a ring from a deceased homeless man as part of a fraternity initiation. His fear of the dead leads him on a terrifying journey filled with supernatural experiences, ultimately revealing a shocking connection between the ring and his own life.\n\nBlack & White original version: https://youtu.be/5_rlkRK1Uck\n\n\nOriginal title: Ring of Terror (1961)\nThis film has subtitles in many languages.\n\nDirector: Clark L. Paylow\nWriter: Lewis Simeon\nStars: George E. Mather, Austin Green, Esther Furst \nGenres: Colorized, Drama, Horror, Psychotronic film, B-Movie\n\n\n00:00 Full Movie (with subtitles)\n02:52 Exploration of inner turmoil and love through mysterious encounters and emotional revelations.\n09:30 Exploration of relationships and fears among a group of individuals in a cafe setting.\n17:39 Medical students prepare for an upcoming autopsy, discussing their experiences and challenges.\n26:10 Exploration of a cadaver in a medical class, showcasing internal organs and muscles.\n30:35 A medical dissection, followed by unsettling encounters and upcoming initiation ceremony.\n39:29 A chilling childhood nightmare resurfaces during a power outage, leading to a dark confession.\n40:54 Exploring the eerie events surrounding three individuals, their unique ideas, and a mysterious disappearance.\n46:00 Participants vote for beauty queen, celebrate with party, and face challenges in a competition.\n52:32 Exploring fear and mystery in a chilling encounter with a cryptic message.\n\n\n@CultCinemaClassics \n\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "lXy4f7-i7vU",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "ES"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:37:41.206Z"
}