{
  "imdbId": "youtube-sb2E_IwKwPI",
  "title": "The Dungeon of Harrow 1962 (Adventure, Horror) Russ Harvey, Helen Hogan | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=sb2E_IwKwPI",
      "title": "The Dungeon of Harrow 1962 (Adventure, Horror) Russ Harvey, Helen Hogan | Full Movie",
      "description": "An evil, sadistic count lives in a waterfront castle with his insane family members. One day the survivor of a shipwreck washes ashore near the castle and finds himself a captive there.\n\nOriginal title: The Dungeon of Harrow (1962)\n\nThis movie is available with subtitles in many languages.\n\nDirector: Pat Boyette\nWriters: Pat Boyette, Henry Garcia\nStars: Russ Harvey, Helen Hogan, William McNulty \nGenre: Action, Adventure, Drama, Horror, Cult classic\n\n\n00:00 Full Movie\n00:39 A man reflects on his family's legacy as he faces decay and horror on an island after a shipwreck.\n10:23 A mysterious and eerie encounter on an island leads to a series of terrifying events.\n23:15 A man and his friend seek refuge in the castle of Count Lorente de Sade, where they encounter strange and unsettling behavior.\n33:14 A man experiences strange and eerie events in a castle, suspecting foul play and feeling trapped.\n41:59 A tragic tale of love, illness, and abuse unfolds in a castle.\n48:31 A man is trapped in a castle, trying to find out the fate of his captain while dealing with the cruel Count de Sade.\n55:38 A dramatic story of betrayal, imprisonment, and a plan for escape unfolds in a castle.\n1:04:47 A thrilling escape from the Castle de Sade with unexpected twists and turns.\n1:17:19 A thrilling and tragic tale of survival and despair in the Castle of de Sade.\n\n@CultCinemaClassics",
      "id": "sb2E_IwKwPI",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:39:28.170Z"
}