{
  "imdbId": "youtube-ogv1VkBxUNI",
  "title": "돌아온 사나이(1960) / A Returned Man (Dol-a-on sana-i) (1960)",
  "year": 1960,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ogv1VkBxUNI",
      "title": "돌아온 사나이(1960) / A Returned Man (Dol-a-on sana-i) (1960)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00605\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00605\n\n감독(Director) : 김수용(Kim Soo-yong)\n\n출연 : 최은희 , 김진규 , 이민 , 엄앵란 , 허장강\n\n줄거리 :  박남호(김진규)는 일본인 제약회사에 다니며, 아내 경희(최은희)와 아름다운 백장미 정원이 있는 집에서 행복하게 살고 있었다. 경희가 아이를 임신했다는 행복한 소식을 듣고 나서 얼마 안돼 남호는 영장을 받고 태평양전쟁으로 징용된다. 관동군에 배치된 그는 전투로 얼굴에 화상을 입고 가까스로 살아나지만 얼굴 때문에 자학한다. 한편 전사통지서를 받은 경희는 아들 철수(남양일)를 낳고 서울로 간다. 남호는 휴전선을 넘어 남으로 내려오지만 경희를 찾아가지 않고 시골에 남는다. 그는 휴전선을 넘다가 엄마가 죽은 아이를 딸로 삼아 그녀의 양육에 힘을 기울인다. 양녀 평숙(엄앵란)이 서울에 있는 대학에 장학생으로 입학하자 남호는 친구(허장강)의 소개로 서울에 있는 제약회사에 입사한다. 평숙은 우연히 철수를 만나 서로 좋아하게 된다. 그러던 중 제약회사 오사장(이민)이 특허제출 기념파티를 열고 남호를 초대한다. 오사장의 부인이 된 경희와 남호는 파티에서 마주치고, 경희는 남호에게 철수가 그의 아들이라고 말해준다. 남호는 4ㆍ19 혁명에 참여했다 부상당한 철수를 구해서 철수를 병원에 입원시키고 이를 가족들에게 알린다. 남호는 자신은 살아있는 송장에 다름 아니며 자신만 사라지면 모두가 행복해질 수 있을 것이라는 편지를 남기고 쓸쓸히 사라진다.\n\nCasts : Choi Eun-hee , Kim Jin-kyu , Lee Min , Um Aing-ran , Heo Chang-kang \n\nSYNOPSIS : Park Nam-u (Kim Jin-gyu) works at a Japanese pharmaceutical company and lives happily with his wife, Gyeong-hui (Choe Eun-hui), in a house filled with beautiful white roses. Not long after hearing the wonderful news that his wife is pregnant, Park Nam-u is drafted into the war in the Pacific. Posted in the Gwandong army, he survives the battle, though his face is burned. Back home, Gyeong-hui receives a telegram stating that her husband is dead. When she gives birth to their son, Cheol-su (Nam Yang-il), she goes to live in Seoul. When Nam-u comes back to the country, he doesn't go to his wife, but rather goes to live in his hometown. On his way home, he encounters a child whose mother is dead, and takes her in as his own daughter. As his daughter, Park Pyeong-suk (Eom Aeng-ran), enters university in Seoul on a scholarship, Nam-u joins a pharmaceutical company thanks to his friend (Heo Jang-gang). Pyeong-suk and Cheol-su meet by chance and begin to have feelings for each other. When the president of the pharmaceutical company (Lee Min) holds a party commemorating a pending patent and invites Nam-u, Gyeong-hui, who is now the wife of the president, runs into Nam-u at the party, and she tells him that Cheol-su is his son. When Nam-u participates in the April 19 Revolution, he finds Cheol-su injured and brings him to the hospital and tells his family. Nam-u leaves, saying that everyone would be happier if he were to disappear. With that, he gloomily walks away.",
      "id": "ogv1VkBxUNI",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:22:10.625Z"
}