{
  "movieId": "youtube-yRCQoHwbNWY",
  "title": "Devil's Doll / The Devil's Hand (1961) by William J. Hole Jr. | Horror Movie | Colorized",
  "year": 1961,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=yRCQoHwbNWY",
      "id": "yRCQoHwbNWY",
      "title": "Devil's Doll / The Devil's Hand (1961) by William J. Hole Jr. | Horror Movie | Colorized",
      "description": "Diabolical Dance with The Devil's Hand. \nRick is plagued by visions of a beautiful woman. His distress deepens when he discovers a doll bearing a striking resemblance to his fiancée. When he finally meets the woman of his visions, she lures him into a cult devoted to the worship of the malevolent Gamba. Is this the beginning of the end?\n\nOriginal title: The Devil's Hand (1961) AKA: Devil's Doll / Witchcraft\nThis film is subtitled in many languages.\n\nBlack & White version: https://youtu.be/Vy_wU6xh-2k\n\n\nDirector: William J. Hole Jr.\nWriter: Jo Heims \nStars: Linda Christian, Robert Alda, Ariadne Welter \nGenres: Colorized classics, Cult Film, Horror\n\n\n00:00 Full Movie (with subtitles)\n01:44 A mysterious encounter leads to confusion and suspicion during a meeting with a doll maker.\n06:32 Mysterious events unfold as a man receives a doll unexpectedly, leading to confusion and suspense.\n11:33 A mysterious encounter leads to a quest for truth involving a doll and a painting.\n15:36 A mysterious encounter leads to a discussion about dreams and mind control during a dinner party.\n20:51 Mysterious cult worships demon Gamba, seeking control over destiny through rituals and sacrifices.\n30:03 A mysterious ritual involving a sacrifice to a deity named Gamba unfolds with intense suspense and secrecy.\n38:46 Mysterious conversation between Rick and Bianca reveals hidden truths and fears.\n41:39 A mysterious and suspenseful plot unfolds involving a woman, a man, and a doll, leading to a potential threat and a decision to be made.\n48:00 Mysterious events unfold as a group is threatened by a betrayal, leading to a deadly confrontation.\n58:44 A young girl becomes a sacrificial victim in a ritual to prove loyalty and dispel doubts.\n1:06:34 A tale of betrayal, loyalty, and danger unfolds as characters navigate through a dark and suspenseful situation.\n\n\n@CultCinemaClassics \n\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:37:34.203Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/yRCQoHwbNWY/maxresdefault.webp",
      "duration": 4280,
      "language": "en",
      "year": 1961,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:37:34.335Z"
}