{
  "movieId": "youtube-DjPXoYvqTDc",
  "title": "Solitary - Gefangen im All (SCI FI THRILLER auf Deutsch, Science Fictionfilme in voller Länge)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=DjPXoYvqTDc",
      "id": "DjPXoYvqTDc",
      "title": "Solitary - Gefangen im All (SCI FI THRILLER auf Deutsch, Science Fictionfilme in voller Länge)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Ein Mann erwacht ohne Erinnerung in einer Raumkapsel – irgendwo im All. Angeblich soll er mit einer Mitgefangenen die erste Kolonie im Weltall gründen. Doch bald wird klar: Sie verfolgt ein düsteres Ziel, das alles infrage stellt.\n\nSOLITARY - GEFANGEN IM ALL (2020)\nOriginaltitel: Solitary\nMit: Johnny Sachon; Lottie Tolhurst; Michael Condron\nRegie: Luke Armstrong\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nEin Mann erwacht ohne Erinnerung in einer sterilen Zelle – irgendwo im All. Schnell wird ihm klar: Er ist nicht freiwillig hier. Als Teil einer streng geheimen Mission wurde er als Gefangener auf ein Raumschiff verfrachtet, das unterwegs ist, um die erste Kolonie der Menschheit auf einem fernen Planeten zu gründen. Doch etwas stimmt nicht. Neben ihm sitzt Alana, eine Mitgefangene mit undurchschaubaren Motiven – klug, unberechenbar und fest entschlossen, die Mission zu sabotieren. Während die künstliche Intelligenz des Schiffs die Kontrolle übernimmt und sich das Ziel nähert, beginnt ein tödliches Spiel aus Misstrauen, Manipulation und der Frage, ob der wahre Feind nicht längst an Bord ist.\n#Netzkino #ganzerFilm #scifi\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:47:44.857Z",
      "thumbnail": "https://i.ytimg.com/vi/DjPXoYvqTDc/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLC6bz567qgHCFtWRivt5S_JpAsisA",
      "duration": 5369,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.127Z"
}