{
  "movieId": "youtube-QnK5X6YIDwc",
  "title": "Born to the West (1937, Western) John Wayne, Marsha Hunt, Johnny Mack Brown | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QnK5X6YIDwc",
      "id": "QnK5X6YIDwc",
      "title": "Born to the West (1937, Western) John Wayne, Marsha Hunt, Johnny Mack Brown | Full Movie",
      "description": "It took six murdering rustlers and a girl to make a reckless rover settle down to love!\nDare Rudd and Dinkey Hooley, drifting cowhands, initially decline job offers from Dare's cousin Tom Fillmore in Montana. However, Dare changes his mind when he meets Tom's sweetheart, Judy Worstall, and ends up taking charge of a cattle drive, uncovering corruption along the way.\nCan Dare Rudd prove he is responsible enough to win the heart of Judy and also outwit the crooked saloon owner?\n\nColorized version: https://youtu.be/tFyBqMk1zfE\n\n\nOriginal title: Born to the West (1937) AKA: Helltown\n\nThis film is available with subtitles in many language options.\n\nDirector: Charles Barton\nWriters: Stuart Anthony, Robert Yost, Zane Grey\nStars: John Wayne, Marsha Hunt, Johnny Mack Brown\nCostumes: Edith Head\nGenre: Classics, Drama, Western\n\n\n00:00 Full Movie (with subtitles)\n00:08 Cowboys encounter thieves in Wyoming, leading to unexpected job offers and reflections on honesty and responsibility.\n13:59 Cowboys encounter trouble with cattle theft, eye injuries, and marriage proposals in a Western setting.\n21:51 Cowboys prepare to sell cattle, facing challenges and making plans in the Wild West.\n29:53 Cowboys embark on a journey to sell cattle, facing challenges and making decisions in a Western setting.\n39:45 A tale of deceit and betrayal unfolds during a high-stakes poker game in the Wild West.\n\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:36:37.725Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/QnK5X6YIDwc/maxresdefault.webp?v=6656987c",
      "duration": 3327,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:37.828Z"
}