{
  "movieId": "youtube-SMYknkIn60E",
  "title": "Pot o' Gold 1941 | James Stewart, Paulette Goddard (Musical, Romance) Movie | with Subtitles",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=SMYknkIn60E",
      "id": "SMYknkIn60E",
      "title": "Pot o' Gold 1941 | James Stewart, Paulette Goddard (Musical, Romance) Movie | with Subtitles",
      "description": "Jimmy, a bankrupt music store owner, goes to work with his uncle, the owner of a food factory. goes to work with his uncle in his factory. He befriends an Irish family who happens to be his uncle's enemy.  And so, Jimmy strives to unite the two parties, and take the heart of the beautiful Molly in the process.\n \nOriginal title: Pot o' Gold (1941)\n\nColorized version https://youtu.be/udzLFmXUseQ\n\nDirector: George Marshall\nWriters: Walter DeLeon, Andrew Bennison\nActors: James Stewart, Paulette Goddard, Horace Heidt \nGenres: Classic, Musical, Comedy, Romance\n\nThis film has subtitles in many languages, and dubbed audio in Italian & Spanish.\n\nSummary: Welcoming a New Musician in a Town, Court Case, Tomato-Throwing Incident, Singing and Performance Discussion, Fairy Tales and Dream-like Places, Radio Show and New Orchestra, Announcement of Cash Prize, Saving a Radio Show from Bankruptcy, Television Show Success and Contest Winner.\n\n00:00 Full Movie\n4:21 🎵 A conversation about the future of the Haskel name in both the diet product and music industries. \n20:49 🍅 A person confesses to throwing a tomato at someone and receives a court summons.\n41:43 🧚 The speaker believes in fairy tales and describes a dream-like kingdom.\n51:54 🎶 A discussion about an upcoming radio show and the inclusion of a new orchestra.\n1:03:24 😮 One person reveals a secret plan involving someone's uncle, causing tension and accusations.\n1:07:53 💰 A radio show is in danger of losing its credibility and the host's uncle facing bankruptcy unless $1000 is raised quickly.\n1:16:00 📺 A television show host announces the success of their program and reveals the winner of a contest.\n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.tiktok.com/@cultcinemaclassics\nhttps://www.instagram.com/cultcinemaclassics",
      "addedAt": "2025-12-27T00:41:36.914Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/SMYknkIn60E/maxresdefault.webp?v=65010576",
      "duration": 4926,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:41:37.026Z"
}