{
  "imdbId": "youtube-wOBT7wr-Ky4",
  "title": "Apocalyptic Sci-Fi | This Is Not a Test (1962) by Fredric Gadette | Colorized Movie",
  "year": 1962,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=wOBT7wr-Ky4",
      "title": "Apocalyptic Sci-Fi | This Is Not a Test (1962) by Fredric Gadette | Colorized Movie",
      "description": "Trapped on the road to nowhere, they must fight to stay alive.\nA policeman stopping traffic on a remote western US road reveals a nuclear attack threat, prompting a diverse group to seek refuge in a truck-turned-bomb shelter as time runs short and tensions escalate.\n\nOriginal title: This Is Not a Test (1962)\nThis film is subtitled in many languages\n\nBlack & White version: https://youtu.be/xQLXbpwckko\n\n\nDirector: Fredric Gadette\nWriters: Peter Abenheim, Betty Laskey, Fredric Gadette\nStars: Seamon Glass, Thayer Roberts, Aubrey Martin\nGenres: Colorized, Drama, Sci-Fi, Thriller\n\n\n00:00 Full Movie\n00:56 Emergency situation unfolds as Colter receives urgent instructions and faces potential detainment.\n08:02 A group of individuals encounter a police officer after a potential accident involving a rocket. They gather to discuss the situation.\n12:46 Emergency situation unfolds as authorities respond to a potential attack in a mountainous region.\n16:06 A group faces impending doom and struggles to find safety amidst chaos and uncertainty.\n19:58 Survivors face impending nuclear attack, seek refuge in truck, and confront fear and uncertainty.\n25:58 A group faces an imminent nuclear attack and must seek shelter in a protected truck.\n31:13 Chaotic events unfold involving fire, looting, and armed confrontation in a post-apocalyptic setting.\n37:46 A group prepares for a potential attack on a city, discussing survival plans and relationships.\n43:52 A summary of a colorized apocalyptic sci-fi movie 'This Is Not a Test' (1962) by Fredric Gadette.\n55:59 Survival group faces challenges in abandoned mine amidst escalating danger.\n1:03:23 A group faces apocalyptic events and tries to find shelter as a missile approaches.\n\n\n@CultCinemaClassics\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "wOBT7wr-Ky4",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:38:17.015Z"
}