{
  "imdbId": "youtube-h5Z67FAjpak",
  "title": "청녀(1974) / Cheongnyeo (Cheongnyeo) (1974)",
  "year": 1974,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=h5Z67FAjpak",
      "title": "청녀(1974) / Cheongnyeo (Cheongnyeo) (1974)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/02777\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/02777\n\n영화글 : https://www.kmdb.or.kr/story/10/5489\n\n감독(Director) : 이만희(Lee Seong-gu)\n출연 : 남궁원 , 문정숙 , 김경수 , 서한나 , 이영옥\n\n(줄거리)  낙도에서 성직자겸 의사로 일하는 김형준은 어느날 까치섬의 노파를 치료하러 갔다가 이미 노파가 죽어 있어 귀머거리이자 장님인 노파의 조카딸 석화를 데려와 정상적인 사람으로 만들기 위해 노력한다. 처녀로 성장하는 석화에게 형준은 세상의 아름다움을 느끼게 해주고 자신이 그녀에게 애정을 갖고 있기에 아들 제구의 석화에 대한 사랑을 반대한다. 그후 석화는 개안수술을 통해 광명을 찾게 되나 형준과 제구 사이에서 갈등한다. 그러나 제구는 성직자의 길을 가고 목사는 늙고 초라해졌기에 누구도 사랑할 수 없게 된 그녀는 결국 자살을 택한다.\n\n(Cast) Nam Koong Won , Moon Jung-suk , Kim Kyung-soo , Seo Han-na , Lee Young-ok \n\n(Synopsis) Kim Hyeong-Jun is working in an isolated island as a doctor and clergyman. When he goes to Kka Chi Island to give medical treatment to an old woman who is dead before he arrived, he meets her niece Seok-Hwa, a deaf mute and blind girl, and takes her with him. He makes all his efforts to make her an ordinary person. Hyeong-Jun makes Seok-Hwa, growing to be a young lady, to feel beauty of the world and he also feels love towards her. Therefore he opposes to his son Je-Ku's love for Seok-Hwa. Later Seok-Hwa regains sight by an eyesight recovery operation but she is troubled between Hyeong-Jun and Je-Ku. In the end Je-Ku takes his way to be a priest and the clergyman is too old and wretched. She finally commits suicide because she can't love either of them.",
      "id": "h5Z67FAjpak",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:22:44.266Z"
}