{
  "imdbId": "youtube-UpLJxB3jJho",
  "title": "Final Days of Sharon Tate (Documentary, Biography)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=UpLJxB3jJho",
      "id": "UpLJxB3jJho",
      "title": "Final Days of Sharon Tate (Documentary, Biography)",
      "description": "The documentary profiled the final and last days of Sharon Tate Polanski, a beloved actress and model, who was killed in 1969 by a cult in Los Angeles, California. She was eight months pregnant with her son at the time of her murder.\n\n\n00:00 Full Documentary ( with Spanish audio & many Subtitles)\n01:00  Tragic murder of Hollywood actress Sharon Tate and four others in a ritualistic mass murder.\n07:56 Intimate insights into Sharon Tate's whirlwind marriage to Roman Polanski and their glamorous lifestyle.\n13:26 Tragic events lead to Sharon Tate's return to Los Angeles, marking a moment of peace and family reunion.\n19:14 Manson's twisted ideology leads followers to commit murders in hopes of inciting a race war.\n26:04 Tragic events unfold as a group of individuals target a residence, driven by jealousy and disregard for its occupants.\n32:24 Police officers respond to a distress call and discover multiple deceased bodies in a house.\n37:25 Tragic events unfold as Charles Manson's killing spree shocks the world, leading to devastating consequences for Roman Polanski.\n42:45 Media portrayal of lifestyle, murder investigation delays, breakthrough at Barker Ranch.\n47:55 Impact of Manson on hippie movement and murder convictions leading to commuted sentences.\n\n\n@CultCinemaClassics \n\nFor more Hollywood Star Biographies: https://www.youtube.com/playlist?list=PL2gsu7VGzgdY9GgX3x1bZ5pdYigrO6uyS\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:35:24.935Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/UpLJxB3jJho/maxresdefault.webp?v=6690ffad",
      "duration": 3127,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:35:25.052Z"
}