{
  "imdbId": "youtube-iHxwCf4EXec",
  "title": "Jock - Ein Held auf 4 Pfoten - Jetzt den ganzen Film kostenlos schauen in HD bei Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=iHxwCf4EXec",
      "title": "Jock - Ein Held auf 4 Pfoten - Jetzt den ganzen Film kostenlos schauen in HD bei Moviedome",
      "description": "Jetzt den Animations-Film \" Jock – Ein Held auf 4 Pfoten „ in ganzer Länge bei #Moviedome sehen. Mehr #ganzeFilme entdecken: Abonnieren ► http://bit.ly/MoviedomeAbo \n\n►Die Handlung:\nKurze Beine, großes Herz das ist Jock, der von Natur aus sehr klein und schmächtig ist. Jock wächst im ländlichen Südafrika auf, in einer rauen Gegend, wo viele Probleme mit Gewalt gelöst werden. Doch Jock lernt von seiner Mutter Jess und seinem treuen Freund Percy, sich mit Grips und dem Glauben an sich selbst, durchzusetzen. Der kleine Jock erlebt ein spannendes Abenteuer, begleitet von Pezulu, einem überkandidelten Hahn und ständig bedroht von seinem Rivalen George, einem übellaunigen Pavian. Und dann will Jock ja auch noch das Herz von Pudeldame Polly gewinnen! \n\n►Zum Film:\nJock, ein Held auf 4 Pfoten ist ein wunderbarer Film für die ganze Familie.\nDie Geschichte basiert auf einer wahren Begebenheit, die den südafrikanischen Autor Sir Percy Fitzpatrick zu dem Erfolgsroman Jock of the Bushveld inspiriert hat. Bryan Adams hat zwei Songs beigesteuert und in der Rolle der Jess, der Mutter des tapferen Jock, hören Sie Hella von Sinnen! \n\nJetzt “ Jock – Ein Held auf 4 Pfoten ” kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere #Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo ►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzer Film #kostenlos #movie #film #spielfilm #HD #Krimi #Crime #action #thriller #Animation\n\nFilmlänge 80 Minuten \nFSK: ohne Altersbeschränkung\nDVD-Start (DE): 2013\n\nJetzt ganze Filme bei #Moviedome anschauen \n\nFinde Movies in ganzer Länger diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \nDen Animationsfilm „ Jock – Ein Held auf 4 Pfoten ” in voller Länge auf deutsch ansehen.",
      "id": "iHxwCf4EXec",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:34:17.992Z"
}