{
  "imdbId": "youtube-P7eYYyHdqRk",
  "title": "Fairplay (Western, 1971) Paul Ford, Robert Middleton",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=P7eYYyHdqRk",
      "title": "Fairplay (Western, 1971) Paul Ford, Robert Middleton",
      "description": "A Western Comedy for the family that laughs together...\nA young man heads west to visit his uncle F.O. in a town named Fairplay. There a bit of friction between town locals.\n\nOriginal title: Fairplay (1971) AKA: Help Stamp Out Fairplay\n\n\nDirector: James A. Sullivan\nWriters: Gary Carr \nStars: Paul Ford, Robert Middleton, Terry Wilson  \nGenres: Western\n\n\n00:00 Full Movie \n12:12 Drama unfolds in a wild west town as hired guns face challenges and unexpected twists.\n18:44 Wild West hotel owner warns nephew about rough life and shows off antiques to buyer.\n24:54 Interactions between characters in a Western setting involving animals, jewelry, and a hotel.\n31:28 In a Western town, plans are made to retire to Paris with stolen money. A gunsmith is tasked with building a Gatling gun for the Mcgills and Purposes.\n39:51 A Western film featuring a mysterious death, robbery investigation, and a plan against the villains.\n46:54 Conflict arises over marmalade purchase misunderstanding during a tense standoff between two groups.\n56:28 Betrayal, deceit, and a quest for redemption unfold in a Western film set in Colorado.\n1:05:37 A group of individuals seek a missing piece of a map to a mine, leading to the discovery of a powerful weapon.\n1:12:00 A Western movie involving a high-intensity gun, earplugs, and a plan to blow up a building.\n1:21:36 Betrayal and conflict arise over a gambling debt in a Western setting.\n\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=PL2gsu7VGzgdYPia0gUqaqqd36Hc-JufbW",
      "id": "P7eYYyHdqRk",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:45.765Z"
}