{
  "imdbId": "youtube-3OLZttvajZ8",
  "title": "Crash Kids (Actionfilme Deutsch, kompletter Film auf Deutsch in voller Länge anschauen, ganzer Film)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3OLZttvajZ8",
      "title": "Crash Kids (Actionfilme Deutsch, kompletter Film auf Deutsch in voller Länge anschauen, ganzer Film)",
      "description": "► Filme auf Deutsch anschauen in voller Länge - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n► Dir gefällt Netzkino? Dann lass uns ein Like da: http://bit.ly/NetzkinoFacebook\n► Actionfilm von Raoul W. Heimrich aus dem Jahr 2007.\n\n..................................................................\n\nCRASH KIDS (2007)\nOriginaltitel: Crash Kids: Trust No One\nMit:  Thomas Anzenhofer, Joachim Paul Assböck, Dean Baykan\nRegie: Raoul W. Heimrich\nFSK: keine Einstufung\n\nINHALTSANGABE:\nNEW YORK, VERLASSENENES INDUSTRIEGELÄNDE\nEin DEA-Kommando überwacht einen Drogendeal. Alle sind bereit. Dann bricht die Hölle los. Ein massiver und präziser Einsatz. Die Gangster sind gefasst, der Einsatz scheint perfekt. Doch einem der Hauptverdächtigen gelingt die Flucht…\n\nDEUTSCHLAND, AUTOBAHN\nMike (Daniel Buder) wird nach einem Crash mit einem gestohlen Wagen auf der Autobahn von der Polizei geschnappt. Sein Freund Werner (Kieron Freigang), der für den Diebstahl verantwortlich ist, kann entkommen.\nMike landet auf Anraten seines Freundes in der „Jugendbesserungsanstalt Wolfshöhe“ anstatt im Gefängnis. Dort sind die Sitten rauh und der Anstaltsleiter Dr. Schmidt (Jim Boeven) unterwirft seinen Zöglingen einem harten Drill. Zum Glück gibt es da den vielschwätzigen Timmy (Chris Schütz) und die geheimnisvolle Miu (Milena Karas), mit denen Mike schnell Freundschaft schließt.\nBei einer nächtlichen Aktion der drei, verschwindet plötzlich Timmy. Als sich Mike und Miu auf die Suche nach ihm machen, entdecken die anstelle ihres Freundes ein geheimes Drogenlabor. Doch ihre Entdeckung bleibt nicht unbemerkt. Es beginnt eine wilde Flucht und Mike wird immer tiefer in den Fall verwickelt: Nicht nur, dass man ihn für den Tod an Timmy verantwortlich macht – auch seine Freunde Werner und Miu entpuppen sich plötzlich als Feinde anstelle von Gefährten.\nJetzt kann ihm nur noch sein Vater (Thomas Anzenhofer) helfen – er ist Agent der amerikanischen Drogenbehörde DEA und auf dem Weg von den USA nach Deutschland.\nWas Mike aber noch nicht weiß, ist, dass sein Vater in dem gefährlichen Spiel auch eine Rolle spielt…\n#Spielfilm #ganzerFilm #Action\n\n\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum Streamen, kostenlos & legal auf http://bit.ly/NetzkinoWebsite\n✘ Abonniere unseren Trailerkanal für die neusten Kinotrailer:  http://bit.ly/NetzkinoTrailer\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nFOLGE UNS!\n✘ Facebook - https://www.facebook.com/netzkino\n✘ Twitter - https://twitter.com/netzkino\n✘ Instagram - https://www.instagram.com/netzkino/\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "3OLZttvajZ8",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T00:11:58.868Z"
}