{
  "imdbId": "youtube-dI78uC_JbBs",
  "title": "The Fourth Victim 1971 | Carroll Baker, Michael Craig | Mystery, Thriller | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=dI78uC_JbBs",
      "title": "The Fourth Victim 1971 | Carroll Baker, Michael Craig | Mystery, Thriller | Full Movie",
      "description": "A wealthy Englishman finds his third wife dead. After the police discover that his first two wives had also died suddenly, an investigation is launched. Meanwhile, a new neighbor moves in and becomes very interested in him.\n\nOriginal title: La última señora Anderson\nAKA: The Fourth Mrs. Anderson / Death at the Deep End of the Swimming Pool\n\nDirector: Eugenio Martín\nWriters: C.B. Gilford, Vicente Coello, Santiago Moncada\nStars: Carroll Baker, Michael Craig, Miranda Campa\nGenres: Mystery, Romance, Thriller\n\n00:00 Full Movie\n08:33 A man is charged with murder after his wife's body is exhumed for an autopsy.\n13:45 Mr. Anderson is accused of killing his wives, but the jury finds him not guilty.\n26:30 A man returns home after a long absence and encounters a woman who is trespassing in his pool.\n34:00 Julie and Arthur get married, proving their trust and love for each other.\n50:09 Arthur Anderson reports his new wife, Julie Spencer, missing to the police, but they discover she was previously involved in a murder investigation and had been treated for mental illness at the Shepherd Clinic.\n52:42 A couple discusses their troubled past and their hopes for the future.\n1:01:26 A man discovers that his wife is not who she seems and plans to kill her.\n1:14:23 A mysterious phone call leads to a confrontation between Mr. Anderson and Julie Spencer/Lillian Martin.\n1:23:23 A man discovers his wife's true identity and her involvement in a scheme, leading to a dangerous situation.\n\n@CultCinemaClassics",
      "id": "dI78uC_JbBs",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "DE",
          "ES"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:40:46.757Z"
}