{
  "imdbId": "youtube-uF0_LehLD2Q",
  "title": "촌놈 오복이(1961) / Country Bumpkin O-Bok(1961)",
  "year": 1961,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=uF0_LehLD2Q",
      "id": "uF0_LehLD2Q",
      "title": "촌놈 오복이(1961) / Country Bumpkin O-Bok(1961)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00688\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00688\n\n감독(Director) : 임원직(Im Won-jik) \n출연 : 김승호, 엄앵란, 문정숙, 최무룡, 김석훈, 김희갑, 구봉서, 최남현, 이예춘, 양미희, 이룡, 남춘역\n\n줄거리 : 범냇골 부자 순영(최남현)은 아들 재석(최무룡)과 놀음꾼 허서방의 딸 순이(문정숙) 사이를 반대하여, 어렸을 적부터 머슴살이를 하는 노총각 오복(김승호)을 순이와 결혼시킨다. 오복과 순이는 딸 숙희(엄앵란)를 낳고 살아가던 중, 재석이 순이를 찾아와 두 사람은 도망치고, 오복은 남편과 자식을 버린 부정한 아내를 저주하며 불우하게 살아간다. 숙희는 오사장의 딸의 가정교사로 일하며 아버지를 서울로 모셔오는데, 오사장의 큰딸 혜영(양미희)이 좋아하는 설계사 태민(김석훈)과의 사이 때문에 일을 그만두게 된다. 숙희는 술집에서 일을 하며, 손님으로 온 재석을 만나고, 재석이 자신의 생모 순이와 도망친 남자라는 사실을 안다. 괴로워하던 오복 앞에 태민이 나타나고, 오복은 숙희와 태민을 축복하며 고향으로 돌아간다.\n※ 본 영화는 사운드는 모두 현존하나 영상 약 43분 분량이 유실되었으며 내용의 이해를 돕기 위해 장면 설명 화면자막을 삽입하였다. \n\nCAST : Kim Seung-ho, Um Aing-ran, Moon Jung-suk, Choi Moo-ryong, Kim Seok-hun, Kim Hee-kap, Koo Bong-seo, Choi Nam-hyun, Lee Yea-chun, Yang Mi-hee, Lee Yong, Nam Chun-yeok\n\nSYNOPSIS : Kind-hearted country bumkin O-bok leads a simple life working as a long-time farmhand for the rich landlord Soon-young. When Soon-young discovers that his son Jae-seok has fallen for local girl Soon-yi, he protests the relationship and arranges for Soon-yi to be wed to O-bok instead. Despite the initial heartbreak, Soon-yi grows fond of O-bok over time and they have a daughter together named Sook-hee. However, when Jae-seok returns into Soon-yi’s life, she cannot resist his charms and runs away with him, leaving Jae-seok to raise Sook-hee on his own. Years later, Sook-hee is now a grown woman working in the city and in close contact with her father. However, a series of coincidences threaten to forcibly reunite O-bok and Sook-hee with Jae-seok and Soon-young in the most dramatic way possible.\n\n※ While the sound for this film is complete, about 43 minutes of picture has been lost. Scene descriptions have been added in the form of title cards to aid the viewing experience.",
      "addedAt": "2025-12-26T00:22:45.118Z",
      "thumbnail": "https://i.ytimg.com/vi/uF0_LehLD2Q/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCWm81wEXXH6PEAFPlzStMn8aWMAA",
      "duration": 6712,
      "language": "ko",
      "year": 1961,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:22:45.130Z"
}