{
  "movieId": "youtube-ARCCHg6QvDQ",
  "title": "The Boy in the Plastic Bubble 1976 (Biography, Romance) John Travolta",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ARCCHg6QvDQ",
      "id": "ARCCHg6QvDQ",
      "title": "The Boy in the Plastic Bubble 1976 (Biography, Romance) John Travolta",
      "description": "Born with no immunity against disease, he lives in a plastic prison. Inside he is protected. Outside, there is the chance of death. But the chance of love. \nThe girl next door makes Tod, a teen boy with immune deficiencies want to leave his germ-free bubble.\n\nOriginal title: The Boy in the Plastic Bubble (1976)\nThis film has English, French, Portuguese & Spanish audio options, and is subtitled in many languages.\n\nDirector: Randal Kleiser\nWriters: Douglas Day Stewart, Joe Morgenstern\nStars: John Travolta, Glynnis O'Connor, Robert Reed & Buzz Aldrin\nGenres: Biography, Drama, Romance, Made for TV\n\n\n00:00 Full Movie (with subtitles)\n00:14 A couple faces a difficult decision when they discover their newborn son has a compromised immune system.\n10:55 Bubble boy comes home, & must spend the rest of his life in a completely sterile environment\n11:00 A heartwarming story about a boy who finally returns home after living in isolation due to a rare medical condition.\n20:53 A discussion between characters about a doctor's potential breakthrough in treating a medical condition.\n22:40 A glimpse into the life of a boy living with a rare condition and his interactions with others.\n32:12 A young boy with a compromised immune system forms a bond with a fellow patient in a hospital.\n41:53 A young boy confined to a plastic bubble dreams of freedom and normalcy, while his neighbor offers help and support.\n54:29 Drama unfolds as Gina and Tod navigate through personal struggles and academic challenges.\n57:43 A heartwarming story of a young man living in a bubble, exploring love and independence.\n1:04:46 Exploration of a unique individual's daily routine and interactions with friends in a TV movie.\n1:15:44 Exploration of complex relationships & personal struggles in a TV movie featuring John Travolta.\n1:23:24 Romantic drama involving a boy in a plastic bubble, navigating relationships and health concerns.\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:37:14.757Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/ARCCHg6QvDQ/maxresdefault.webp?v=6628a005",
      "duration": 5825,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:37:14.854Z"
}