{
  "imdbId": "youtube-U0vJtkVDpmg",
  "title": "The Restless Breed (1957 Western) Scott Brady, Anne Bancroft | Lawyer by Oath, Gunslinger by Force",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=U0vJtkVDpmg",
      "title": "The Restless Breed (1957 Western) Scott Brady, Anne Bancroft | Lawyer by Oath, Gunslinger by Force",
      "description": "Disguised as a drifter, lawyer Mitch Barrett (Scott Brady) arrives in Mission to avenge his father, but his plan is threatened by the town’s ruthless gang and a U.S. Marshal determined to keep the peace. Torn between vengeance, justice, and his growing bond with Angelita (Anne Bancroft), Mitch must decide whether to fight like an outlaw or uphold the law he once swore to serve.\n\nOriginal title: The Restless Breed\n\nDirector: Allan Dwan\nWriter: Steve Fisher\nStars: Scott Brady, Anne Bancroft, Jay C. Flippen, Jim Davis\nGenre: Western\nRelease date: May 1957 (USA)\n\n\n00:00 Full movie (with subtitles)\n01:36 Mitch arrives in Mission, Texas, vowing to investigate his father's murder by Newton Raiders.\n05:21 Mitch confronts Cherokee and outlaws at the saloon, establishing himself as a formidable gunslinger.\n23:03 Mitch survives a coordinated ambush, proving his combat skills to skeptical townspeople.\n35:00 Reverend Simmons performs emergency surgery on Cherokee, revealing Mitch's growing moral influence.\n50:08 Marshal Evans condemns Mitch's vigilante justice, forcing him to confront his reckless motivations.\n1:00:02 Angéletta confesses her love for Mitch, pleading with him to abandon his deadly quest.\n1:13:00 Mitch storms Newton's hideout alone, triggering a climactic showdown to avenge his father.\n1:19:19 Mitch defeats Newton and restores order, fulfilling his oath while sacrificing personal peace.\n\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA\n\n@CultCinemaClassics \n\n@CultCinemaClassics",
      "id": "U0vJtkVDpmg",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "AT",
          "AU",
          "CH",
          "DE",
          "ES",
          "GB",
          "IT",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:32:07.571Z"
}