{
  "imdbId": "youtube-1FCUua7YKJE",
  "title": "무영탑(1957) / Muyoung Tap (The Shadowless Pagoda)",
  "year": 1957,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1FCUua7YKJE",
      "id": "1FCUua7YKJE",
      "title": "무영탑(1957) / Muyoung Tap (The Shadowless Pagoda)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어)https://www.kmdb.or.kr/db/kor/detail/movie/K/00335\n(English)https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00335\n\n감독(Director): 신상옥(Shin Sang-ok)\n출연(Cast): 최은희(Choi Eun-hee), 한은진(Han Eun-jin), 곽건(Gwak Geon), 김승호(Kim Seung-ho), 송억(Song Eok)\n\n(줄거리) 신라 경덕왕 10년 사월 초파일, 유종의 딸 구슬아기(최은희)는 경덕왕의 불국사 행차에 동행했다 부여 석공 아사달(곽건)을 보게 된다. 그에게 마음이 끌린 구슬아기는 다음날 석가탑 공사장을 찾게 되고 그 곳에서 과로로 쓰러진 아사달을 발견한다. 아사달을 돌보는 사이 그에 대한 구슬아기의 마음은 점점 깊어 가지만 아사달은 부여에 두고 온 아내 아사녀(한은진)를 못내 그리워한다. 한편 구슬아기를 흠모해온 금성은 아버지 금지를 통해 청혼하나 간신인 금지를 못마땅하게 여긴 유종은 혼사를 거절하고 대신 충신 경신과의 혼인을 서두른다. 부여에서 아사달이 돌아오기만을 기다리던 아사녀는 병든 아버지가 세상을 떠나자 아사달을 찾아 불국사로 오게 된다. \n\n(Synopsis) On the eighth of April of King Gyoeng-deok's 10th year of reign of the Unified Silla Period, Guseulagi (Choi Eun-hee), a daughter of Yu Jong, joins the king's parade to Bulguksa Temple, where she meets a stonemason named Asadal (Gwak Geon) from Buyeo. Having a crush on him, she visits Sakyamuni Pagoda, a masonic site; only to find that Asadal had broken down from exhaustion. While she takes care of him, her love for him grows. But Asadal misses his wife who is waiting for him in Buyeo. Meanwhile, Geum Seong who has a crush on Guseulagi, asks his father, Geum Ji, to propose on behalf of him. But Yu Jong is so dissatisfied with Geum Ji because he is a treacherous subject, that he turns down the proposal, instead hurrying up his daughter's marriage with Gyeongsin, a faithful subject. Asanyeo who has been waiting for her husband Asadal in Buyeo, goes to Bulguksa Temple after her father-in-law had died.",
      "addedAt": "2025-12-26T00:22:56.279Z",
      "thumbnail": "https://i.ytimg.com/vi/1FCUua7YKJE/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBi17rxhFLRyuqyyVnpxCwUcw-PNQ",
      "duration": 7125,
      "language": "ko",
      "year": 1957,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:22:56.317Z"
}