{
  "movieId": "youtube-37VERat3G7c",
  "title": "Ed Wood Jr | Plan 9 from Outer Space 1957 | Colorized | Horror, Sci-Fi | Cult Film | subtitles",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=37VERat3G7c",
      "id": "37VERat3G7c",
      "title": "Ed Wood Jr | Plan 9 from Outer Space 1957 | Colorized | Horror, Sci-Fi | Cult Film | subtitles",
      "description": "Unspeakable Horrors From Outer Space Paralyze The Living And Resurrect The Dead!\nA team of brave individuals unite to confront evil alien's intent on resurrecting the dead and preventing mankind from creating a destructive weapon. With flying saucers appearing in the sky, they must save humanity from the impending threat.\n\nOriginal title: Plan 9 from Outer Space (1957)\n\n\nBlack & white version: https://youtu.be/qsb74pW7goU\n\nDirector & Writer: Edward D. Wood Jr.\nCast: Bela Lugosi, Tor Johnson, Mona McKinnon, Gregory Walcott, Tom Keene, Lyle Talbot\nGenres: B-movie, Cult film, Horror, Sci-Fi\nBudget: $60,000\n\n00:00 Full length movie.\n00:10 Uncovering a mysterious and shocking tale of grave robbers from outer space in a cult horror film.\n11:29 Interstellar beings visit Earth, causing chaos and secrecy among military and civilians.\n22:45 Government officials deny existence. Plan 9 involves resurrecting the dead using electrodes. Concerns over flying saucers and graveyard incidents.\n29:27 A mysterious cemetery disturbance leads to a missing body and a saucer sighting, prompting further investigation.\n43:53 Alien message warns Earth of destruction due to advanced technology and urges peaceful coexistence.\n48:10 Aliens attempt to use Earth's dead to prove their existence and gain acceptance, leading to a series of mysterious events.\n1:01:13 Alien soldiers seek Earth's aid after being misunderstood and mistaken for enemies in a sci-fi horror cult film.\n1:05:27 Alien warns Earth of destructive power of solaronite bomb, urges to stop before destroying universe.\n1:11:32 Alien invasion threat sparks chaos and disbelief among humans in a cult sci-fi horror film.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=PL2gsu7VGzgdYT_Zk0DHuuOUVtCef1TewS\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:42:27.026Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/37VERat3G7c/maxresdefault.webp?v=64cca936",
      "duration": 4718,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:42:27.136Z"
}