{
  "imdbId": "youtube-JjVi0-JcHP8",
  "title": "[4K] 안개는 여자처럼 속삭인다(1982) / Mist Whispers Like Women (Angaeneun yeojacheoleom sogsag-inda)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=JjVi0-JcHP8",
      "id": "JjVi0-JcHP8",
      "title": "[4K] 안개는 여자처럼 속삭인다(1982) / Mist Whispers Like Women (Angaeneun yeojacheoleom sogsag-inda)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/03631\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/03631\n\n영화글 : https://www.kmdb.or.kr/story/10/930 \n\n감독(Director) : 정지영(Chung Ji-young)\n출연 : 신일룡 , 오수미 , 윤영실 , 차현재 , 김수경\n줄거리 : 휴가차 별장에 와있던 성민은 도희라는 여자와 동행이다. 언제부턴가 사랑하는 사이였던 두 사람은 성민의 아내를 유인해 강가에 떠밀어 익사케 하고 집의 정원에서 실족사한 양 음모를 꾸민다. 그러나 아내의 시신 행방이 묘연해지고 성민 앞에 아내가 살아 있는 듯한 흔적이 계속 나타나 그를 공포에 떨게 한다. 성민은 아내의 환영을 미친 듯이 뒤쫓아 보지만 언제나 헛수고로 돌아간다. 성민은 신경불안과 죄의식에 사로잡혀 점점 미쳐간다. 마침내, 아내가 나타나겠다고 예고한 날, 성민은 발광하여 연못에 떨어져 죽고 만다. 성민의 흉계를 눈치 챈 혜련이 도희를 이용하여 성민을 자기 함정에 빠뜨린 것이다. 혜련은 도희 마저 없앤 후 외국으로 떠나려 했으나 끈질기게 사건을 추적하던 하 형사가 그 앞을 가로 막는다. 위기를 벗어난 도희가 모든 것을 밝힘으로서 끝없는 탐욕이 저지른 죄의 댓가를 받게 된다.\n\nCasts :Sin Il-ryong , Oh Su-mi , Yun Yeong-sil , Cha Hyun-jae , Kim Sugyeong\nSYNOPSIS : Sung-min and Do-hi love each other. So Sung-min lures his wife Hye-ryun to a riverside and drowns her. Afterwards, he disguises her death as an accidental fall in their garden. But his wife's body is nowhere to be found and there are signs that she is alive. Sung-min and Do-hi tremble with fear. Sung-min shakes with guilt. On the day his wife is predicted to return, Sung-min falls into a pond and dies. Hye-ryun had caught onto Sung-min's wicked plans of murder. Using Do-hi, Hye-ryun was able to entrap Sung-min. Hye-ryun gets rid of Do-hi as well and tries to escape to America but the tenacious chase of Detective Ha blocks her path.",
      "addedAt": "2025-12-26T00:21:12.202Z",
      "thumbnail": "https://i.ytimg.com/vi/JjVi0-JcHP8/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAcyS7vTkfXxCP2ljYnD3rVwYfmDQ",
      "duration": 5707,
      "language": "ko",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:21:12.262Z"
}