{
  "imdbId": "youtube-zuw3cZmO2Kc",
  "title": "Claude Chabrol’s Der Schlachter  - Jetzt den ganzen Film kostenlos schauen bei Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=zuw3cZmO2Kc",
      "title": "Claude Chabrol’s Der Schlachter  - Jetzt den ganzen Film kostenlos schauen bei Moviedome",
      "description": "Jetzt den Krimi von Claude Chabrol \" Der Schlachter “ in ganzer Länge bei #Moviedome sehen.\n\nParallel zu einer ungewöhnlichen Freundschaft zwischen einem mürrischen Metzger aus der Arbeiterklasse und einer verklemmten Schullehrerin passieren in einer französischen Provinzstadt grausige Ripper-Morde.\nAuf einem sommerlichen Schulausflug macht die Lehrerin Hélène eine grauenvolle Entdeckung: Am Wegesrand findet sie eine Frauenleiche und direkt daneben jenes Feuerzeug, das sie kürzlich Popaul Thomas geschenkt hatte, einem Fleischer, den sie auf der Hochzeit eines Kollegen kennen gelernt hatte. Sie gerät in Panik: Ist der sympathische Schlachter jener grausame Frauenmörder, der seit geraumer Zeit gesucht wird...?\n\nChabrol und die Nouvelle Vague\nClaude Henri Jean Chabrol gilt als einer der Vertreter der Nouvelle Vague und stellt sich damit zu Jean-Luc Godard, Jacques Rivette, Éric Rohmer, Jacques Rozier und François Truffaut. Ende der 1950er Jahre entstand in Frankreich eine neue avantgardistische Szene von jungen Cineasten, die sich dem damals zeitgenössischem französischen Kino abkehrten. Dazu zählen Filme wie Hiroshima, mon amour (Alain Resnais, 1959), Außer Atem (\"À bout de souffle\", Jean-Luc Godard, 1960), Schießen Sie auf den Pianisten (\"Tirez sur le pianiste\", F. Truffaut, 1960), Paris gehört uns (\"Paris nous appartient\", Jacques Rivette, 1961), Letztes Jahr in Marienbad (\"L’année dernière à Marienbad\", Alain Resnais, 1961), Lola, das Mädchen aus dem Hafen (Jacques Demy, 1961), Die Geschichte der Nana S. (\"Vivre sa vie\", J.-L. Godard, 1962), Adieu Philippine (Jacques Rozier, 1962), Jules und Jim (\"Jules et Jim\", F. Truffaut, 1962), Elf Uhr nachts (\"Pierrot le fou\", J.-L. Godard, 1965), Geraubte Küsse (\"Baisers volés, F. Truffaut, 1968), Die untreue Frau (\"La femme infidèle\", Claude Chabrol, 1969) oder Tisch und Bett (\"Domicile conjugal\", F. Truffaut, 1970). Bedeutende Schauspieler waren Maurice Ronet, Jeanne Moreau, Lino Ventura, Stéphane Audran, Jean-, Anne Wiazemsky, Paul Belmondo, Anna Karina oder Michel Piccoli. Die Anfänger der Bewegung liegen in den ehemaligen Chefautoren der französischen Filmzeitschrift Cahiers du cinéma André Bazin und Jacques Doniol-Valcroze, worin 1954 auch François Truffaut (Les Quatre Cents Coups 1959, Jules et Jim 1962, La nuit américaine 1973) seinen berühmten Artikel “Une certaine tendance du cinéma français“ verfasste. Claude Chabrol hat sich in seinen Filmen immer wieder sozialkritisch mit der französischen Bourgeoisie befasst. Gerne hat er auch auf Vorlagen bekannter Autoren zurückgegriffen, wie zum Beispiel von Henry James, Cornell Woolrich, Flaubert, Henry Miller oder Patricia Highsmith. Zu Chabrols bekanntesten Filmen zählen: Die Enttäuschten (1958), Biester (1995), Eine Frauensache (1988), Das Leben ist ein Spiel (1997). Der Einfluss der Nouvelle Vague ist auch heute noch zu Spüren. Quentin Tarantino oder Martin Scorsese haben viele Ideen der französischen Avantgardisten in ihren eigenen Film zitiert.\n\nMehr #ganzeFilme entdecken: Abonnieren ► http://bit.ly/MoviedomeAbo\nJetzt “ Der Schlachter ” kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere #Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo ►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n\n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzer Film #kostenlos #movie #film #spielfilm #HD #Krimi #Crime #action #thriller #Abenteuer #Action #Krieg #Drama\n\nOriginaltitel: Le boucher\nFilmlänge: 93 Minuten \nRegie: Claude Chabrol\nFSK: 12\nDVD-Start (DE): 2006\n\nDie Darsteller\nStéphane Audran in der Rolle der Hélène\nJean Yanne in der Rolle des Popaul\nAntonio Passalia in der Rolle des Angelo\nPascal Ferone in der Rolle des Père Cahrpy\n\n\nJetzt ganze Filme bei #Moviedome anschauen \n\nFinde Movies in ganzer Länger diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \n\nDen Krimi von Claude Chabrol \" Der Schlachter “ in voller Länge auf deutsch ansehen.",
      "id": "zuw3cZmO2Kc",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:35:05.760Z"
}