{
  "imdbId": "youtube-gMNzWVhkfS4",
  "title": "Unexpected Romance at the Lakehouse | Mistletoe Magic | HD Hallmark Holiday Romance Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gMNzWVhkfS4",
      "id": "gMNzWVhkfS4",
      "title": "Unexpected Romance at the Lakehouse | Mistletoe Magic | HD Hallmark Holiday Romance Movie",
      "description": "Unexpected Romance at the Lakehouse | Mistletoe Magic | HD Hallmark Holiday Romance Movie - When a successful NYC businessman inherits his grandfather's Maine lakehouse, he learns that the will stipulates carrying on the family's festive Christmas legacy. He hires a local event planner, and gets more than he ever could have bargained for.\n\nWatch Mistletoe Magic, a full Hallmark Christmas movie where a successful NYC businessman inherits his grandfather’s Maine lakehouse and discovers that the will requires him to continue the family’s festive Christmas traditions. Hiring a local event planner to help, he soon finds himself swept up in holiday magic—and unexpected romance. Perfect for fans of Hallmark Christmas movies, romantic holiday films, full free Hallmark Christmas movies, cozy winter romances, and heartwarming festive stories, Mistletoe Magic delivers love, laughter, and the true spirit of Christmas.\n\nDeck the Heart | Stars: Joe Kurak, Eliza Roberts, Julia Yorks\n*Licensed from Gemelli. All rights reserved*\n\n*Welcome to Movie Central, SUBSCRIBE NOW!* - https://bit.ly/3mRDJox\r\n\r\nAll of the content on this channel is UNDER LEGAL LICENSE (We have written contracts) from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - rights@vamedianetwork.com\r\nMovie Central is owned and operated by VA Media Ltd. All rights reserved.\r\n\r\n#christmasmovie #2025christmas #FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-26T23:59:21.599Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/gMNzWVhkfS4/maxresdefault.webp",
      "duration": 6238,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T23:59:21.629Z"
}