{
  "imdbId": "youtube-esLWhJhrHP0",
  "title": "The Sea Knows ( Hyeonhaetaneun Algo Itda )(1961)",
  "year": 1961,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=esLWhJhrHP0",
      "title": "The Sea Knows ( Hyeonhaetaneun Algo Itda )(1961)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00686\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00686\n\n영화글\nhttps://www.kmdb.or.kr/story/10/1945\nhttps://www.kmdb.or.kr/story/10/1286\nhttps://www.kmdb.or.kr/story/10/1277\n\n감독(Director) : 김기영(Kim Ki-Young)\n출연 : 김운하(아로운),공미도리(히데꼬),이예춘(모리 일등병),이상사(리노이에),김진규(나까무라 일등병),김석훈,주증녀(히데꼬의 어머니),김승호,박암(헌벙대),박노식,김지미,양훈,정문각,조석근,유춘수,추석양,최삼,주상현,고설봉,임운학,지방열,하룡,안성,박현철,김완택,이림,설재희,김정조,노위진,이행복,김용대,신정식,정현익,이근성,박승진,김추남,정경선\n\n줄거리 : 1944년 1월, 일본 명고옥(名古屋, 나고야)에 있는 수송부대에 한국인 학생들이 학병으로 입대한다. 그 중에는 총독에게 대들어 요주의 인물이 된 아로운(김운하)과 리노이에(이상사)가 있다. 고참병 모리(이예춘)는 아로운에게 똥이 묻은 군화 밑창을 핥게 하거나 개처럼 소리내고 행동하라고 하는 등 횡포를 부리고 인간 이하로 취급한다. 일본인들은 “일본 군대 50년의 전통”을 강조하며 그들을 학대하지만 아로운과 리노이에는 그런 전통을 비웃는다. 아로운은 우연히 일본 여인 히데꼬(공미도리)를 알게 되어 사랑에 빠진다. 그는 휴가 중에 혹은 근무 중에 틈틈이 히데꼬를 만나는데, 군대에서 당한 일들을 얘기하면서 히데꼬의 위로를 받는다. 히데꼬의 어머니(주증녀)는 그들의 관계를 극구 반대하지만, 둘은 냉수를 떠놓고 결혼식을 올린다. 미군의 대공습 직전에 탈영한 아로운은 폭격이 쏟아지는 거리를 방황한다. 부대와 도시가 초토화된 뒤, 일본군들은 국가비밀이라며 유가족들이 시체를 못보게 금지하고 집단화장을 한다. 사람들은 분노하면서 시체들에 불이 붙는 것을 지켜보는데, 이때 아로운이 시체들 사이에서 걸어 나오고 히데꼬와 다시 만난다.\n\nCasts : Kong Midori, Kim Wun-Ha, Lee Sang-Sa, Lee Ye-Chun\n\nSYNOPSIS : January 1944. Korean students are conscripted as student soldiers for a transportation troop in Nagoya, Japan. Among them are Arowoon (Kim Wun-Ha) and Inoue (Lee Sang-sa), who were on a blacklist for defying the proconsul. A veteran soldier Mori (Lee Yea-chun) makes Arowoon lick the dirty sole of his combat boots or bark and act like a dog, maltreating him as a worthless being. The Japanese abuse them as they emphasize \"50-years-long tradition of Japanese army\" but Arowoon and Inoue sneer at them. Then Arowoon comes across Hideko (Gong Midori) who is Japanese and falls in love with her. He dates Hideko during his furlough or whenever he has time and is consoled by Hideko as they talk about what he goes through at the army. Hideko's mother (Ju Jeung-ryu) is strongly against their relationship but they get married on their own. Then, Arowoon escapes the army immediately before the massed air-raid of the U.S. and wanders around the bombed streets. When the army base and the city became completely chaotic, Japanese soldiers performed group cremation for dead soldiers as they forbid families from seeing the corpse. People are enraged as they see dead bodies burn and Arowoon walks out amid burning bodies and gets to meet Hideko again.",
      "id": "esLWhJhrHP0",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:24:58.634Z"
}