{
  "imdbId": "youtube-k8YfEZ80xOc",
  "title": "Eva Gabor | Love Island (1952, Adventure) directed by Bud Pollard | Colorized Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=k8YfEZ80xOc",
      "title": "Eva Gabor | Love Island (1952, Adventure) directed by Bud Pollard | Colorized Movie",
      "description": "Tropical thunderbolt of romance!\nFor Navy pilot Lt.Richard Tabor (Paul Valentine), it was the beginning of an adventure after being stranded on a Balinese island. While relating his story to his friend, the movie moves into a flashback mode where Dick gets to meet the beautiful sarong-swathed Sarna (Eva Gabor), a Balinese beauty. It was love at first sight for the Sarna and Dick.\n\nOriginal title: Love Island (1952)\n\nThis film is available with subtitles in many language options.\n\nBlack & White version: https://youtu.be/YPcaIxTSBiw\n\nDirectors: Bud Pollard\nWriter: John E. Gordon \nStars: Paul Valentine, Eva Gabor, Malcolm Lee Beggs\nGenre: Colorized, Drama, Comedy, Adventure, Romance\n\n\n00:00 Full Movie (with subtitles)\n01:41 A tale of love, adventure, and family dynamics unfolds on a mysterious island named Tatara.\n13:30 Love, marriage, and cultural differences explored in a conversation between Tamar and Lieutenant Richardtabber.\n14:47 Exploration of cultural differences in a foreign land through customs and traditions.\n23:48 Love, sacrifice, and power struggles unfold in a tale of family dynamics and societal expectations.\n38:54 A daughter discovers her true identity and makes a heartbreaking promise to save her father.\n45:13 Betrayal and jealousy unfold as a wedding gift leads to a lover's quarrel.\n54:54 Drama unfolds as secrets are revealed on a deserted island, leading to unexpected twists.\n\n\n@CultCinemaClassics\n\n https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "k8YfEZ80xOc",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:36:08.510Z"
}