{
  "movieId": "youtube-b3YoxGXo2uA",
  "title": "According to Pontius Pilate (1987) by Luigi Magni with Nino Manfredi | Italian Movie, Subtitles",
  "year": 1987,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=b3YoxGXo2uA",
      "id": "b3YoxGXo2uA",
      "title": "According to Pontius Pilate (1987) by Luigi Magni with Nino Manfredi | Italian Movie, Subtitles",
      "description": "The story of salvation is told from the perspective of the Roman governor in Judea, Pontius Pilate.\n\nOriginal title: Secondo Ponzio Pilato (1987) AKA: According to Pontius Pilate\n\n\nThis film is available with Italian audio, and subtitled in many languages.\n\nDirector & Writer: Luigi Magni\nStars: Nino Manfredi, Stefania Sandrelli, Lando Buzzanca\nGenres: Italian cinema, Biblical, Drama, Comedy, History\n\n\n00:00 Full Movie (with subtitles)\n02:13 Insights into the crucifixion of Jesus Christ and Pontius Pilate's perspective on the events.\n11.32 Analysis of the events surrounding the mysterious occurrences in Rome and the trial of Jesus before Pontius Pilate.\n19.53 Discussion on the Messiah, the crucifixion of Jesus and the potential consequences of his resurrection.\n29:57 The resurrection of Jesus Christ is witnessed by various people, including the disciples and the women at the tomb.\n36:54 A mysterious conversation takes place regarding the disappearance of Joseph of Arimathea and the resurrection of a dead man.\n45:58 A reworking of the events surrounding the resurrection of Jesus from the point of view of Pontius Pilate.\n58:39 Dramatic account of the events involving Herod Antipas, Salome and the discussion about Jesus in Galilee.\n1:03:35 A dramatic depiction of the events involving Jesus, Pontius Pilate and John the Baptist in According to Pontius Pilate.\n1:22:12 A dramatic dialogue unfolds as the characters discuss the consequences of Jesus' crucifixion and the implications for Tiberius.\n1:32:14 Pilate's dilemma in deciding Jesus' fate and the consequences of his decision.\n1:38:54 Dramatic depiction of Pilate's encounter with Jesus, leading to his realization and acceptance of Jesus as Lord.\n\n\n @CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:37:35.521Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/b3YoxGXo2uA/maxresdefault.webp?v=661dc555",
      "duration": 6199,
      "language": "en",
      "year": 1987,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "ES",
          "IT"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:37:35.619Z"
}