{
  "imdbId": "youtube-60A7sa_8VVA",
  "title": "Oranges for Christmas (A moving Christmas film in German, full-length family films)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=60A7sa_8VVA",
      "title": "Oranges for Christmas (A moving Christmas film in German, full-length family films)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Dieser wunderschöne Film ist eine klassisch-schöne Weihnachtsgeschichte für die ganze Familie: Ein warmherziges Waisenkind will einem grimmigen Mann den Sinn von Weihnachten näher bringen...\n\nORANGEN ZU WEIHNACHTEN (2012)\nOriginaltitel: Christmas Oranges\nMit: Edward Herrmann, Nancy Stafford, Bailee Michelle Johnson\nRegie: John Lyde\nFSK: Freigegeben ab 6 Jahren\n\nINHALTSANGABE:\nDie kleine Rose wird als Baby auf den Stufen des Greenwoods Waisenhauses ausgesetzt. Dort nimmt sich die gutmütigen Mrs. Hartley (Nancy Stafford) ihrer an. Gemeinsam mit anderen Kindern wächst sie dort in einer liebevollen Umgebung auf und alles scheint gut zu sein, bis eines Tages ein schwerer Schicksalsschlag alles ändert….\nRose wird in das Irongates Waisenhaus gebracht. Anstelle der Wärme und Freundlichkeit von Mrs. Hartley, erwartet sie dort die Strenge des kalten und grausamen Schulleiters Mr. Crampton. Einzig an Weihnachten erwartet die Kinder dort ein kleiner Lichtblick: Dann nämlich soll jedes Kind eine Orange vom freundlichen und großzügigen Bruder des Schulleiters erhalten und Rose ist zunächst voller Vorfreude.\nDoch dieses Jahr liegt es allein an ihr und den anderen Waisenkindern das Weihnachtsfest zu retten und dem hartherzigen Mr. Crampton, das Fest der Nächstenliebe näherzubringen.\n#Netzkino #ganzerFilm #Weihnachtsfilme\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@netzkino_official\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "60A7sa_8VVA",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.093Z"
}