{
  "imdbId": "youtube-LkeqO0tkJzA",
  "title": "The Inspector General 1949 (American Technicolor musical comedy film) Danny Kaye, Barbara Bates",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=LkeqO0tkJzA",
      "title": "The Inspector General 1949 (American Technicolor musical comedy film) Danny Kaye, Barbara Bates",
      "description": "The Kaye way to chaos and corruption.\nAn illiterate stooge in a traveling medicine show wanders into a strange town and is picked up on a vagrancy charge. The town’s corrupt officials mistake him for the inspector general whom they think is traveling in disguise. Fearing he will discover they’ve been pocketing tax money, they make several bungled attempts to kill him.\n\nOriginal title: The Inspector General (1949) AKA: Happy Times\nThis film has English, German & Spanish audio, and is subtitled with many language options.\n\nDirector: Henry Koster\nWriters: Philip Rapp, Harry Kurnitz \nStars: Danny Kaye, Walter Slezak, Barbara Bates, Elsa Lanchester, Alan Hale \nGenres: Classics, Comedy, Musical, Romance\nBudget: $2,873,000 (estimated)\n\n\n00:00 Full Movie (with dubbed audio & subtitles)\n01:10 A comedic musical film involving mistaken identity, corruption, and a mysterious inspector.\n07:10 A musical tale unfolds as a town mistakes a con man for an inspector general.\n13:54 A tale of mistaken identity, theft, bribery, and family dynamics unfolds in a small town.\n29:42 A comedic and musical scene unfolds during a dinner party with unexpected guests and mishaps.\n35:28 Mistaken identity and corruption in a small town involving a government official and his loyal servant.\n44:30 A character who impersonates a high-ranking official to uncover corruption in a town.\n50:44 A comedic and musical tale unfolds as characters navigate through misunderstandings and unexpected events in a small town.\n1:09:30 A plot involving bribery, deception, and a love letter unfolds in a small town.\n1:17:56 A musical scene unfolds as characters celebrate together with song and dance.\n1:37:00 A comedic and musical film involving mistaken identity, treachery, and redemption in a small village.\n\n\n@CultCinemaClassics  \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "LkeqO0tkJzA",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:37:16.815Z"
}