{
  "imdbId": "youtube-za2vyvNGNjI",
  "title": "Edge of the Empire: Der Kampf um das Königreich (ACTION ABENTEUER | Unzensiert für Netzkino-Members)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=za2vyvNGNjI",
      "title": "Edge of the Empire: Der Kampf um das Königreich (ACTION ABENTEUER | Unzensiert für Netzkino-Members)",
      "description": "EDGE OF THE EMPIRE: DER KAMPF UM DAS KÖNIGREICH (2010)\nOriginaltitel: Edge of the Empire\nMit: Arnuz Lapanich, Jiraj Kaljaruek, Claude Athaseri, John Bravo, Niru Saosudchart\nRegie: Nirattisai Kaljareuk\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nAls die Han vor Jahren das Volk der Tai brutal abschlachteten, schwor sich der junge Kumpawa, dass er seine Leute rächen und sie als ihr Anführer in die Freiheit führen würde. Jetzt, 20 Jahre später, ist aus ihm ein Krieger geworden, der seine Fähigkeiten auf einem Fest unter Beweis stellen will. Doch als der Han Libong sieht, dass einige der Tai auch im Umgang mit Waffen geschult sind, was ihnen streng verboten ist, wird ein neuer Führer eingesetzt, der die Steuern erhöht und drakonische Strafen verhängt.\nGenug ist genug, einer muss handeln, und so versammelt Kumpawa die besten Kämpfer der Tai um sich, doch ihnen tritt eine Armee von 200.000 Han-Soldaten entgegen... \n#Netzkino #ganzerFilm #Actionfilm\n\nCOPYRIGHT:\nSpotfilm Networx GmbH is a serious and legal video on demand company located in Berlin, Germany. We are holding a proper license for all of our published movies. For any questions contact copyright@spotfilm-networx.com",
      "id": "za2vyvNGNjI",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-24T00:00:21.406Z"
}