{
  "movieId": "youtube-JEw3loQDZQY",
  "title": "Jerry Warren | The Incredible Petrified World (Sci-Fi, 1959) with John Carradine | Colorized",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=JEw3loQDZQY",
      "id": "JEw3loQDZQY",
      "title": "Jerry Warren | The Incredible Petrified World (Sci-Fi, 1959) with John Carradine | Colorized",
      "description": "Dive into Danger: The ocean's deepest secret lies within. \nThe crew of an oceanic expedition becomes stranded on the ocean floor in a mysterious cave system after their diving bell malfunctions. They must overcome challenges of survival, including encounters with an old cave dweller and a volcanic eruption, while a dramatic rescue operation is launched.\n\nOriginal title: The Incredible Petrified World\n\nBlack & White version: https://youtu.be/4RkGHF118t0\n\n\nThis film is available with subtitles in many language options.\n\nDirector: Jerry Warren\nWriter: John W. Steiner\nStars: John Carradine, Robert Clarke, Phyllis Coates \nGenres: Colorized classics, Action, Adventure, Sci-Fi, Thriller\n\n00:00 Full Movie (with subtitles)\n00:04 Exploration of the mysterious depths of the ocean and its fascinating inhabitants.\n04:50 Exploration of the ocean depths with a mysterious bell leads to anticipation and preparations for a grand expedition.\n10:32 Dramatic events unfold as a team faces challenges in a deep-sea expedition.\n15:49 Explorers in an underwater cave face challenges and seek a way out, encountering danger and making plans.\n23:17 Exploration of underwater caves leads to mysterious discoveries and discussions about their origins.\n27:56 Explorers discuss their progress, encounter challenges, and plan ahead during their underwater expedition.\n35:27 Challenges underground, meet a long-term survivor, and search for an exit.\n39:37 Exploring a volcanic area leads to unexpected events and decisions.\n45:03 Exploration of a failed project to create a bell, leading to a potential solution by a determined individual.\n50:07 Exploration of underwater world, challenges faced, and potential solutions.\n56:16 Unexpected encounters and dangerous situations unfold in an underwater adventure.\n\n@CultCinemaClassics\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:38:07.418Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/JEw3loQDZQY/maxresdefault.webp",
      "duration": 3813,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:38:07.520Z"
}