{
  "imdbId": "youtube-mwJIsAaY2ig",
  "title": "Kirk Douglas | My Dear Secretary (1948) Romance, Comedy | Colorized Movie",
  "year": 1948,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mwJIsAaY2ig",
      "id": "mwJIsAaY2ig",
      "title": "Kirk Douglas | My Dear Secretary (1948) Romance, Comedy | Colorized Movie",
      "description": "A budding young writer thinks it’s her lucky day when she is chosen to be the new secretary for Owen Waterbury, famous novelist. She is soon disappointed, however, when he turns out to be an erratic, immature playboy. Opposites attract, of course, but not without sub-plots that touch on competitiveness within marriage and responsibility.\n\nOriginal title: My Dear Secretary (1948)\n\nBlack & White version: https://youtu.be/OYSsZWHx4Fw\n\nThis movie is subtitled in all languages\n \nDirector & Writer: Charles Martin\nStars: Laraine Day, Kirk Douglas, Keenan Wynn, Helen Walker\nGenres: Colorized classics, Comedy, Romance\n\n00:00 Full Movie\n04:34 A writer gives a lecture and announces a job opening for a secretary.\n10:03 A chaotic day in the life of Owen Waterbury and his new secretary Felicia.\n17:47 A writer and his assistant work on a new novel while dealing with interruptions and distractions.\n32:29 A writer hires a secretary and falls in love with her, but she rejects him and quits.\n35:56 A chaotic dinner leads to a discussion about books and cooking, followed by plans to go to New York and hire a detective agency.\n57:31 Owen and Birdie discuss their financial situation and Owen's book with Mr. Folton.\n1:03:36 A comical interaction between Mr. Waterbury and his new secretary.\n1:16:28 Stephanie Gaylord's manuscript is nominated for an award, causing tension in her relationship with Owen.\n1:20:20 A writer, Owen Waterbury, hires a detective agency to follow his wife, Stephanie Gaylord, who is secretly working on a novel with her ex-boss, Charles Harris, leading to a series of confrontations and a divorce.\n1:29:19 A secretary and her boss navigate their complicated relationship while dealing with divorce and new beginnings.\n\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA\n\n@CultCinemaClassics",
      "addedAt": "2025-12-27T00:39:32.199Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/mwJIsAaY2ig/maxresdefault.webp?v=659baf71",
      "duration": 5666,
      "language": "en",
      "year": 1948,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:39:32.330Z"
}