{
  "imdbId": "youtube-JtQDp_vHQC0",
  "title": "사방지(1988) / Sa Bangji (Sabangji) (1988)",
  "year": 1988,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=JtQDp_vHQC0",
      "title": "사방지(1988) / Sa Bangji (Sabangji) (1988)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/04140\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/04140\n\n영화글 : https://www.kmdb.or.kr/story/74/1652\n\n감독(Director) : 송경식(Song Kyung-shik)\n출연 : 이혜영, 방희, 곽정희, 박암, 이경희\n\n줄거리 :  흉악범과 미친여자의 몸에서 양성을 지니고 태어난 사방지는 시주승의 구원을 받아 미륵사에서 성장하게 된다. 남편의 탈상제를 지내러왔던 청상과부 이소사와 사방지는 운명적인 만남에 의해 속가로 내려와 육욕의 차원을 넘어선 정신적 사랑을 나누기에 이른다. 그러나 그들의 사랑은 집안 어른들에게 발각당하게 되고, 소사는 사방지를 배신한다. 분노로 구사일생 탈출하여 떠돌던 사방지는 무녀 묘화를 만나 사대부가 마님들을 상대로 복수를 시작한다. 그러나 묘화는 가문의 남자들에 의해 죽고 쫓기던 사방지는 소사와 재상봉하나 문중 어른들의 추궁으로 소사는 자결을 택하고 사방지도 그녀를 따른다.\n\nCasts : Lee Hye-young , Bang Hee , Kwak Jung-hee , Park Am , Lee Kyoung-hee\n\nSYNOPSIS : Sa Bangji is a product of a union between a hardened criminal and a mentally disturbed woman. Sa Bangji is a hermaphrodite and he is taken in and cared for by a benefactor in a monastery. He meets a young widow, Lee So-sa, who comes to the temple to end her mourning period. Their meeting seems destined. They begin to share a kind of love that transcends physical pleasure. But their relationship is discovered by the elders of the family and So-sa betrays Sa Bangji. Sa Bangji barely escapes with her life and begins to roam from place to place. He soon meets a shaman priestess named Myo-hwa and plots to take revenge on those who wronged him. But Myo-hwa is killed by the men in the family and Sa Bangji reunites with So-sa. But they both decide to commit suicide when their relationship is put under harsh scrutiny by the family elders.",
      "id": "JtQDp_vHQC0",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:22:20.900Z"
}