{
  "movieId": "youtube-cxpUjKQqvKA",
  "title": "The Bell Tower (subheading: Missing another Dawn) (Jonggak)(1958)",
  "year": 1958,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=cxpUjKQqvKA",
      "id": "cxpUjKQqvKA",
      "title": "The Bell Tower (subheading: Missing another Dawn) (Jonggak)(1958)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00394\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00394\n\n영화글 : https://www.kmdb.or.kr/story/10/2052\n\n감독(Director) : 양주남(Yang Ju-Nam)\n출연 : 문정숙(영실),허장강(석승),맹만식,장민호,이기홍,하지만,박영태,정철,임동훈\n\n줄거리 : 고령사의 전설적인 종을 만든 종쟁이 석승(허장강)은 영실(문정숙)이라는 처녀와 이웃하여 노년을 절에서 보낸다. 어느 날 영실은 석승의 과거를 듣게 된다. 이름난 종쟁이의 손자로 태어나 하인 노릇을 하던 석승은 연인 옥분(문정숙)에게 세상에서 가장 아름다운 소리를 내는 종을 만들 것을 약속하고, 옥분이 급사하자 약속을 지키기 위해 종을 만들기 시작한다. 종 만드는 것을 배운지 10여년, 스승이 죽고 난 후 떠돌던 그는 한 과부(문정숙)를 만나 함께 살게 된다. 그의 할아버지는 종을 만들다가 경쟁자에게 패배하자 자살했는데, 석승은 경쟁자인 명장의 종과 할아버지가 만들었던 종을 훔쳐 달아난다. 그가 명종을 만들기 위해 고심하던 중에 아내는 아기를 낳다 죽는다. 명종을 만들기 위해 길을 떠난 그는 마침내 할아버지와 그의 경쟁자인 명장이 만든 종의 쇳물을 녹여 세상에서 가장 아름다운 소리를 내는 종을 만들지만, 딸을 잃는다. 한편 영실은 석승의 이야기를 들으면서 혹시 그가 자신의 아버지가 아닐까 생각한다. 고아였던 그녀의 아버지 역시 종쟁이라는 이야기를 들었던 것이다. 때는 2차 대전 중, 일제가 조선에 있는 모든 쇠를 강탈하던 시기여서 고령사의 종 역시 공출될 운명에 처한다. 고민 끝에 석승은 종을 떼어 숨기려 하다 낭떠러지에 떨어지고 영실의 품안에서 죽음을 거둔다.\n\nCasts : Moon Jeong-Suk,Heo Jang-Kang,Maeng Man-Shik,Jang Min-Ho\n\nSYNOPSIS : An old bell-maker Seok-seung (Huh Jang-gang), who made the legendary bell of Goryeong Temple, lives in a temple with a female neighbor named Young-sil (Mun Jeong-suk). One day, Young-sil hears about his past. The story is as follows. He was a grandson of a famous bell-maker, and became a servant. He promised his girlfriend Ok-bun (Mun Jeong-suk) that he would make a bell with the most beautiful sound in the world. When she suddenly died, he set about making the bell to keep his word. Ten years passed since he had learned how to make a bell. When his master died, he wandered around until he started living with the widow (Mun Jeong-suk). His grandfather killed himself when he was defeated by his rival who had made a better bell. Seok-seung ran away taking the two bells with him; one was the rival's, and the other his grandfather's. While he was away he thought about making the best bell. His wife died as soon as she gave birth to a baby girl. In the end Seok-seung succeeded in making the best bell by melting the two bells and making a new one. Unfortunately he lost his daughter. Meanwhile, hearing his story, Young-sil suspects that he might be her father. As an orphan she heard that her father was a bell-maker. It is during World War II, when the Japanese government loots all Joseon iron, that the bell of Goryeong Temple is doomed to be taken away. Seok-seung is so worried that he takes it off and tries to hide it, but falls off a cliff and dies in Young-sil's arms.",
      "addedAt": "2025-12-26T00:25:04.342Z",
      "thumbnail": "https://i.ytimg.com/vi/cxpUjKQqvKA/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCFbSW_2HstYalKzUygGpphfaKLdw",
      "duration": 5771,
      "language": "ko",
      "year": 1958,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:25:04.369Z"
}