{
  "imdbId": "youtube-sOacnX_dLJ4",
  "title": "The Compass of God (FULL MOVIE in German, Christian Films, Full-Length Faith Film 2025)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=sOacnX_dLJ4",
      "title": "The Compass of God (FULL MOVIE in German, Christian Films, Full-Length Faith Film 2025)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Die verwitwete Suzanne erkennt das Gute im jungen Kriminellen Eli, der ihre schwangere Schwiegertochter rettet. Trotz seiner Verhaftung nimmt sie ihn unter ihre Fittiche und hilft ihm mit Gottes Hilfe, sein Leben neu zu ordnen.\n\nDER KOMPASS GOTTES (2016)\nOriginaltitel: God's Compass\nMit: Karen Abercrombie, T.C. Stallings, Jazelle Foster, Joey Ibanez\nRegie: Stephan Schultze\nFSK: Freigegeben ab 12 Jahren\n\nINHALTSANGABE:\nGenau an dem einen Abend, als sich die tiefgläubige Highschool-Direktorin Suzanne Waters (Karen Abercrombie) den Abschied in den Ruhestand feiert, überschlagen sich die Ereignisse. Bei einem versuchten Autodiebstahl wird der vorbestrafte Jugendliche Eli (Joey Ibanez) zum Lebensretter ihrer hochschwangeren Schwiegertochter Jessica. Suzanne sieht darin ein Zeichen des Himmels und nimmt sich des straffälligen Jugendlichen an. Sie zahlt seine Kaution und nimmt ihn, gegen den Willen ihres Sohnes David, bei sich auf. Ein großes Vertrauen, das sie zunächst nicht bestätigt findet. Letztendlich zeigt sich jedoch, dass Gott einen Plan und eine Richtung im Leben für jeden hat, der bereit ist, sich ihm zu öffnen...\n#Netzkino #ganzerFilm #christlichefilme\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "sOacnX_dLJ4",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.127Z"
}