{
  "imdbId": "youtube-uK6vKByhnCk",
  "title": "The Taming of the Shrew (1929, Romance) Mary Pickford, Douglas Fairbanks | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=uK6vKByhnCk",
      "title": "The Taming of the Shrew (1929, Romance) Mary Pickford, Douglas Fairbanks | Full Movie",
      "description": "Adaptation of William Shakespeare's Play. In 16th-century Padua, Hortensio loves Bianca, but her father won't allow her to marry until his eldest, Katherine, is engaged to get married. Petruchio, seeking a wealthy match, agrees to court Katherine despite her strong-willed reputation. Despite Katherine's resistance, she has no choice but to marry him, impacting her sister's fate.\n\nColorized version https://youtu.be/boABdwFFyy4\n\n\nOriginal title: The Taming of the Shrew (1929)\n\nThis film has subtitles in many languages.\n\nDirector: Sam Taylor\nWriters: William Shakespeare, Sam Taylor \nStars: Mary Pickford, Douglas Fairbanks, Edwin Maxwell\nGenre:  Classics, Comedy, Romance, Pre-code, Literary\nBudget: $504,000\n\n\n00:00 Full Movie (with subtitles)\n00:21 Romantic comedy unfolds as friends plan marriages for wealthy suitors with challenging personalities.\n15:06 A dramatic encounter between Petruchio and Kate unfolds, showcasing their fiery personalities and potential for a tumultuous relationship.\n22:03 A tale of marriage, transformation, and love unfolds in a 1929 film adaptation.\n38:19 A chaotic wedding feast unfolds as Petruchio asserts dominance over Kate in a comedic yet tumultuous manner.\n50:07 A humorous depiction of a man's attempt to tame a spirited woman through manipulation and deception.\n\n\n@CultCinemaClassics\n\n https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "uK6vKByhnCk",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:21.797Z"
}