{
  "imdbId": "youtube-3OTgCJd_gbo",
  "title": "Die Herrschaft der Schatten - Jetzt den ganzen Film kostenlos schauen in HD bei Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=3OTgCJd_gbo",
      "title": "Die Herrschaft der Schatten - Jetzt den ganzen Film kostenlos schauen in HD bei Moviedome",
      "description": "Jetzt den Horror-Thriller \" Herrschaft der Schatten “ in ganzer Länge bei #Moviedome sehen.\n\nOhne Vorwarnung fallen weltweit alle technischen Anlagen und Lichter aus und ein Großteil aller Menschen verschwindet. Zurück bleibt nur ihre Kleidung. Die wenigen Überlebenden werden von mysteriösen, sich in der Dunkelheit verbergenden, Schatten gejagt. Nur die, die über Licht in Form von Lampen, Fackeln oder dergleichen verfügen, können sich vor den Schatten retten. Zu diesen Personen gehören unter anderem auch Luke, Rosemary, Paul und James.\n\nLuke, ein Reporter, wacht am Morgen nach dem Vorfall auf und löscht, nichts ahnend, die Kerzen aus, die die Nacht über brannten. Als er aus dem Haus geht, bietet sich ihm ein chaotisches Bild. Überall auf der Straße und den Gehwegen liegen verwaiste Kleidungsstücke umher, zudem sieht er zusammengecrashte Fahrzeuge, abstürzende Flugzeuge, aber keinen einzigen anderen Menschen. Durch eine Nachrichtensendung aus Chicago erfährt er, dass Schatten die Ursache des Unbegreiflichen sind und wie diese agieren. Er erfährt weiter, dass sie sich durch Halluzinationen ihrer Opfer bemächtigen und nur im Dunkeln Macht haben und es gibt Ratschläge, wie man sich gegen sie wehren könne.\n\nWährend der folgenden drei Tage sammelt Luke nur noch Lampen und Batterien und schützt sich vor allem, was auch nur im Entferntesten nach einer Halluzination der Schatten aussieht. Auf seiner Suche in der Stadt findet er nachts eine beleuchtete Gaststätte, die über ein Notstromaggregat versorgt wird. Dort trifft er den Jungen James, der auf seine von ihm schmerzlich vermisste Mutter wartet, die nur kurz eine Kirche aufsuchen wollte. Kurz darauf stößt Rosemary zu ihnen, die verwirrt zu sein scheint, und dann rettet man auch noch Paul, der im Häuschen einer beleuchteten Bushaltestelle Zuflucht vor den Schatten gefunden hatte und gerade noch einem Angriff entkommen konnte.\n\nMehr #ganzeFilme entdecken: Abonnieren ► http://bit.ly/MoviedomeAbo\n\nJetzt “ Die Herrschaft der Schatten ” kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere #Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo ►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n\n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzer Film #kostenlos #movie #film #spielfilm #HD #Krimi #Crime #action #thriller #Abenteuer #Action #Krieg \n \nFilmlänge: 92 Minuten \nFSK: ab 16 Jahren\nDVD-Start (DE): 2011\nDirector: Brad Anderson  \n\nDie Darsteller\nHayden Christensen in der Rolle des Luke\nThandiwe Newton in der Rolle der Rosemary\nJohn Leguizamo in der Rolle des Paul\nJacob Latimore in der Rolle des James\n\nJetzt ganze Filme bei #Moviedome anschauen \n\nFinde Movies in ganzer Länger diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \n\nDen Horror-Thriller “ Die Herrschaft der Schatten” in voller Länge auf deutsch ansehen.",
      "id": "3OTgCJd_gbo",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:35:16.616Z"
}