{
  "imdbId": "youtube-wkDZj7Ln4sE",
  "title": "The Tax Collector (1971, Comedy) by Michele Lupo | with Gastone Moschin, Philippe Leroy | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=wkDZj7Ln4sE",
      "title": "The Tax Collector (1971, Comedy) by Michele Lupo | with Gastone Moschin, Philippe Leroy | Movie",
      "description": "Architect Giambattista Manteghin, actor Romolo Moretti, Prince Pantegani and inventor Leonardo Rossi meet while trying to bribe a tax official out of paying exorbitant taxes. The four get together and conspire to rob the taxation office building, which happens to have been designed by Manteghin.\n\nOriginal title: Stanza 17-17 palazzo delle tasse, ufficio imposte (1971) AKA: The Tax Collector\n\nUncensored version: https://youtu.be/fNHbkcDcoSI\n\nThis film has Spanish audio, and subtitles in many languages.\n\nDirector: Michele Lupo\nWriters: Sergio Donati, Michele Lupo, Vittorio Metz\nStars: Gastone Moschin, Philippe Leroy, Lionel Stander, Franco Fabrizi\nGenre: Italian cinema, Comedy\n\n\n00:00 Full Movie (with subtitles)\n03:14 A chaotic scene unfolds as characters interact in a comedic manner involving a tax collector and various individuals.\n12:18 Secret underground tunnels, hidden walls, and a mysterious theft plot unfold in a comedic Italian movie.\n19:01 Tax collector faces financial struggles and seeks investment for historical palace, encountering obstacles and setbacks.\n24:32 A comedic scene unfolds as characters plan a heist at Tax Palace, showcasing wit and humor.\n32:00 Intriguing events unfold as characters plan a heist involving a safe and a stolen car.\n40:20 Interrogation of Colgate reveals key information about a mysterious thief and his accomplice.\n42:54 A comedic scene involving a tax collector and various characters on a train journey.\n50:06 A chaotic scene unfolds as characters navigate through a series of comedic mishaps and misunderstandings.\n57:43 A comedic scene unfolds as characters navigate through a confusing underground tunnel in search of a hidden treasure.\n1:03:50 Tax collectors unite in a 24-hour strike against corruption, leading to chaos and a large sum of missing money.\n1:13:50 A comedic tale of misunderstandings, investigations, and tax evasion leading to regret and new beginnings.\n\n\n@CultCinemaClassics\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "wkDZj7Ln4sE",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "ES",
          "IT"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:38:06.770Z"
}