{
  "movieId": "youtube-ukToRODESnM",
  "title": "검은 머리(1964) / Black Hair (Geomeun Meori)",
  "year": 1964,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ukToRODESnM",
      "id": "ukToRODESnM",
      "title": "검은 머리(1964) / Black Hair (Geomeun Meori)",
      "description": "본 저작물은 저작권법 제50조에 의거하여 이용 승인을 얻은 저작물임(법정허락-2021.4.30)\n\n영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/01047\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/01047\n\n영화글 : https://www.kmdb.or.kr/story/10/1141\n\n감독(Director): 이만희(Lee Man-hee) \n출연(Cast): 문정숙(Moon Jung-suk), 장동휘(Jang Dong-hee), 이대엽(Lee Dae-yub), 김운하(Kim Wun-Ha), 채랑(Chae Rang)\n\n(줄거리)  ‘검은 머리’라 불리는 회장(장동휘)의 갱단이 돈을 받아내기 위해 밀수업자 일당과 접촉한다. 한편 부인 연실(문정숙)이 아편쟁이(채랑)에게 겁탈당하는 사진이 회장에게 보내진다. 조직원들은 간통했다며 조직의 계율대로 그녀의 얼굴에 상처를 입히고, 아편쟁이와 같이 살게 된 연실은 몸을 팔아 생활한다. 거리에서 손님을 찾던 연실은 택시 운전수(이대엽)을 만나 그의 집에 머물게 된다. 얼굴의 흉터를 알게 된 그는 차주가 되면 성형시켜주겠다고 말한다. 연실은 회장을 만나려고 갱단이 운영하는 바를 찾아가지만, 조직원들은 회장 몰래 그녀를 죽이기 위해 철길로 데려간다. 그러나 뒤쫓아 온 운전수가 그녀를 구해 자신의 집으로 데려간다. 한편 아편쟁이는 연실을 찾기 위해 운전수의 여동생과 친한 패거리를 풀어 정형외과마다 지키게 한다. 얼굴을 고친 연실은 운전수의 집으로 돌아온다. 그녀가 저녁식사를 준비하는 동안 뒤를 밟은 아편쟁이가 들어와 운전수의 돈을 빼앗아간다. 회장은 연실을 다시 만나 산장으로 가는 길에 아편쟁이를 불에 태워 죽인다. 둘은 산장에서 하룻밤을 보내고, 회장은 계율을 어겼다며 자신을 처형하라고 조직원들에게 말한다. 공사장의 처형식에서 회장은 살아 돌아온 아편쟁이의 칼에 맞아 죽는다. 연실이 찾아와 회장의 마지막을 지켜준다.\n\n(Synopsis) She with black hair betrays Seong-tae, a knave, to have a constant sexual relationship with Man-ho, an opium addict. But Seong-tae abducts her. She falls to a prostitute with her face scarred. After that, she meets a reliable man and loves him deeply. When Seong-tae finds out the fact, he kidnaps the man's sister. He tells the man to exchange the two women. The man declines his offer to the last, and two men are put to their swords.",
      "addedAt": "2025-12-26T00:22:52.858Z",
      "thumbnail": "https://i.ytimg.com/vi/ukToRODESnM/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDq4XAc59XmK3EJuPhG3DVlVsKR3A",
      "duration": 6524,
      "language": "ko",
      "year": 1964,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:22:52.897Z"
}