{
  "imdbId": "youtube-fD9OsZLftGM",
  "title": "Jeremías - Zwischen Glück und Genie (KOMÖDIE in voller Länge Deutsch, Familienkomödie ganzer Film)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=fD9OsZLftGM",
      "title": "Jeremías - Zwischen Glück und Genie (KOMÖDIE in voller Länge Deutsch, Familienkomödie ganzer Film)",
      "description": "💙 Filme in voller Länge auf Deutsch anschauen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Der achtjährige Jeremías entdeckt, dass er ein hochbegabtes Kind ist. Auf der Suche nach seiner Identität gerät er in einen Zwiespalt: Soll er sein außergewöhnliches Talent verfolgen oder bei seiner liebenden, aber einfachen Familie bleiben? - Tolle Familienkomödie!\n\nJEREMÍAS – ZWISCHEN GLÜCK UND GENIE (2015)\nOriginaltitel: El Jeremías\nMit: Martín Castro, Paulo Galindo, Karem Momo\nRegie: Anwar Safa\nFSK: Freigegeben ab 6 Jahren\n\nINHALTSANGABE:\nJeremías ist ein blitzgescheiter Junge aus einfachen Verhältnissen. Weder seine Eltern noch die eigensinnige Oma können da mithalten. Doch die Extraportion Grips bringt ihre Probleme mit sich: In der Schule ist der 8-Jährige ein Außenseiter. Als ein Intelligenztest seine Hochbegabung offenbart, ändert sich so einiges in Jeremías' Leben.\nWährend er selbst versucht herauszufinden, was er später einmal werden möchte, wittert Vater Onesimo die Chance, mit dem Genie seines Sohnes das große Geld zu machen. Jeremías' Mutter Margareta befürchtet unterdessen, ihren Sprössling an einen opportunistischen Psychologen zu verlieren, der Jeremías eine ganz neue Welt eröffnet. Jeremías muss eine Entscheidung treffen - zwischen dieser aufregenden, aber einsamen neuen Welt und einem Leben im Kreise seiner liebevollen Familie.\n#Netzkino #ganzerFilm #Komödie\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "fD9OsZLftGM",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [
    "blocked"
  ],
  "qualityNotes": "YouTube video blocked/unavailable",
  "lastUpdated": "2025-12-25T23:55:16.127Z"
}