{
  "imdbId": "youtube-Jw4WFDq-uUg",
  "title": "A Hometown in Heart (Ma-eum-ui go-hyang)(1949)",
  "year": 1949,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Jw4WFDq-uUg",
      "title": "A Hometown in Heart (Ma-eum-ui go-hyang)(1949)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00211\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00211\n\n영화글 : https://www.kmdb.or.kr/story/10/519\n\n감독(Director) : 윤용규(Yoon Yong-Kyu)\n출연 : 변기종(주지스님),유민(도성),오헌용(여현용),최은희(미망인),김선영(도성모),남승민(공양주),석금성(미망인모),최운봉(황선달),차근수(진수)\n\n줄거리 : 도성(유민)은 어린 시절 어머니에게 버려져 먼 친척인 주지 스님(변기종) 손에 자라난 어린 스님이다. 그는 항상 한 번도 뵙지 못한 어머니를 그리워한다. 어느 날 도성은 자기 또래의 자식을 잃고 공양을 드리기 위해 찾아온 미망인(최은희)을 보고 어머니와 같은 정을 느낀다. 미망인 역시 도성을 자식처럼 귀여워하며 수양아들로 삼을 생각을 하고 주지 스님에게 청을 드리나, 도성의 업이 많아 세상에 내보낼 수 없다는 거절의 답을 듣는다. 어느 날 어린 도성을 버리고 다른 남자와 도망갔던 도성의 어머니(김선영)가 찾아와 주지 스님에게 도성을 내어달라고 한다. 그러나 주지 스님은 이 청을 거절하고, 도성이 미망인의 수양아들로 들어가는 것을 허락한다. 어머니는 자신을 밝히지 않은 채 도성을 만난 후 슬퍼하며 떠난다.\n그러나 도성이 미망인과 함께 서울로 떠나려는 즈음, 어머니에게 드릴 비둘기 깃털 부채를 만들고자 비둘기를 잡았다는 사실이 밝혀지고, 주지 스님은 크게 분노하여 도성을 세상으로 내보내지 않기로 한다. 얼마 후 도성은 어머니가 절에 찾아왔고 자신이 그녀를 몰라봤다는 것을 알고 어머니를 찾아 절을 나선다.\n\n\nCasts : Choi Eun-Hee, Byeon Ki-Jong, Yoo Min, Kim Seon-Young, Seok Keum-Seong, Nam Seung-Min\n\nSYNOPSIS : A child monk, Do-sung (Yu-min) learns the teachings of the Buddha while he lives with the temple's head monk (Byun Gi-jong). Do-sung receives motherly love from a young widow, Eun-hui, who frequently visits the temple. Childless Eun-hui begs the head monk to let her adopt Do-sung. Then his biological mother (Kim Sun-young) appears causing some conflict, but for the future of her son, she just leaves the temple. On the day the widow leaves the mountain with Do-sung, it is found out that he had killed a bird with a trap. The head monk decides not to send Do-sung out in the world. Do-sung  later finds out that his biological mother had been to the temple and he leaves to find her.",
      "id": "Jw4WFDq-uUg",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:25:32.624Z"
}