{
  "imdbId": "youtube-0XQ1lnoRGnc",
  "title": "The Night before Independence Day (Doglibjeon-ya)(1948)",
  "year": 1948,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0XQ1lnoRGnc",
      "title": "The Night before Independence Day (Doglibjeon-ya)(1948)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00200\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00200\n\n감독(Director) : 최인규(Choi In-Kyu)\n출연 : 최인규,임운학,박경일,민동식,김신재,박옥란,민선희,최지애,최동산,송춘호,박용욱,장화숙,한기보,염옥희,변인집,김향란,황남,이영운,장훈,백향남,이재운(그외출연),김이관(그외출연),배숙자(그외출연),이기영(그외출연),이봉환(그외출연),김일산(그외출연),장덕순(그외출연),김명일(그외출연)\n\n줄거리 : 박옥란(김신재)은 송(최동산)과 함께 아버지를 죽인 원수인 전당포 주인 민가의 주변을 5년째 감시하고 있다. 민가는 반지를 맡기러 온 딸 선희를 알아보지 못하고 겁탈하려한다. 청년 경일(최인규)은 전당포 앞을 지나다가 선희를 구해주고 둘은 근처의 창고로 숨는다. 선희는 민가가 쫓아낸 엄마를 따라 떠났다가 해방이 되서 돌아왔고, 경일 또한 해방을 맞아 누나를 찾아서 한국에 왔다. 송은 선희와 경일을 결박하지만, 옥란은 민가가 원수이지 딸은 아니라며 그녀를 놓아준다. 그리고 둘의 대화를 엿듣다가 경일이 자신의 동생임을 알게 된다. 민가는 시계와 양담배 등을 사러 나왔다가 불량배들을 만나 칼에 찔리고 경일이 그를 도와준다. 그가 아버지라는 것을 알아본 선희는 죽어가는 그를 보며 운다. 함께 있는 옥란을 본 민가는 옥란의 아버지를 죽인 것은 사고였다며 참회하고, 새 정부가 수립되는 날 죽게 된 것을 영광으로 생각한다며 남은 재산을 나라를 위해 쓰라고 유언하고 숨을 거둔다. 네 젊은이는 산에 올라 새로운 희망을 다짐한다.\n\nCasts : Choi In-Kyu, Choi Ji-Ae, Kim Shin-Jae, Hwang Nam, Park Kyeong-Il, Lim Wun-Hak, Min Seon-Hee, Song Chun-Ho\n\nSYNOPSIS : Park Ok-ran (Kim Shin-jae) has been monitoring the neighborhood of the owner of a pawnshop, named Min-ka, who killed his father five years ago with Song (Choe Dong-san). Min-ka, who does not notice that it is his daughter, Seon-hui who comes to pawn her jewelry, tries to rape her. A young man named Gyeong-il (Choe In-gyu), who happens to pass the shop, saves her, and hides with her in a nearby warehouse. She actually has just returned with her mother after the liberation of Korea, whom Min-ka had expelled long ago. Gyeong-il has also arrived in Korea to meet his elder sister after liberation. Song tries to tie Seon-hui and Gyeong-il up, but Ok-ran releases her saying that she is not the enemy, but Min-ka. Ok-ran also happens to find out that Gyeong-il is her brother by listening to their conversation in secret. Seon-hui, who has noticed that the man was her father, weeps as she looks at him. Min-ka, who sees Ok-ran there, has regrets, saying it was an accident to have killed Ok-ran's father. He adds that it is an honor for him to die on the day the government was formed. The four young people go to the mountain, renewing their hopes for the future.",
      "id": "0XQ1lnoRGnc",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:23:28.690Z"
}