{
  "imdbId": "youtube-H1_BpXJWuAc",
  "title": "Tiger and the Flame (1953) Directed by Sohrab Modi | When a queen rises, an empire trembles",
  "year": 1953,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=H1_BpXJWuAc",
      "title": "Tiger and the Flame (1953) Directed by Sohrab Modi | When a queen rises, an empire trembles",
      "description": "In 19th-century India, Queen Lakshmibai of Jhansi rises from a spirited young girl to a fearless leader, defying British colonial rule and rallying her people in a fiery fight for independence. With swords clashing and alliances tested, her unyielding resolve cements her legacy as a symbol of resistance and freedom.\n\nOriginal title: Jhansi Ki Rani (1953) World-wide: Queen of Jhansi\n\nDirector: Sohrab Modi\nWriters: Geza Herczeg, Sudarshan, Adi F. Keeka\nStars: Mehtab, Sohrab Modi, Mubarak Mechant\nGenres: History, Drama, Biography, Musical, War\n\n\n0:00:00 Full Movie with subtitles\n0:01:44 Manu's father is struck by a British carriage, prompting her to confront the driver with local children.\n0:15:45 Impressed by Manu's courage, Rajguru decides to mentor her, envisioning her as a future leader.\n0:32:10 At nine years old, Manu marries the much older ruler of Jhansi, Gangadhar Rao, becoming the queen.\n0:48:30 Under Rajguru's guidance, Queen Lakshmibai masters combat skills and political administration.\n1:05:20 After the death of her infant son, Lakshmibai adopts Damodar Rao, challenging British succession laws.\n1:22:50 During the 1857 uprising, Rani Lakshmibai leads her army into battle against British forces.\n1:29:30 In a final act of defiance, the wounded Rani continues to fight valiantly before succumbing to her injuries.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "H1_BpXJWuAc",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "AT",
          "AU",
          "CH",
          "DE",
          "ES",
          "GB",
          "IT",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:32:33.682Z"
}