{
  "imdbId": "youtube-c_bWx5n0n8Y",
  "title": "Mother and a Guest ( Sarangbang Sonnimgwa Eomeoni )(1961)",
  "year": 1961,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=c_bWx5n0n8Y",
      "id": "c_bWx5n0n8Y",
      "title": "Mother and a Guest ( Sarangbang Sonnimgwa Eomeoni )(1961)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00668\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00668\n\n영화글 : https://www.kmdb.or.kr/story/10/1941\n\n감독(Director) : 신상옥(Shin Sang-Ok)\n출연 : 최은희(어머니),전영선(옥희),김진규(손님),한은진(할머니),도금봉(식모),김희갑(계란장수),신영균(외삼촌),허장강(점쟁이)\n\n줄거리 : 할머니(한은진), 어머니(최은희), 식모(도금봉)가 모두 과부라서 ‘과부 집’이라고 불리는 옥희(전영선)네 집에 외삼촌(신영균)의 친구 한 선생(김진규)이 하숙생으로 들어온다. 아빠를 한 번도 본 적이 없는 여섯 살배기 옥희는 한 선생을 아빠처럼 따른다. 옥희 엄마와 한 선생은 남몰래 서로에게 연정을 품고, 옥희는 그런 두 사람 사이를 오가며 서로의 마음을 전달한다. 옥희에게서 한 선생이 삶은 달걀을 좋아한다는 말을 들은 옥희 엄마는 그의 밥상에 삶은 달걀을 올리고, 그날부터 매일 집에 들르게 된 홀아비 계란장수(김희갑)는 식모 성환댁과 서로의 처지를 위로하며 정을 쌓는다. 그리고 이윽고 계란장수의 아이를 임신한 성환댁은 그와 재혼해 옥희네를 떠난다. 어느 날 옥희의 외삼촌이 찾아와 옥희 엄마에게 재가를 권하고, 할머니는 섭섭한 마음에 몸져눕지만 결국 옥희 엄마의 재가를 허락한다. 때마침 한 선생은 옥희를 통해 옥희 엄마에 대한 사랑을 고백하는 편지를 보내지만, 옥희 엄마는 시어머니와 옥희를 걱정해 한 선생의 사랑을 거절한다. 한 선생은 서울에 계신 어머니가 위독하다는 소식에 서울로 떠날 채비를 하고, 그가 떠나는 날 옥희 엄마는 찬장에 남은 달걀을 삶아 옥희를 통해 그에게 건넨다. 그리고 옥희와 함께 뒷동산에 올라 한 선생이 탄 기차가 떠나는 것을 지켜본다.\n\nCasts : Kim Jin-Kyu,Choi Eun-Hee,Han Eun-Jin,Do Keum-Bong,Jeon Young-Seon\n\nSYNOPSIS : Ok-hee lives with her grandmother (Han, Eun-jin), mother (Choi, Eun-hee) and a housekeeper (Do, Geum-bong) in a house known as the \"widow house\". It got its name since all three women in the house are widows. One day, Mr. Han, a friend of Ok-hee's uncle, comes to stay as a boarder and Ok-hee who had never met her father before becomes quite fond of the man. Eventually, Ok-hee's mother and Mr. Han secretly fall in love with one another and Ok-hee becomes a secret messenger between the two. Mr. Han sends a letter through Ok-hee declaring his love for Ok-hee's mother. However, Ok-hee's mother gets concerned about her mother-in-law and her daughter and turns down Mr. Han's love confession. In the end, Mr. Han leaves for Seoul.",
      "addedAt": "2025-12-26T00:24:59.326Z",
      "thumbnail": "https://i.ytimg.com/vi/c_bWx5n0n8Y/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAwsfxoKVy4cADC5t4KeraijmuLbA",
      "duration": 6184,
      "language": "ko",
      "year": 1961,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:24:59.355Z"
}