{
  "imdbId": "youtube-GC1tZmZjByg",
  "title": "Alien parasites infiltrating Earth! The Brain Eaters (1958) Colorized | Sci-Fi Movie | Subtitles",
  "year": 1958,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=GC1tZmZjByg",
      "title": "Alien parasites infiltrating Earth! The Brain Eaters (1958) Colorized | Sci-Fi Movie | Subtitles",
      "description": "A peaceful small town's residents begin to act strangely after a mysterious meteor crash-lands nearby. As it's discovered that parasitic aliens are taking over human bodies by attaching to their brains, a group of determined locals must find a way to stop the mind-controlling invasion before it consumes their entire community.\n\nOriginal title: The Brain Eaters (1958)\n\nBlack & White version:  https://youtu.be/6Sa8o_j4VZg\n\nDirector: Bruno VeSota\nWriter: Gordon Urquhart\nStars: Ed Nelson, Alan Jay Factor, Cornelius Keefe & Leonard Nimoy\nGenres: Cult Classic, Sci-Fi, Horror\nBudget: $30,000 \n\n00:00 Full Movie\n00:20  A living nightmare begins in Riverdale, Illinois when a cone-shaped object is discovered and several citizens are brutally slain.\n10:10  A group of scientists and government officials are investigating an indestructible spaceship and its purpose.\n18:52  A group of people discuss the mysterious death of the Mayor and discover that the parasite on his neck was causing his illness and eventual death.\n26:50  A group of individuals discuss the threat of parasites and plan a search for the other part of a ship.\n35:03  A dying man from a scientific expedition who vanished five years ago reveals that the parasites come from the earth and have survived underground for millions of years.\n46:27  A group of extraterrestrial beings plan to organize humans to aid them in bringing more of their kind to the surface.\n56:46  A plan is devised to use a heavy electrical cable to feed current into a high tension tower, potentially causing a dangerous explosion.\n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.tiktok.com/@cultcinemaclassics\nhttps://www.instagram.com/cultcinemaclassics",
      "id": "GC1tZmZjByg",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:41:06.832Z"
}