{
  "imdbId": "youtube-ZRT3OALoggo",
  "title": "Winter Woman (Gyeo-ul-yeoja)(1977)",
  "year": 1977,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ZRT3OALoggo",
      "id": "ZRT3OALoggo",
      "title": "Winter Woman (Gyeo-ul-yeoja)(1977)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/03153\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/03153\n\n영화글 : https://www.kmdb.or.kr/story/10/5327\n\n감독(Director) : 김호선(Kim Ho-Seon)\n출연 : 장미희(이화),신성일(허민),김추련(우석기),신광일(민요섭),송재호(짱코 형님),박원숙(허민 전처),한상미,이종만,선우용녀(이화 어머니),진봉진,박현철,조인하,양희,최수잔나,유은경(아역),강동주(아역),윤웅길(아역)\n\n줄거리 : 대학에 입학하던 날, 이화(장미희)는 신분을 감추고 자신에게 연애편지를 보내던 부잣집 아들 요섭(신광일)을 만난다. 이화는 요섭을 따라 그의 아버지의 청평 별장으로 간다. 별장에서 요섭이 자신을 안으려고 하자, 이화는 요섭을 뿌리치고 그곳을 나선다. 요섭은 이화가 자신을 무시한 데 비관하여 자살을 하고, 이화는 자신을 필요로 하는 사람을 거부하지 않겠다고 결심한다. 이화는 자신을 따라온 대학신문 기자 우석기(김추련)와 사랑에 빠진다. 학생운동에 가담한 우석기와의 만남 덕에 이화는 사회의식에 눈을 뜨게 된다. 그러나 우석기는 군 제대를 일주일 앞두고 교통사고로 죽는다. 그로부터 몇 년 후, 이화는 고교 은사인 허민(신성일)과 우연히 재회한다. 이화는 이혼 후 고독하고 쓸쓸하게 살아가고 있는 허민을 위로하기 위해 자신의 몸을 내맡긴다. 그러나 허민이 결혼을 요구하자 이를 거절하고, 허민과 그의 전 부인이 재회할 기회를 만들어주고 떠난다.\n\n\nCasts : Jang Mi-Hee, Shin Seong-Il, Kim Chu-Ryeon\n\nSYNOPSIS : High school senior Ie-hwa meets Yo-sub the day she passes the college exam. Yo-sub grew up in a wealthy family. Ie-hwa realizes that Yo-sub needs her. But when Yo-sub tries to hug Ie-hwa as a man at a villa in Chungpyung, she pushes him back and runs away. Crushed by Ie-hwa's rebuff, Yo-sub agonizes and then kills himself. Ie-hwa decides to devote herself completely to those who need her. Then, Ie-hwa meets Wu Suk-gi who is a reporter of the school newspaper. Whenever there is injustice, Suk-gi is the first one to investigate. Ie-hwa and Suk-gi fall in love. However, Suk-gi dies in a car accident while serving his military duty. Ie-hwa meets a high school teacher who is in despair. After bringing stability back to him, Ie-hwa becomes a teacher at a school for the mentally deficient.",
      "addedAt": "2025-12-26T00:24:12.887Z",
      "thumbnail": "https://i.ytimg.com/vi/ZRT3OALoggo/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBa4qheZXv5F89Hsr035eO_PuBLYw",
      "duration": 7218,
      "language": "ko",
      "year": 1977,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:24:12.956Z"
}