{
  "imdbId": "youtube-YXEp0AJYiGA",
  "title": "Daniel Boone (1936 Western) starring John Carradine | Directed by David Howard",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YXEp0AJYiGA",
      "id": "YXEp0AJYiGA",
      "title": "Daniel Boone (1936 Western) starring John Carradine | Directed by David Howard",
      "description": "Daniel Boone, a courageous frontiersman, guides a group of settlers across treacherous terrain to build a new home in uncharted territory. Along the way, they face challenges from rival groups, internal conflicts, and the harsh wilderness. Boone's leadership and determination unite the settlers as they fight to survive and secure their future.\n\nColorized version: https://youtu.be/H3kQhG7Lio0\n\n\nDirector: David Howard\nWriters: Edgecumb Pinchon, Daniel Jarrett\nStars: George O'Brien, Heather Angel, John Carradine\nGenres: Biography, Drama, History, Western\n\n\n00:00 - Full movie with subtitles \n01:05 - Daniel Boone leads settlers on a perilous journey to establish a new home in uncharted territory.\n05:07 - Boone inspires the settlers with a prayer for peace and guidance as they prepare to cross the mountains.\n16:28 - Simon Girty is captured and accused of inciting violence against settlers, sparking tension.\n37:53 - Boone declares the chosen valley as their new home, marking the settlers' triumph over adversity.\n47:02 - A proclamation from Virginia threatens the settlers' land claims, creating a new challenge.\n1:00:21 - The settlers face a massive attack from Native tribes, testing their unity and resilience.\n1:07:13 - Boone rallies the settlers to hold their ground despite dwindling resources and mounting pressure.\n1:09:50 - The settlers achieve victory and secure their new home, celebrating their hard-fought success.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=PL2gsu7VGzgdacCMuo2AaNH1eedVQOAGqm",
      "addedAt": "2025-12-27T00:32:52.358Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/YXEp0AJYiGA/maxresdefault.webp?v=6785d0ce",
      "duration": 4546,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:32:52.477Z"
}