{
  "movieId": "youtube-9aJ5j8HH46w",
  "title": "Sabotage 1936 | Alfred Hitchcock, Sylvia Sidney, Oscar Homolka | Film-Noir | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=9aJ5j8HH46w",
      "id": "9aJ5j8HH46w",
      "title": "Sabotage 1936 | Alfred Hitchcock, Sylvia Sidney, Oscar Homolka | Film-Noir | Full Movie",
      "description": "A London movie theater owner, Karl Verloc, unknowingly becomes involved in a terrorist plot orchestrated by a foreign spy organization. Verloc's wife, his brother-in-law, and the authorities begin to suspect his involvement, the tension mounts, leading to a thrilling climax.\n\nOriginal title: Sabotage (1936) AKA: The Hidden Power / I Married a Murderer\n\nColorized version https://youtu.be/mOcG8ZEfvCE\n\nThi film is available with many subtitle language options.\nDirector: Alfred Hitchcock\nWriters: Joseph Conrad, Charles Bennett, Ian Hay\nStars: Sylvia Sidney, Oscar Homolka, Desmond Tester\nGenres: Crime, Thriller\n\n\n00:00 Full Movie\n01:50 A chaotic situation unfolds at a theater when the lights fail, and the audience demands their money back.\n08:34 A chaotic and comedic series of events unfold in a household, involving mistaken identities, misunderstandings, and a desire for peace and quiet.\n14:52 A dramatic and comedic exchange between characters in various situations.\n21:35 A mysterious and intriguing conversation unfolds in a restaurant, revealing secrets and suspicions.\n31:54 A mysterious encounter at Mr. Verloc's place leads to suspicions and plans to evade a detective from Scotland Yard.\n39:48 A mysterious conversation about a possible sabotage and a surprise gift for Stevie.\n46:27 A man seeks help from Mr. Verloc to gather information, while a salesman demonstrates a toothpaste product in a comedic manner.\n49:21 A chaotic series of events unfolds involving a bomb, a film tin, and a mysterious man named Verloc.\n1:01:10 A dramatic story unfolds involving a murder, a confession, and a desperate attempt to escape the consequences.\n1:12:23 A bomb explosion at a cinema leads to chaos and tragedy, with Mrs. Verloc's involvement in question.\n\n\n@CultCinemaClassics:\nhttps://www.facebook.com/CultCinemaClassics \nhttps://www.tiktok.com/@cultcinemaclassics\nhttps://www.instagram.com/cultcinemaclassics",
      "addedAt": "2025-12-27T00:40:14.436Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/9aJ5j8HH46w/maxresdefault.webp?v=6576c54b",
      "duration": 4602,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [
    {
      "id": "alfred-hitchcock",
      "name": "Alfred Hitchcock"
    }
  ],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:40:14.627Z"
}