{
  "imdbId": "youtube-Vy_wU6xh-2k",
  "title": "The Devil's Hand (Horror, 1961) Linda Christian, Robert Alda | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Vy_wU6xh-2k",
      "title": "The Devil's Hand (Horror, 1961) Linda Christian, Robert Alda | Full Movie",
      "description": "Still alive...the ancient cult of voodoo!\nHaunted by recurring dreams of a mesmerizing woman dancing in the sky,  Rick's mysterious visions take a startling turn when he discovers a doll that uncannily resembles his fiancee. As he becomes increasingly entangled in a web of seduction and manipulation, he is lured into a sinister sect that worships the diabolic Camba.\n\nAlso available colorized: https://youtu.be/yRCQoHwbNWY\n\n\nOriginal title: The Devil's Hand (1961) AKA: Devil's Doll / Witchcraft\n\nThis film is subtitled in many languages.\n\nDirector: William J. Hole Jr.\nWriter: Jo Heims \nStars: Linda Christian, Robert Alda, Ariadne Welter \nGenres: Classics, Cult Film, Horror\n\n\n00:00 Full Movie (with subtitles)\n01:27 A man encounters a mysterious doll resembling a woman from his dreams, leading to confusion and intrigue.\n10:05 Mysterious events unfold around a doll shop owner and a woman, leading to a dangerous quest for answers.\n16:46 A woman with supernatural powers lures a man into a cult that worships a devil god and involves human sacrifice.\n27:48 A cult worships a devil god, offering sacrifices for judgment and loyalty tests among members.\n39:27 A woman faces loyalty dilemmas in a mysterious cult, leading to unexpected events and a sudden change in health.\n51:21 A mysterious betrayal leads to a deadly confrontation and a plea for separation.\n1:05:00 A group worships a devil god and sacrifices a young girl to test loyalty, leading to a twist.\n\n\n@CultCinemaClassics \n\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "Vy_wU6xh-2k",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:37:34.837Z"
}