{
  "imdbId": "youtube-CfgvbK5x8J8",
  "title": "The Villain Still Pursued Her (1940, Comedy) Hugh Herbert, Anita Louise, Buster Keaton | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=CfgvbK5x8J8",
      "title": "The Villain Still Pursued Her (1940, Comedy) Hugh Herbert, Anita Louise, Buster Keaton | Movie",
      "description": "Good to the last drop... of the villain... the girl... or maybe the scenery!\nFollowing Mr. Middleton's demise, widow Wilson and Mary are confronted by Middleton's lawyer, Cribbs, who falsely implicates Edward in their impending eviction. Mary's appeal to Edward exposes Cribbs' deceit, but as Mary and Edward's engagement promises hope, Cribbs orchestrates a sinister plot to derail their happiness by leading Edward astray.\n\nColorized version: https://youtu.be/kXLe11zlukw\n\nOriginal title: The Villain Still Pursued Her (1940)\nThis film is available with many subtitle languages.\n\n\nDirector: Edward F. Cline\nWriters: Elbert Franklin, Ethel La Blanche\nStars: Hugh Herbert, Anita Louise, Alan Mowbray & Buster Keaton\nGenres: Classics, Comedy\n\n\n00:00 Full Movie (With subtitles)\n04:36 A family faces financial hardship and seeks help from a young man, leading to fear and uncertainty.\n09:41 A young man faces temptation and stands up for a defenseless girl against a villain's schemes.\n15:08 Getting married amidst family drama and a longstanding tradition of toasting.\n23:17 A man's struggle with alcoholism and its consequences on his relationships and reputation.\n31:10 A tale of misery, alcoholism, and family struggles unfolds in a dramatic scene.\n42:49 A woman in dire circumstances refuses to resort to crime despite temptation and criticism.\n53:08 Dramatic comedy unfolds as a man tries to help an unhappy vagabond in dire circumstances.\n53:54 A tale of deception, forgery, and redemption unfolds as characters navigate a web of deceit and betrayal.\n1:04:19 A villain confesses to forgery and deception, leading to a chase for a stolen will.\n\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "CfgvbK5x8J8",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [
    {
      "id": "buster-keaton",
      "name": "Buster Keaton"
    }
  ],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:06.274Z"
}