{
  "imdbId": "youtube-xmxYZ9rylhU",
  "title": "Yang san Province (Yangsando)(1955)",
  "year": 1955,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=xmxYZ9rylhU",
      "id": "xmxYZ9rylhU",
      "title": "Yang san Province (Yangsando)(1955)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00279\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00279\n\n감독(Director) : 김기영(Kim Ki-Young)\n출연 : 김삼화(옥랑),조용수(수동),김승호(옥랑 아버지),박암(무령),고선애(수동 어머니),고설봉,이기홍,고일연,최룡,이영옥\n\n줄거리 : 수동(조용수)과 옥랑(김삼화)은 태중 혼약한 사이이다. 한양서 돌아온 김 진사의 자제 무령(박암)은 옥랑에게 탐심을 품고, 내심 수동을 못마땅해 하던 옥랑의 어머니는 이를 이용하여 김 진사의 부인과 혼인약속을 한다. 수동의 어머니(고선애)와 옥랑의 아버지(김승호)는 옥랑과 수동으로 하여금 들판에서 몰래 혼인식을 치르게 하고, 옥랑과 수동은 마을을 떠나 도망친다. 하지만 그들은 첫날밤을 지낸 후 그들을 쫓아온 김진사의 하인들에게 붙잡히고, 수동은 그 과정에서 낭떠러지에서 떨어진다. 붙잡혀 오는 옥랑을 발견한 옥랑 부친은 김 진사의 하인 한명을 실수로 죽이고, 옥랑과 옥랑의 아버지는 옥에 갇힌다. 무령은 살인죄를 덮어주는 대가로 옥랑과의 혼인을 요구하고, 옥랑은 결국 혼인을 허락한다. 무령은 옥에서 나온 옥랑을 집까지 바래다준다. 쫓아온 수동은 무령을 죽이려 하나, 옥랑이 그와 혼인하겠다고 하자 실의에 빠져 집으로 돌아와 목을 매 자살한다. 수동의 어머니와 외삼촌은 수동의 시체를 옥랑의 혼인행차 길에 묻는다. 혼인에 나선 옥랑의 행차가 무덤 옆을 지날 때 일행의 발이 땅에 붙어버리고, 수동의 어머니는 행차를 막고 가마 밖을 나온 옥랑을 찌른다. 옥랑은 수동의 무덤까지 기어가 그의 무덤가에서 죽는다.\n\nCasts : Kim Sam-Hwa, Kim Seung-Ho,Park Am, Cho Yong-Su, Ko Seon-Ae, Ko Seol-Bong\n\nSYNOPSIS : Su-dong (Jo Yong-su) and Ok-rang (Kim Sam-hwa) are engaged. Mu-ryeong (Park Am), a son of Kim, a high government official, has a crush on Ok-rang. He has just come from Hanyang, the former capital city of Korea. Ok-rang's mother, who does not like Su-dong, takes advantage of this opportunity, and with Mu-ryeong's mother, decides on her daughter's marriage with Mu-ryeong. Su-dong's mother (Go Seon-ae) and Ok-rang's father (Kim Seung-ho) let their children secretly get married on an open field, and the newly weds escape to their village. After their honeymoon, they end up being caught by Kim's servants and Su-dong by accident falls over a brink. Ok-rang's father, who discovers that his daughter had been caught by Kim's servants, kills one of the servants and Ok-rang and her father are imprisoned. Mu-ryeong asks for a marriage with Ok-rang in return for covering up the homicide. Ok-rang at last accepts it. Mu-ryeong takes her home when she is discharged from prison. Su-dong, who chased after them, tries to kill Mu-ryeong. But when Ok-rang says she wants to marry Mu-ryeong, he becomes hopeless, and kills himself at home. Su-dong's mother and uncle bury him next to the road where Ok-rang's marriage coach passes by. As the coach passes the grave, all the people's their feet become stuck in the ground. Su-dong's mother stops the coach, and stabs Ok-rang. Ok-rang crawls to Su-dong's grave and dies there.",
      "addedAt": "2025-12-26T00:25:20.428Z",
      "thumbnail": "https://i.ytimg.com/vi/xmxYZ9rylhU/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAnqz1gnuuVz2RxyJXFa4r0mYSCOw",
      "duration": 5402,
      "language": "ko",
      "year": 1955,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:25:20.467Z"
}