{
  "imdbId": "youtube-q0dcplF29Qc",
  "title": "The Brain That Wouldn't Die (1962 Horror) Directed by Joseph Green",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=q0dcplF29Qc",
      "id": "q0dcplF29Qc",
      "title": "The Brain That Wouldn't Die (1962 Horror) Directed by Joseph Green",
      "description": "It was the strangest experiment ever conceived... and it didn't go as planned!\nAfter a car crash decapitates his fiancée, an obsessed surgeon keeps her head alive in a laboratory, while seeking a new body for her, leading to gruesome consequences when she gains psychic abilities and rebels against him.\n\nColorized version: https://youtu.be/ApU1VSX7U30\n\nOriginal title: The Brain That Wouldn't Die (1962)\nSubtitles are available.\n\n\nDirector: Joseph Green \nWriters: Joseph Green, Rex Carlton\nStars: Jason Evers, Virginia Leith, Anthony La Penna \nGenre: Classics, Cult Film, Crime, Horror, Sci-Fi, Mystery, Thriller\nBudget: $300,000 \n\n00:00 Full Movie\n00:05 Dr. Desperate Plea -A distraught Dr. Cortner begs for permission to experiment on a deceased patient.\n02:40 A Risky Experiment - Dr. Cortner defies medical norms, shocking the corpse back to life.\n05:24 A Controversial Breakthrough - Dr. Cortner's unorthodox methods yield unexpected results, sparking ethical debate.\n08:04 A Visionary Goal - Dr. Cortner dreams of revolutionizing medicine through radical transplantation.\n10:16 A Dark Secret - Dr. Cortner's obsession with his research leads to a sinister secret.\n11:59 A Disturbing Discovery - A mysterious phone call sends Dr. Cortner to his secluded country house.\n17:24 A Horrific Accident - A tragic accident forces Dr. Cortner to make a horrifying decision.\n20:05 A Monstrous Creation - Dr. Cortner's experiments birth a grotesque and terrifying creature.\n29:43 A Desperate Search - Dr. Cortner seeks a suitable body for his monstrous creation.\n36:34 A Twisted Alliance -  The creature and Dr. Cortner's assistant, Jan, form an unholy alliance.\n41:00 The Ultimate Horror - The true extent of Dr. Cortner's madness is revealed.\n56:19 A Desperate Gamble - Dr. Cortner targets a beautiful woman, Doris, for his sinister plan.\n1:01:32 A Dangerous Encounter -  Dr. Cortner's obsession leads to a fateful encounter with Doris.\n1:14:47 A Deadly Deception - Dr. Cortner drugs Doris, preparing her for a horrifying fate.\n1:17:25 A Final Confrontation - A climactic showdown between Dr. Cortner, the creature, and Doris.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:34:18.537Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/q0dcplF29Qc/maxresdefault.webp?v=67285cc5",
      "duration": 4954,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:34:18.684Z"
}