{
  "movieId": "youtube-CbY1a7DVXj8",
  "title": "Beside Murder 1955 (Crime, Drama) French Film by Willy Rozier | with Tony Wright | Colorized",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=CbY1a7DVXj8",
      "id": "CbY1a7DVXj8",
      "title": "Beside Murder 1955 (Crime, Drama) French Film by Willy Rozier | with Tony Wright | Colorized",
      "description": "Insurance premium: a hundred million Francs.\nThe sinking of the ship La Circé raises suspicions of possible criminal activity. The vessel is owned by Storata, who seeks a hundred million Francs from the insurance company. Callaghan is appointed to investigate the incident both on land and at sea. Through his astute detective work, Callaghan uncovers evidence suggesting that Storata deliberately sank his own ship to commit insurance fraud.\n\nOriginal title: À toi de jouer... Callaghan!!! (1955) AKA: Amazing Mr. Callaghan / Beside Murder \n\n\nBlack & White version: https://youtu.be/_8c_H_lUMxo\n\nThis film is available in french, and subtitled in many language options. \n\nDirector: Willy Rozier\nWriters: Willy Rozier, Peter Cheyney\nActors: Antony Wright, Lysiane Rey, Raymond Cordy, Paul Cambo\nGenres: Colorized, French Cinema, Crime, Drama, Thriller\n\n\n00:00 Full Movie (with subtitles) \n02:07 Mystery unfolds as a multilingual man, Slim Callaghan, arrives in France and gets involved in a complex web of characters and events.\n11:07 High-stakes poker game involving Mr. Morrison and Viscount Raoul at a luxurious casino.\n17:53 Undercover detective investigates mysterious activities involving a colonel, gambling den, and a potential fraud scheme.\n26:33 Mysterious murder investigation unfolds after a boat sinking, involving betrayal and deception.\n36:07 Mystery unfolds as characters navigate through a web of deceit, betrayal, and financial stakes.\n44:47 Investigation into criminal activities involving Storata, Barton, and a mysterious mistress unfolds.\n51:18 Mysterious murder investigation involving a private detective, a gang leader, and a femme fatale.\n58:03 A mysterious plot unfolds involving hidden identities, stolen money, and a planned escape to Tangier.\n1:16:40 Revealing the mastermind behind a murder plot through investigation and deception.\n\n\n@CultCinemaClassics\n\nNEXT film in the Callaghan series:  Plus de whisky pour Callaghan! / No more whiskey for Callaghan! https://youtu.be/ue-2Ov360bI",
      "addedAt": "2025-12-27T00:36:26.784Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/CbY1a7DVXj8/maxresdefault.webp",
      "duration": 5022,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:26.891Z"
}