{
  "imdbId": "youtube-1VVJTeEu_QE",
  "title": "Heretics (HORROR THRILLER | Unzensiert exklusiv für Netzkino-Members)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1VVJTeEu_QE",
      "title": "Heretics (HORROR THRILLER | Unzensiert exklusiv für Netzkino-Members)",
      "description": "HERETICS (2017)\nOriginaltitel: The Heretics\nMit: Nina Kiri, Ryan Barrett, Jorja Cadence, Will King, Nina Richmond\nRegie: Chad Archibald\nFSK: Freigegeben ab 18 Jahren\n\nINHALTSANGABE:\nDie junge Gloria wurde vor einigen Jahren von einem satanischen Kult entführt, dessen Mitglieder sich in einem bizarren, blutigen Ritual das Leben nahmen. Gloria überlebte, ist seitdem jedoch traumatisiert. Der Schrecken beginnt erneut, als sie eines Nachts von einem überlebenden Mitglied des Kultes wieder entführt und in eine Waldhütte gebracht wird. Gloria scheint nämlich seit Jahren ein dämonisches Wesen in sich tragen ...\nTHE HERETICS ist Horror, wie man ihn sich besser nicht wünschen kann: Erschreckend, unheimlich und intensiv. Ein Film, der den Zuschauer mit seiner düsteren Atmosphäre sofort in den Bann zieht und bis zuletzt nicht mehr loslässt. Regisseur Chad Archibald hat bereits mit \"BITE\" bewiesen, dass er weiß, wie ein guter Body Horrorfilm sein muss. Mit THE HERETICS liefert er nun einen Film mit stimmungsvollen Bildern, die dem Publikum Schauer über den Rücken jagen, einem brillanten Twist und Effekten, die definitiv nichts für schwache Mägen sind!\n#Netzkino #ganzerFilm #Horrorthriller\n\nCOPYRIGHT:\nSpotfilm Networx GmbH is a serious and legal video on demand company located in Berlin, Germany. We are holding a proper license for all of our published movies. For any questions contact copyright@spotfilm-networx.com",
      "id": "1VVJTeEu_QE",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T00:01:47.532Z"
}