{
  "imdbId": "youtube-V3v7oqdPIt0",
  "title": "Help, I've inherited Christmas! 🎄 (Great HALLMARK Christmas movie in German, romantic comedy)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=V3v7oqdPIt0",
      "title": "Help, I've inherited Christmas! 🎄 (Great HALLMARK Christmas movie in German, romantic comedy)",
      "description": "💙 Filme in voller Länge auf Deutsch anschauen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n🎄 Jules erbt Christmas Land, doch der Käufer will den geliebten Freizeitpark zerstören. Gemeinsam mit dem charmanten Anwalt Tucker Barnes kämpft sie darum, den Park zu retten.\n\nHILFE, ICH HABE WEIHNACHTEN GEERBT (2015)\nOriginaltitel: Christmas Land \nMit: Nikki Deloach, Luke MacFarlane, Maureen McCormick\nRegie: Sam Irvin\nFSK: Freigegeben ab 6 Jahren\n\nINHALTSANGABE:\nDie New Yorker Geschäftsfrau Jules Cooper (Nikki DeLoach) erfährt überraschend, dass sie die Alleinerbin des Besitzes ihrer kürzlich verstorbenen Großmutter Glinda (Maureen McCormick) ist. Jules besucht das Anwesen, zu dem auch ein kleiner Freizeitpark namens Christmas Land gehört, in dem sie als Kind viele glückliche Stunden verbracht hat. Außerdem zählen noch ein dreistöckiges Haus und eine Weihnachtsbaumplantage dazu. Jules will alles verkaufen. Allerdings nur unter einer Bedingung: Der neue Eigentümer muss Christmas Land weiterführen, da es für die örtliche Gemeinde von Bedeutung ist. Jules glaubt, dass ihr Freund Mitchell (Jason-Shane Scott) in Mason Richards (Richard Karn) einen solchen Käufer gefunden hat, und unterzeichnet den Vertrag. Wenig später erfährt sie allerdings von Richards Plan, Christmas Land abzureißen und das Anwesen in kleinere Parzellen unterteilt weiterzuverscherbeln. Jules ist entsetzt und wendet sich an den unverschämt gutaussehenden lokalen Anwalt Tucker Barnes (Luke Macfarlane), in der Hoffnung, dass er ihr hilft, Christmas Land zu retten.\n#Netzkino #ganzerFilm #Hallmark\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "V3v7oqdPIt0",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.123Z"
}