{
  "imdbId": "youtube-v9uZ4oW5bTs",
  "title": "Firehouse (Action, 1973) Richard Roundtree, Sheila Frazier | Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=v9uZ4oW5bTs",
      "id": "v9uZ4oW5bTs",
      "title": "Firehouse (Action, 1973) Richard Roundtree, Sheila Frazier | Full Movie",
      "description": "When the fire's out...the heat is on!\nTensions arise when a previously all-white firehouse gets a new rookie, and it's first African American team member.  He must face with both physical tests and the racism of his peers as he works to become a fully fledged fire fighter. \n\nOriginal title: Firehouse (1973) \nThis film is subtitled in many languages.\n\nDirector: Alex March\nWriter: Frank Cucci\nStars: Richard Roundtree, Sheila Frazier, Michael Lerner, Paul Le Mat, Val Avery\nGenres: Action, Drama\n\n\n00:00 Full Movie (with subtitles)\n03:49 Intense moments unfold as a team faces challenges in a firefighting operation.\n11:43 A glimpse into the daily lives and challenges of firefighters, emphasizing teamwork and personal struggles.\n18:31 In a firehouse, tensions rise as new recruits clash with existing members over a stolen camera.\n24:58 Discussion about a break-in at a fire station, racial tensions, and a missing electric shaver.\n30:49 Intense drama unfolds as characters discuss leaving the firehouse and a mysterious incident involving gasoline.\n39:08 Investigation into a missing child leads to a firefighter being tested for loyalty and honesty.\n45:25 A glimpse into the daily life of firefighters at a firehouse, featuring personal anecdotes and interactions.\n52:11 Firefighter faces challenges and reflects on the changing nature of their profession.\n1:01:02 Intense firefighting situation unfolds in a burning building, with conflicting interests and heroic actions.\n\n\n@CultCinemaClassics\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:38:18.768Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/v9uZ4oW5bTs/maxresdefault.webp?v=65e95666",
      "duration": 4426,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:38:18.940Z"
}