{
  "movieId": "youtube-2GuOUOnmsns",
  "title": "Colorized Movie | The Pirates of Capri (1949) Edgar Ulmer | Action, Adventure | Subtitles",
  "year": 1949,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=2GuOUOnmsns",
      "id": "2GuOUOnmsns",
      "title": "Colorized Movie | The Pirates of Capri (1949) Edgar Ulmer | Action, Adventure | Subtitles",
      "description": "Who is Captain Sirocco?\nCount Amalfi, a nobleman turned swashbuckling pirate leader known as Captain Sirocco, orchestrates a daring rebellion against the oppressive aristocracy ruling Naples in 1799. As he navigates political intrigue and romance, he aims to restore freedom to the people, all while concealing his dual identity from his unsuspecting fiancée.\n\nOriginal title: I pirati di Capri (1949) AKA: The Pirates of Capri \n\nBlack & White version: https://youtu.be/A1dDvXlqcME\n\n\nThis film is subtitled with many language options.\n\nDirector: Edgar G. Ulmer\nWriters: Giorgio Moser, Golfiero Colonna, Sidney Alexander\nActors:  Louis Hayward, Binnie Barnes, Alan Curtis, Massimo Serato\nGenres: Adventure, Action, Drama\n\n\n00:00 Full Movie\n01:55  The video is about a group of people on a ship who are planning to steal arms and kidnap a woman to force her into marriage.\n13:45  A captain confronts a crew member about a stolen item and the crew member reveals a dark secret.\n21:28  Queen Maria Antoinette discusses the Sirocco raid and her concern for personal safety with Count Amalfi and Baron Holstein.\n27:09  Amalfi and his friend discuss their mission to save the queen and the risks they must take.\n35:46  Discussing a plan to attack Holstein's headquarters and the palace, while also addressing loyalty and the Queen's safety.\n43:37  Punishment and the Count of Amalfi leads to a revelation about an armed uprising.\n52:25  The count is asked to intercede on behalf of the notorious mask, Sirocco, who is set to be hanged.\n1:01:44  A ballet performance takes place during a conversation about hanging Sirocco, but the Count promises to free him.\n1:12:22  Amalfi and the Baron discuss his performance, but their conversation is interrupted by news of Sirocco's escape and an impending uprising.\n1:20:01  The city is under martial law and the Queen plans to flee due to the impending revolution.\n1:26:15  Queen Maria Carolina learns of the lies and betrayal surrounding her, leading to a dramatic escape from the palace.\n\n\n @CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:41:23.146Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/2GuOUOnmsns/maxresdefault.webp?v=6523528e",
      "duration": 5700,
      "language": "en",
      "year": 1949,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:41:23.234Z"
}