{
  "imdbId": "youtube-ovXE-vdSAL4",
  "title": "Vincent Price | The Last Man on Earth (1964) Horror Movie directed by Ubaldo Ragona | Colorized",
  "year": 1964,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ovXE-vdSAL4",
      "id": "ovXE-vdSAL4",
      "title": "Vincent Price | The Last Man on Earth (1964) Horror Movie directed by Ubaldo Ragona | Colorized",
      "description": "Alive among the lifeless... alone among the crawling creatures of evil that make the night hideous with their inhuman craving!\nIt is three years since a plague either killed everyone on earth or turned them into zombies. Dr. Robert Morgan is the sole survivor and lives a perilous existence where at night the zombies attack his house and during the day he seeks out zombies and kills them. The monotony and isolation of his existence is getting to him - is there any point to all this?\n\nOriginal title: The Last Man on Earth (1964)\n\nThis film is available with English, French, Italian & Spanish audio, and is also subtitled in many languages. \n\nBlack & White version: https://youtu.be/Vv2WUewBx8U\n\n\nDirectors: Ubaldo Ragona, Sidney Salkow\nWriters: Richard Matheson, William F. Leicester\nStars: Vincent Price, Franca Bettoia, Emma Danieli\nGenre: Drama, Horror, Science Fiction & Fantasy\nBudget: $300,000\n\n\n00:00 Full Movie (with dubbed audio options & subtitles)\n01:45 A man navigates a post-apocalyptic world, battling creatures and loneliness.\n29:35 Scientists struggle to find a solution to a global disease outbreak caused by an unknown airborne germ.\n36:08 A debate arises on the existence of vampires amidst a national disaster caused by a contagion outbreak.\n43:51 Survivor searches for others in post-apocalyptic world with mysterious evolutionary process.\n57:14 Survivor encounters infected individuals and struggles to trust in post-apocalyptic world.\n1:08:51 A survivor of a vampire apocalypse is confronted by a group planning to reorganize society.\n1:15:49 A man discovers a way to save humanity from a deadly virus, but faces fear and violence from survivors.\n\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:36:12.802Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/ovXE-vdSAL4/maxresdefault.webp",
      "duration": 5206,
      "language": "en",
      "year": 1964,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:12.939Z"
}