{
  "imdbId": "youtube-fhdPo-4gLhs",
  "title": "Paid to Kill 1954 | starring Dane Clark & Cecile Chevreau (Film-Noir, Crime) Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=fhdPo-4gLhs",
      "id": "fhdPo-4gLhs",
      "title": "Paid to Kill 1954 | starring Dane Clark & Cecile Chevreau (Film-Noir, Crime) Full Movie",
      "description": "He loved his wife to death!\nLondon businessman, James Nevill, is betrayed by his uncle Cyrus McGowan in risky business that will bankrupt his company. He decides to force his former friend Paul Kirby to kill him so that his so dearly loved wife, Andrea, receives a life insurance policy to have a good life after his passing.\n\nColorized version: https://youtu.be/r8X5APKkMW8\n\n\nOriginal title: Five Days (1954) AKA: Paid to Kill \nThis film is subtitled in many languages.\n\nDirector: Montgomery Tully\nWriter: Paul Tabori\nStars: Dane Clark, Cecile Chevreau, Paul Carpenter\nGenres: British Cinema, Crime, Drama, Film-noir, Mystery, Thriller\n\n\n00:00 Full Movie (with subitles)\n01:42 An intense conversation between Cyrus and Jim Nevill regarding a business deal and a pending decision.\n06:09 Secrets, relationships, and business struggles unfold during a party invitation and unexpected visit.\n10:42 A mysterious conversation between two individuals involving past debts and a dangerous deal.\n15:54 A man is coerced into a criminal scheme involving deceit, manipulation, and a plan to fake his death.\n20:58 A man receives incriminating letters from a deceased woman, leading to a tense confrontation and a plot for revenge.\n27:10 Discussion and negotiation at a corporate event involving a young chairman, with a focus on a new business partnership.\n31:05 A series of business discussions and plans unfold between characters in various locations.\n38:41 Betrayal and urgency escalate as secrets are revealed during a late-night confrontation.\n42:43 Mystery unfolds as characters search for Paul Kirby, facing deception and danger.\n48:40 Investigation of a mysterious threat leads to a tense confrontation with suspects.\n56:35 A secretary is questioned about a client's whereabouts and suspected wrongdoings.\n58:48 A suspenseful plot unfolds as Jim and Andrea unravel a mystery involving deceit and murder.\n1:05:15 Tragic love triangle leads to a deadly confrontation between Jim, Andrea, and Peter.\n\n\n@CultCinemaClassics\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:38:00.784Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/fhdPo-4gLhs/maxresdefault.webp?v=65fa350a",
      "duration": 4232,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "allowed": [
          "CA",
          "US"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:38:00.914Z"
}