{
  "imdbId": "youtube-0ZLkTZ3VNIE",
  "title": "Nova Zembla - Unknown Land (ADVENTURE full movie in German, historical films free)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=0ZLkTZ3VNIE",
      "title": "Nova Zembla - Unknown Land (ADVENTURE full movie in German, historical films free)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Der Film erzählt eindrucksvoll die wahre Geschichte von Gerrit de Veer, der mit einer Gruppe Abenteurer eine neue Schiffsroute nach China finden wollte – und stattdessen in der eisigen Wildnis ums nackte Überleben kämpfen musste...\n\nNOVA ZEMBLA - UNBEKANNTES LAND (2011)\nOriginaltitel: Nova Zembla\nMit: Robert de Hoog, Victor Reinier, Jan Decleir\nRegie: Reinout Oerlemans\nFSK: Freigegeben ab 12 Jahren\n\nINHALTSANGABE:\nAmsterdam, 1596: Während Holland unter der spanischen Seeblockade leidet, bricht eine gefährliche Schiffsexpedition unter dem Kommando von Willem Barents und Kapitän Jacob von Heemskerk auf, um eine neue Seeroute nach China zu finden.\nMit an Bord ist der junge Gerrit de Veer, der in die Tochter des berühmten Astronoms Petrus Plancius verliebt ist. Gerrit will sich auf der Expedition beweisen, um Catherina endlich heiraten zu dürfen. Die Bedingungen auf dem Schiff sind schwierig für Gerrit, der Ton innerhalb der Crew ist rau. Auf ihrem Weg durch das Polarmeer versuchen Barents und Heemskerk die Insel Nova Zembla nördlich zu umfahren, doch dann bleibt das Schiff im Eis stecken. Die Crew muss fortan im arktischen Winter um ihr Überleben kämpfen...\n#Netzkino #ganzerFilm #Abenteuer\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "0ZLkTZ3VNIE",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.127Z"
}