{
  "imdbId": "youtube-l_wk74NbZVA",
  "title": "Western | Salome, Where She Danced (1945) Yvonne De Carlo, Rod Cameron, David Bruce | Subtitled",
  "year": 1945,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=l_wk74NbZVA",
      "title": "Western | Salome, Where She Danced (1945) Yvonne De Carlo, Rod Cameron, David Bruce | Subtitled",
      "description": "She made guns grow cold...and hearts Burn Hot - as she set the West afire!\nDuring the Austrian-Prussian war, Anna Marie is a dancer who is forced to flee her country after she is accused of being a spy. She ends up in a lawless western town in Arizona, where she proceeds to vamp numerous men in order to get what she wants.\n\nOriginal title: Salome, Where She Danced (1945)\n\nDirector: Charles Lamont\nWriters: Laurence Stallings, Michael J. Phillips\nStars: Yvonne De Carlo, Rod Cameron, David Bruce \nGenres: Adventure, Drama, Music, Romance, War, Western\n\nDubbed Italian & Spanish audio also available 👉 select your audio /subtitle languages in settings  ⚙️ \n\n00:00 Full Movie \n01:56  War correspondent Jim Steed reflects on the end of the Civil War and his desire to continue reporting.\n11:01  A journalist is recruited to gather information on Count von Bismarck's intentions during a delicate mission.\n18:02  A story of love, war, and espionage unfolds as characters navigate the impending conflict between Prussia and Austria.\n28:23  A group of performers in the American desert face challenges from bandits but manage to put on a successful show, including a captivating dance by Salome.\n43:54  A Viennese dancer causes a war between Prussia and Austria.\n52:55  A theater owner tries to convince a performer to leave and start a new life, but faces opposition from a colonel.\n1:02:34  Dr. Ling and his colleagues plan to get rid of Major Steed, but it leads to a trap and a difficult decision for Dr. Ling.\n1:12:38  A stagecoach journey becomes a nostalgic experience for the narrator, who reflects on the beauty of youth and the allure of the great outdoors.\n1:22:52  A dramatic scene unfolds as Salome decides to leave and search for Cleve, but Max convinces her to stay and perform.\n\n\n@CultCinemaClassics",
      "id": "l_wk74NbZVA",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:42:04.476Z"
}