{
  "imdbId": "youtube-l2dxQ7lFpwA",
  "title": "Her Student Wants Her To Himself | The Wrong Teacher | HD Crime Thriller",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=l2dxQ7lFpwA",
      "title": "Her Student Wants Her To Himself | The Wrong Teacher | HD Crime Thriller",
      "description": "Her Student Wants Her To Himself | The Wrong Teacher | HD Crime Thriller - Successful teacher and author Charlotte Hansen has a passionate, one-night stand with a younger man, Chris. She later finds out that he is 18 years old and a student at her high school. Now, Chris will stop at nothing to have her for himself.\n\nWatch The Wrong Teacher, a gripping psychological thriller that turns a single mistake into a dangerous obsession. Successful teacher and author Charlotte Hansen believes her one night stand with a younger man named Chris is behind her, until she discovers he is only eighteen and a student at her high school. What begins as shock and regret quickly spirals into fear as Chris becomes determined to have her at any cost. Perfect for fans of suspense thrillers, obsession driven dramas, full free thriller movies, intense psychological films, and high stakes character stories, The Wrong Teacher delivers escalating tension, dark twists, and a chilling look at how quickly control can turn into terror.\n\r\nStars: Vivica A. Fox, Jessica Morris, Eric Roberts\n*Licensed from Tesera. All rights reserved*\n\nAll of the content on this channel is UNDER LEGAL LICENSE (We have written contracts) from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - rights@vamedianetwork.com\r\nMovie Central is owned and operated by VA Media Ltd. All rights reserved.\r\n\r\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "id": "l2dxQ7lFpwA",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "US"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T23:59:27.523Z"
}