{
  "imdbId": "youtube-aWn4NHH3Wn0",
  "title": "Renfew of the Royal Mounted | Fighting Mad 1939 (Action, Adventure) Colorized Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=aWn4NHH3Wn0",
      "title": "Renfew of the Royal Mounted | Fighting Mad 1939 (Action, Adventure) Colorized Movie",
      "description": "RENFREW SAVES A LADY! The pride of the Mounties races to the rescue of a girl in distress!\nAnn Fenwick witnesses a US bank robbery, gets kidnapped by the bandits, and is rescued by Renfrew of the Canadian Mounties and Kelly before being recaptured by the gang.\n\nBlack & White version: https://youtu.be/_HbTrvuN2l0\n\n\nOriginal title: Fighting Mad (1939) \nThis film is available with subtitles in many language options.\n\nDirector: Sam Newfield\nWriters: George Rosener  John Rathmell \nStars: James Newill, Sally Blane, Benny Rubin \nGenres: Colorized classics, Action, Adventure, Drama, Music\n\n\n00:00 Full Movie\n00:58 A group of individuals on a journey to Canada encounter a series of unexpected events and challenges.\n15:09 A summary of a 1939 action-adventure movie involving a car accident, theft, and a mysterious encounter.\n16:56 A series of events unfold as characters encounter a wanted criminal and attempt to recover stolen property.\n23:24 An undercover Mountie investigates a mysterious disappearance and encounters suspicious characters at a lodge.\n27:59 A constable seeks help to track down a girl and money, encountering various characters along the way.\n32:54 A young woman runs away and meets a police officer in the forest, seeking help to avoid an arranged marriage. The officer offers assistance and congratulates a colleague on a job well done.\n36:43 Undercover officer Renfrew investigates a young woman linked to a bank robbery, only to discover her innocence and her father's involvement.\n43:17 A tense exchange unfolds as characters search for hidden money, facing threats and deception.\n48:15 A summary of a scene from the movie 'Fighting Mad' involving a confrontation and exchange of money at a transaction station.\n\n\n@CultCinemaClassics .\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "aWn4NHH3Wn0",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:38:57.477Z"
}