{
  "movieId": "youtube-6vjJa57eat0",
  "title": "Battalion No. 1 (WAR FILM in German, war drama based on true events, World War II)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=6vjJa57eat0",
      "id": "6vjJa57eat0",
      "title": "Battalion No. 1 (WAR FILM in German, war drama based on true events, World War II)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Im russischen Kriegsfilm Batallion Nº. 1 soll eine Truppe russischer Soldaten im Zweiten Weltkrieg eine kleine Brücke sichern, an der sie jedoch unerwartete Gäste vorfinden.\n\nBATAILLON Nº 1 (2015)\nOriginaltitel: Единичка \nMit: Valeriya Dmitrieva, Stanislav Callas, Ilya Korobko\nRegie: Kirill Belevich\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nIm Spätsommer 1944 marschieren die russischen Truppen bereits unaufhaltsam Richtung Westen, als die neu zusammengestellte Einheit des frischgebackenen Leutnant Egorow auf eine scheinbare Routinemission geschickt wird: Fernab des eigentlichen Kampfgebiets sollen sie eine kleine Brücke sichern, um den notwendigen Nachschub an der Front zu gewährleisten. Was zuerst nach einer einfachen Aufgabe klingt, wird für die Soldaten ein wahrer Höllenritt, als die Einheit bei ihrer Ankunft nicht nur auf deutsche Bataillons trifft, sondern in einer nahe gelegenen Klosterruine eine Gruppe taubstummer Kinder vorfindet, die mit ihrer Betreuerin den Schrecken des Krieges hilflos ausgeliefert sind.\nWährend die Wehrmacht immer weiter gegen die kleine Einheit vorrückt und einer nach dem anderen fällt, müssen die Überlebenden über sich selbst hinauswachsen. Um die Unschuldigen zu schützen, werden sie zu den größten Helden des Krieges.\n#Netzkino #ganzerFilm #Kriegsfilm\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@netzkino_official\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "addedAt": "2025-12-25T23:48:04.468Z",
      "thumbnail": "https://i.ytimg.com/vi/6vjJa57eat0/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBF3OMVCpCWa4LWXKWHX33eb43q1A",
      "duration": 6299,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.127Z"
}