{
  "movieId": "youtube-UPOtgP_sQoI",
  "title": "Flames (Action, 1932) Johnny Mack Brown, Noel Francis | Movie, Subtitles",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=UPOtgP_sQoI",
      "id": "UPOtgP_sQoI",
      "title": "Flames (Action, 1932) Johnny Mack Brown, Noel Francis | Movie, Subtitles",
      "description": "Brown is a confident young firefighter. He and his buddy become interested in two girls, after saving their cat. He then fights a fire in the apartment building next door to his new girlfriend.\n\nOriginal title: Flames (1932) AKA: Fire Alarm / Fatal Alarm\n\nColorized version: https://youtu.be/NZdxOdfh2SQ\n\n\nThis film is subtitled in many languages.\n\nDirector: Karl Brown\nWriters: Karl Brown, Lee Chadwick \nStars: Johnny Mack Brown, George Cooper, Noel Francis \nGenres: Classics, Drama, Action, Adventure, Romance\n\n\n00:00 Full Movie (with subtitles)\n01:24 Firefighters rescue a cat stuck in a tree, avoid unnecessary calls, and watch a movie.\n07:25 A wealthy man offers a young woman a private secretary job, leading to potential complications and misunderstandings.\n15:57 Drama unfolds in an office setting as relationships and tensions rise between characters.\n19:02 A chaotic scene unfolds as characters navigate through a series of events, including a fire and a mysterious disappearance.\n29:23 A dramatic scene unfolds at a burning building, where characters navigate through danger and emotions.\n36:16 Unexpected visitor interrupts a conversation, leading to confusion and misunderstandings.\n42:22 Drama unfolds as Garson causes trouble by invading Burke's home, leading to a confrontation.\n46:18 Deception, threats, and a rescue plan unfold in a small town involving Garson, Gertie, Pat, and Charlie.\n51:33 A thrilling rescue mission unfolds as a group of individuals work together to save lives during a dangerous situation.\n\n\n@CultCinemaClassics\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:38:30.449Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/UPOtgP_sQoI/maxresdefault.webp?v=65fa8bfb",
      "duration": 3923,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:38:30.561Z"
}