{
  "imdbId": "youtube-h41FUJHpNUA",
  "title": "Teen-Age Strangler 1964 | Murder Mystery | Bill Bloom, John Ensign, Rick Harris (full movie)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=h41FUJHpNUA",
      "title": "Teen-Age Strangler 1964 | Murder Mystery | Bill Bloom, John Ensign, Rick Harris (full movie)",
      "description": "Budding Young Teenagers Were the Bluebeard's Prey! \nA troubled teen with an undeserved criminal past is the suspect when young women start turning up around town dead and marked up with lipstick.\n\nOriginal title: Teen-Age Strangler (1964)  AKA: Terror in the Night\nSubtitles added on this video\n\nDirector: Ben Parker\nWriter: Clark Davis\nStars: Bill Bloom, John Ensign, Rick Harris, Stacy Smith\nGenres: Crime, Drama, Horror, Mystery, psychotronic film\n\n0:00 A man named Mr. Slade visits a couple, Mr. and Mrs. Harley, to inquire about renting rooms in their house.\n9:52 A pathologist named Mr. Slade rents a room in the Harley's house and expresses his need for a quiet place to study and conduct experiments.\n15:09 A group of people prepare for a theater show while the city is on edge due to the Ripper murders.\n25:09 Inspector Warwick of Scotland Yard visits Miss Bonner to inquire about a woman named Annie Rowley, who has become a victim of Jack the Ripper.\n30:55 A discussion about the Ripper case and the nature of criminals.\n36:18 A woman named Miss Bonner expresses her concern to Mr. Slade about him being alone too much and missing out on the delights of the world, including the enjoyment of a man's kiss.\n42:43 A tour of the Black Museum at Scotland Yard with Chief Inspector Melville and Miss Bonner.\n47:21 A discussion about Jack the Ripper's crimes and the possibility of another murder occurring soon.\n57:54 The characters discuss their suspicions about Dr. Slade and his actions.\n\n@CultCinemaClassics",
      "id": "h41FUJHpNUA",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:40:19.271Z"
}