{
  "imdbId": "youtube-C1JOyW4tNac",
  "title": "Terror by Night 1946 (Crime, Film-Noir, Mystery, Thriller) directed by Roy William Neill",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=C1JOyW4tNac",
      "title": "Terror by Night 1946 (Crime, Film-Noir, Mystery, Thriller) directed by Roy William Neill",
      "description": "Murder, at 90 miles per hour!\nWhen the fabled Star of Rhodesia diamond is stolen on a London to Edinburgh train and the son of its owner is murdered, Sherlock Holmes must discover which of his suspicious fellow passengers is responsible.\n\nOriginal title: Terror by Night (1946) AKA: Sherlock Holmes: Terror by Night\n\nThis film is available with English, French, German, Italian & Spanish Audio.  And subtitled in many languages\n\nColorized version: https://youtu.be/CTCFtZYFyrc\n\n\nDirector: Roy William Neill\nWriters: Frank Gruber, Arthur Conan Doyle\nStars: Basil Rathbone, Nigel Bruce, Alan Mowbray \nGenres: Crime, Drama, Literary, Film-Noir, Mystery, Thriller\n\n\n00:00 Full Movie (with dubbed audio & subtitles)\n01:21 Mystery unfolds as Sherlock Holmes and Dr. Watson embark on a train journey to protect a valuable diamond.\n07:16 Investigation of a murder on a train involving the theft of a valuable diamond.\n14:04 Investigation of a suspected murder and missing diamond on a train by Sherlock Holmes and Inspector Lestrade.\n19:43 A murder and theft investigation unfolds on a train involving suspects and stolen jewels.\n26:19 A detective investigates a stolen diamond and a murder on a train, encountering suspicious characters and complex motives.\n37:52 Investigation reveals hidden compartment in coffin, implicating two culprits including Colonel Sebastian Moran on the train.\n39:53 Murder investigation on a train reveals a hidden compartment in a coffin and a secret plot.\n52:56 A mysterious criminal, Colonel Sebastian Moran, is identified on a train by Sherlock Holmes and Inspector MacDonald.\n54:49 Detective Holmes uncovers a fiendish plot involving a fake arrest and a stolen diamond.\n\n\n@CultCinemaClassics \n\n https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "C1JOyW4tNac",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:35.926Z"
}