{
  "movieId": "youtube-S0c28-Dj_4Y",
  "title": "The Diamond Job – Gauner, Bomben und Juwelen (ACTION | Unzensiert exklusiv für Netzkino-Members)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=S0c28-Dj_4Y",
      "id": "S0c28-Dj_4Y",
      "title": "The Diamond Job – Gauner, Bomben und Juwelen (ACTION | Unzensiert exklusiv für Netzkino-Members)",
      "description": "THE DIAMOND JOB – GAUNER, BOMBEN UND JUWELEN (2018)\nOriginaltitel: Blue Iguana\nMit: Sam Rockwell, Ben Schwartz, Phoebe Fox, Frances Barber, Amanda Donohoe\nRegie: Hadi Hajaig\nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nDie New Yorker Kleinganoven Eddie (Sam Rockwell) und Paul (Ben Schwartz) wittern bei einem Raubzug in London den ganz großen Wurf. Doch der Griff nach den Sternen gestaltet sich schwieriger als gedacht, und gemeinsam mit ihrem Kompagnon Tommy (Al Weaver) verscherzen sie es sich geradezu gezielt mit der britischen Unterwelt. Und mit dieser ist ganz und gar nicht gut Kirschen essen... \nKleine Gauner, die einen großen Coup planen und bei dessen Ausführung gern gehörig auf die Fresse fliegen. Aber hier haben die scheinbaren Verlierer jederzeit einen coolen Spruch auf den Lippen - selbst im Angesicht des Todes. In bester Guy-Ritchie-Manier ist Regisseur Hadi Hajaig ein Juwel des Indie-Thrillers gelungen. Dass der hochexplosive Witz der Story zündet, ist vor allem Ausnahmetalent und Oscar-Preisträger Sam Rockwell (\"Three Billboards Outside Ebbing, Missouri\") zu verdanken, der jeder noch so aberwitzigen Figur eine zutiefst menschliche Seite zu geben vermag. \n#Netzkino #ganzerFilm #SamRockwell\n\nCOPYRIGHT:\nSpotfilm Networx GmbH is a serious and legal video on demand company located in Berlin, Germany. We are holding a proper license for all of our published movies. For any questions contact copyright@spotfilm-networx.com",
      "addedAt": "2025-12-24T00:01:12.799Z",
      "thumbnail": "https://i.ytimg.com/vi/S0c28-Dj_4Y/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLD4xa3MNIZOxTZ30VWNlhDCScJrPw",
      "duration": 6042,
      "language": "de",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T00:01:12.799Z"
}