{
  "imdbId": "youtube-pVom0VibsRk",
  "title": "Evergreen Tree ( Sangnoksu )(1961)",
  "year": 1961,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=pVom0VibsRk",
      "title": "Evergreen Tree ( Sangnoksu )(1961)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00674\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00674\n\n영화글 : https://www.kmdb.or.kr/story/10/5472\n\n감독(Director) : 신상옥(Shin Sang-Ok)\n출연 : 최은희,신영균,허장강,도금봉,신성일,윤일봉,박성대,한은진,고선애,변기종,박철민,이정애,정득순\n\n줄거리 : 전문학교 출신의 그와 그녀는 농촌계몽에 뜻을 두고 각기 고향으로 내려간다. 그는 마을회관을 세우고 농촌 청년들을 선도해가고 그녀는 학당을 세워 문맹퇴치를 위해 노력한다. 그러나 일제의 간악한  탄압의 손길이 그들에게까지 뻗혀 그는 일경에게 잡히는 몸이 되고 그녀는 과로끝에 몸져 눕는다. 그가 풀려 나오던 날, 그녀는 안타깝게도 농촌에 대한 정열을 꽃피우지 못한채 죽고만다.심훈의 ᐸ상록수ᐳ를 원작으로 신상옥 감독이 제작, 감독했다. 일제하 농촌을 배경으로 계몽사업에 몸과 마음을 다 쏟는 영신(최은희)과 그녀의 동지이자 애인인 동혁(신영균)의 감동적인 이야기로 당시 “흥행물로선 성공작”이었다. 영신 역의 최은희가 1회 대종상 여우주연상을 수상했고 9회 아시아영화제에서 신영균이 남우주연상, 허장강이 남우조연상을 수상했다. 1978년 임권택 감독에 의해 김희라, 한혜숙 주연으로 리메이크 되기도 했다.\n\nCasts : Choi Eun-Hee,Shin Young-Kyun,Heo Jang-Kang,Do Keum-Bong,Shin Seong-Il\n\nSYNOPSIS : He and she are both graduates of vocational school. With great hopes of developing the rural district, they each return to their hometown. He builds a community center to lead other youths in his hometown and she opens a village school and works hard to eradicate illiteracy. However, the wicked suppression of the Japanese forces reaches them and he gets arrested by the Japanese police. Meanwhile, she becomes ill with fatigue. On the day he is finally released from the police, she dies before realizing her dream\n\nThis movie was produced and directed by Shin Sang-ok based on the novel by Shim Hoon. The story is about Yeong-shin (Choi Eun-hee) and her companion and lover Dong-hyeok (Shin Yeong-kyun) who is fully devoted to enlightenment of the rural areas. This production was considered a success with its moving storyline. Choi Eun-hee who played the role of Yeong-shin won the best actress award at the first Daejong Film Award and Shin Yeong-kyun won the Leading Actor Award and Heo Jang-kang the Best Supporting Actor Award at the 9th Asian Film Festival. The movie was also remade by producer Lim Kwon-taek starring Kim Hee-ra and Han Hye-sook in 1978.",
      "id": "pVom0VibsRk",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:24:54.297Z"
}