{
  "imdbId": "youtube-l2uu9hJsjSk",
  "title": "Hurrah! For Freedom (Ja-yumanse)(1946)",
  "year": 1946,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=l2uu9hJsjSk",
      "title": "Hurrah! For Freedom (Ja-yumanse)(1946)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00175\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00175\n\n감독(Director) : 최인규(Choi In-Kyu)\n출연 : 전창근(최한중),유계선(미향),황려희(혜자),김승호,복혜숙,한은진,하연남,윤봉춘,강계식,전택이,송억,독우영,김복자\n\n줄거리 : 1945년 8월 서울. 독립운동을 하다 일제의 앞잡이 남부(독은기)의 배반으로 체포되어 감옥에 있던 한중(전창근)은 탈출에 성공하여 대학병원 간호부 혜자(황려희)의 집으로 숨어든다. 한중의 지하조직은 예정대로 무장봉기를 일으키기 위해 준비하던 중 박(김승호)이 다이너마이트를 가지고 오다 일본 헌병에 잡히고, 한중은 박을 구출하고 남부의 애인인 미향(유계선)의 아파트로 피신한다. 한중을 숨겨준 미향은 그에게 매료되어 한중의 지하조직이 있는 지하실로 찾아가 정보와 자금을 전달한다. 그 뒤를 밟은 남부와 현병들에 의해 미향은 총에 맞아 죽고, 한중은 총상으로 대학병원으로 옮겨진다. 한중을 사모하던 혜자는 헌병이 잠든 틈을 타 그를 탈출시킨다.\n\nCasts : Hwang Yui-Hee,Jeon Chang-Keun,Yoo Kye-Seon,Jeon Taek-Yi,Ha Yeon-Nam,Kim Seung-Ho,Han Eun-Jin\n\nSYNOPSIS : In August 1945, Nam-bu (Dog Eun-gi), a Japanese collaborator, reveals the name of an independence activist, Choe Han-jung (Jeon Chang-geun), who puts him in prison. But Choe successfully escapes, and secretly hides in Hye-ja (Hwang Ryeo-hui)'s house, who works as a nurse at a university medical center. As Han-jung's underground organization prepares to raise an armed uprising, Park (Kim Seung-ho) who has a bomb, gets caught by the Japanese military police. Han-jung saves Park, and hides himself in Nam-bu's girlfriend, Mi-hyang's (Yu Gye-seon) apartment. While she is hiding him she develops a crush on him and goes to his organization's place, and gives them information and money. Nam-bu and the military police who had been following her shoots her to death, and Han-jung is shot and hospitalized. Hye-ja, who used to love Han-jung, helps him to escape from the hospital, while the military police fall asleep while monitoring him.",
      "id": "l2uu9hJsjSk",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:24:32.900Z"
}