{
  "imdbId": "youtube-Go4pTx6w1sA",
  "title": "Jack the Ripper Thriller | Man in the Attic (1953) Jack Palance, Constance Smith | Colorized Movie",
  "year": 1953,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Go4pTx6w1sA",
      "title": "Jack the Ripper Thriller | Man in the Attic (1953) Jack Palance, Constance Smith | Colorized Movie",
      "description": "The Life...The Loves...The Crimes of Jack the Ripper!\nA mysterious lodger in Victorian London  becomes the prime suspect in a series of gruesome murders reminiscent of Jack the Ripper. As tension mounts, a young woman living in the same boarding house becomes increasingly suspicious of the man upstairs, leading to a suspenseful cat-and-mouse game to uncover the truth behind the chilling crimes.\n\nOriginal title: Man in the Attic (1953)\n\nBlack & White version: https://youtu.be/LJ3CjiDHcDs\n\nDirector: Hugo Fregonese\nWriters: Robert Presnell Jr.\nStars: Jack Palance, Constance Smith, Byron Palmer, Frances Bavier\nGenres: Colorized classics, Mystery, Thriller\nBudget: $500,000\n\n\n0:00 A man named Mr. Slade visits a house to inquire about renting rooms.\n09:43 A pathologist named Mr. Slade rents rooms in a house to study and conduct experiments, while the owners are in need of money due to business reverses and become nervous about the recent Jack the Ripper murders.\n14:59 A group of people prepare for a theater show while the city is plagued by the Ripper murders.\n25:09 Inspector Warwick from Scotland Yard questions Miss Bonner about a woman named Annie Rowley who is believed to be a victim of Jack the Ripper.\n30:55 Mr. Slade discusses the Ripper case with Inspector Warwick and shares his theories on the killer's profile.\n36:18 A man and a woman discuss their feelings and the woman suspects that a man they know is the Ripper.\n45:06 A tour of the Black Museum at Scotland Yard and a discussion about murderers and their crimes.\n47:21 A discussion about Jack the Ripper's crimes and the possibility of another murder.\n59:09 The characters discuss their suspicions about Dr. Slade and his involvement in the recent crimes.\n1:04:32 Inspector Harley investigates Mr. Slade's possible connection to the Ripper murders.\n1:11:30 A doctor becomes convinced that an actress is the daughter of Jack the Ripper and tries to save her from her evil tendencies.\n\n\n@CultCinemaClassics",
      "id": "Go4pTx6w1sA",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:40:37.255Z"
}