{
  "imdbId": "youtube-fHUhkWSxVG4",
  "title": "이 생명 다하도록(1960) / To The Last Day (I saengmyeong dahadolog)",
  "year": 1960,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=fHUhkWSxVG4",
      "title": "이 생명 다하도록(1960) / To The Last Day (I saengmyeong dahadolog)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00579\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00579\n\n영화글 : https://www.kmdb.or.kr/story/10/5367\n\n감독(Director): 신상옥(Shin Sang-ok)\n출연(Cast): 최은희(Choe Eun-hui), 김진규(Kim Jin-gyu), 남궁원(Nam Gung-won), 신성일(Shin Sung-yill), 김혜정(Kim Hye-jeong) \n\n(줄거리) 6·25 전쟁에 참가한 김 대위(김진규)는 척추를 부상당해 하반신 불구가 된다. 아내 혜경(최은희)은 남편을 극진히 간호한다. 혜경 가족이 대구로 피난을 가던 도중, 둘째 딸이 죽는다. 혜경은 첫째 딸 선경(전영선)과 남편을 수레에 태워 피난길에 오른다. 피난지에서 김 대위는 다시 병원에 입원하고 혜경은 좌판 장사로 생계비를 번다. 혜경은 그녀의 좌판 옆에서 물건을 팔던 미스터 조(남궁원)을 만난다. 전쟁 통에 고아가 된 미스터 조는 혜경에게 누님이 되어달라고 부탁하고 두 사람은 급속도로 가까워진다. 미스터 조는 집을 마련하고 혜경에게 한 집에서 살자고 제안한다. 미스터 조를 사랑하게 된 혜경은 미스터 조와 남편 사이에서 갈등한다. 어느 날 집에 찾아온 남편은 혜경과 미스터 조가 함께 걸어오는 것을 보고 화를 내며 병실로 돌아간다. 그러나 병실에서 혜경과 마주친 남편은 그녀 없이는 살 수 없으니 자신을 떠나지 말아달라고 애원한다. 혜경은 미스터 조와의 관계를 정리하고 가족과 함께 서울로 올라온다. 혜경 부부는 갈 곳 없는 전쟁미망인과 그 아이들을 위해 모자원을 설립해 새로운 희망을 꿈꾸지만 선경이 교통사고로 죽자 다시 절망에 빠진다. 미망인들이 모자원을 떠나려던 찰라, 식음을 전폐하고 누워있던 혜경이 정신을 차리고 나와 이들에게 용기를 북돋는다.\n\n(Synopsis) Captain Kim (Kim Jin-gyu), who participated in the Korean War, is paralyzed from the waist down. His wife, Hye-gyeong (Choe Eun-hui), takes care of him well. But when the family is evacuating to Daegu, their second daughter dies along the way. Hye-gyeong places the eldest daughter, Sun-gyeong (Jeon Yeong-seon), and her husband on a wagon and leaves to seek refuge. In Daegu, Captain Kim is hospitalized while Hye-gyeong earns a living by being a street peddler. One day, she meets Mr. Joe (Nam Gung-won) who sells products near her stall. Mr. Joe, who was orphaned during the war, asks Hye-gyeong to be a surrogate sister to him, and the two quickly become close.  Mr. Joe gets a house and suggests that Hye-gyeong live with him.  Hye-gyeong, who has come to love Mr. Joe, is conflicted between him and her husband. One day when her husband comes for a visit, he witnesses Mr. Joe and his wife together and becomes furious, returning to the hospital. When Hye-gyeong visits him in the hospital, he begs her not to leave him, and tells her he cannot live without her.  Hye-gyeong puts an end to her relationship with Mr. Joe and goes to Seoul to be with her family. Once there, Hye-gyeong and her husband establish a home for war widows and their children who have nowhere else to go. Their new hopes are dashed when Sun-gyeong dies in a traffic accident.  With Hye-gyeong fasting and bedridden in grief, it seems as if the war widows will have to seek shelter elsewhere. But Hye-gyeong collects herself once again, giving encouragement to everyone.",
      "id": "fHUhkWSxVG4",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:23:01.215Z"
}