{
  "movieId": "youtube-owc4XWIA3hI",
  "title": "Un jinete llamado Muerte | PELÍCULA HISTÓRICA | por Karen Shakhnazarov",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=owc4XWIA3hI",
      "id": "owc4XWIA3hI",
      "title": "Un jinete llamado Muerte | PELÍCULA HISTÓRICA | por Karen Shakhnazarov",
      "description": "Rusia a principios del siglo XX. Los terroristas planean asesinar a estadistas prominentes. Su principal objetivo es el asesinato del Gran Duque de Rusia. El intento de asesinato está siendo preparado por miembros de la Organización Militante, liderada por su líder Georges. El proceso de organización de un ataque terrorista revela la psique, los sentimientos y las aspiraciones de los terroristas, cada uno con diferentes razones para hacer lo que hace. Los intentos de asesinato fracasan uno tras otro, y casi todos sus organizadores son asesinados. El sobreviviente Georges se da cuenta de repente de que el asesinato del Gran Duque de Rusia se ha convertido en el único propósito de su vida, y hará lo que sea para llevar a cabo su plan. Comete un asesinato atrevido, pero termina decepcionado.\n\nAño de producción: 2004\n\nDirigida por: Karen Shakhnazarov\nEscrita por: Aleksandr Borodyansky, Karen Shakhnazarov\nDirectora de fotografía: Vladimir Klimov\nMúsica: Anatoly Kroll\nDiseñadora de producción: Lyudmila Kusakova\nProtagonizada por: Andrei Panin, Dmitriy Dyuzhev, Artem Semakin, Kseniya Rappoport, Anastasia Makeeva\n\n¡Suscríbete a nuestro canal de YouTube y no olvides hacer clic en la campanita para no perderte las mejores películas soviéticas!",
      "addedAt": "2025-12-23T03:43:59.932Z",
      "thumbnail": "https://i.ytimg.com/vi/owc4XWIA3hI/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDSUjJuUwMCEQXtQM6HMRvl4MCAqw",
      "duration": 6388,
      "language": "ru",
      "channelName": "Mosfilm",
      "channelId": "UCm5U4zqpahzyNXBv5ZT51Jw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-23T03:43:59.932Z"
}