{
  "imdbId": "youtube-wENhvXlac2U",
  "title": "Cipher Bureau 1938 (Espionage, Action) Directed by Charles Lamont | Colorized Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=wENhvXlac2U",
      "id": "wENhvXlac2U",
      "title": "Cipher Bureau 1938 (Espionage, Action) Directed by Charles Lamont | Colorized Movie",
      "description": "Love, loyalty, and the hidden messages that bind them all.\nIn a covert mission against a spy ring, Philip's efforts are complicated when his brother Paul is framed. Through coded messages and unexpected alliances, the spies are thwarted, allowing for romantic resolutions amidst the intrigue.\n \nOriginal title: Cipher Bureau (1938)\nThis film is subtitled in many languages.\n\nBlack & White version: https://youtu.be/_4uAApcxe6M\n\n\nDirector: Charles Lamont\nWriters: Arthur Hoerl, Monroe Shaff \nStars: Leon Ames, Charlotte Wynters, Joan Woodbury|, Don Dillaway\nGenres: Colorized, Action, Adventure, Crime, Drama, Romance\n\n\n00:00 Full colorized Movie (with subtitles).\n01:50 Intrigue and espionage unfold as agents search for a mysterious figure named Wormer in a secretive location.\n07:19 Decoding secret messages, naval espionage, and strategic missions unfold in a colorized action movie set in 1938.\n14:09 Decoding messages, espionage activities, and tracking suspects in a colorized movie set in 1938.\n21:28 Decoding a secret message leads to a plan involving the Royal Gardens and Navy Office.\n27:55 Military espionage mission uncovers potential threat and plans for defense strategies.\n34:23 Investigation into espionage involving Lieutenant Waring and potential consequences.\n37:01 Investigation into espionage activities involving classified documents and extraterrestrial contact.\n43:50 Espionage mission involving love, betrayal, and decoding a secret message in 1938.\n54:30 Decoding a mysterious love letter unveils a secret plan involving an anniversary event at 8 PM.\n57:25 Military espionage mission to intercept coded naval plans, decoding music notes for a key, and urgent communication.\n1:05:00 Covert operation planning and execution involving espionage activities in 1938.\n\n\n@CultCinemaClassics\n\n https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:35:57.763Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/wENhvXlac2U/maxresdefault.webp",
      "duration": 4213,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:35:57.896Z"
}