{
  "movieId": "youtube-FbdWW05gkCw",
  "title": "Two detectives join forces to stop a serial killer / Full Thriller English Film",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=FbdWW05gkCw",
      "id": "FbdWW05gkCw",
      "title": "Two detectives join forces to stop a serial killer / Full Thriller English Film",
      "description": "Black Rose - In the film \"Black Rose,\" Russian Police Major Vladimir Kazatov is invited to Los Angeles to assist local law enforcement in investigating a series of brutal murders. The victims are young women, and the trail leads to a mysterious serial killer operating on the streets of Hollywood. The LAPD faces difficulties as the killer’s methods are extremely sophisticated and cruel, leaving minimal evidence behind.\n\nKazatov, known for his resourcefulness and determination, begins the investigation alongside a local detective. Cultural differences complicate their collaboration, but the major's experience helps uncover new leads on the killer. It turns out that the crimes are linked to underground organizations operating on both sides of the ocean.\n\nTime is running out as the killer becomes bolder, attempting to erase all traces and evade justice. Kazatov and his partner must act quickly to stop the maniac before he strikes again in the heart of Hollywood.\n\n***Under license from ITN Distribution. All rights reserved.*** \n\nWelcome to Movie Central. Subscribe and watch more Awesome Movies. \nhttps://www.youtube.com/channel/UCGBzBkV-MinlBvHBzZawfLQ/playlists\n\n** All the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-27T00:10:33.707Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/FbdWW05gkCw/maxresdefault.webp",
      "duration": 4993,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "AU",
          "CA",
          "GB",
          "JM",
          "US"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:10:33.722Z"
}