{
  "imdbId": "youtube-4WYnfSQRjAk",
  "title": "Beyond the Sky - Discover the Truth (SPANNENDER SCI FI Film auf Deutsch, Sci Fi Thriller Filme)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=4WYnfSQRjAk",
      "title": "Beyond the Sky - Discover the Truth (SPANNENDER SCI FI Film auf Deutsch, Sci Fi Thriller Filme)",
      "description": "💙 Filme in voller Länge auf Deutsch anschauen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Dokumentarfilmer Chris will Alien-Entführungen als Mythos entlarven – bis er Emily trifft, die behauptet, jedes Jahr entführt zu werden. Als ihr Geburtstag naht, verschwimmen für Chris Realität und Wahnsinn – und eine unheimliche Wahrheit kommt ans Licht.\n\nBEYOND THE SKY – DISCOVER THE TRUTH (2018)\nOriginaltitel: Beyond the Sky\nMit: Ryan Carnes, Jordan Hinson, Claude Duhamel \nRegie: Fulvio Sestito \nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nChris Norton ist ein Dokumentarfilmer, der das Alien-Entführungs-Phänomen entlarven möchte – aus persönlicher Betroffenheit. Doch bei Dreharbeiten in New Mexico trifft er auf Emily, die behauptet, jede ihrer Geburtstage dauerhaft entführt zu werden. Kurz vor ihrem 28. Geburtstag beginnt Chris zu zweifeln: Sind ihre Erinnerungen echt – oder steckt eine gefährlich andere Wahrheit dahinter? Während Emily unerklärlichen Ereignissen näherkommt, gerät Chris in einen Strudel aus Erwarten und Vertrauen – ein Spiel zwischen Skepsis und der Furcht vor dem Unbekannten. \n#Netzkino #ganzerFilm #Mystery\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "4WYnfSQRjAk",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-25T23:55:16.125Z"
}