{
  "imdbId": "youtube-ikz7a3AnX7o",
  "title": "Day of the Demons (HORROR ganzer Film Deutsch, Horrorfilme in voller Länge anschauen, Zombie Filme)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=ikz7a3AnX7o",
      "title": "Day of the Demons (HORROR ganzer Film Deutsch, Horrorfilme in voller Länge anschauen, Zombie Filme)",
      "description": "► Komplette Filme kostenlos anschauen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n► Ex-Cop Jack ist auf einem Camping-Trip mit seinen Freunden Trevor, Quentin und Joe, als er aus einem fürchterlichen Albtraum erwacht: In diesem Traum haben sich seine Ex-Frau Marcy und seine Tochter Kendra in grauenhafte dämonische Wesen verwandelt - wird er sie retten können?\n\nDAY OF THE DEMONS (2019)\nOriginaltitel: 13/13/13\nMit:  Trae Ireland, Erin Coker, Jody Barton, Calico Cooper, Tiffany Martinez\nRegie: James Cullen Bressack\nFSK: Freigegeben ab 18 Jahren\n\nINHALTSANGABE:\nEs ist der 13. Tag des Monats und ein Blick auf die Uhr zeigt 13h13. Eine seltsame Vorahnung beschleicht Jack und er macht sich mit seinen Freunden auf zum Haus seiner Ex-Frau. Diese benimmt sich äußerst seltsam und ist dabei, sich das Fleisch von den Knochen einer ihrer Arme zu kratzen. Jack bringt sie in Krankenhaus.\nDoch auch in der Klinik benehmen sich die Menschen sehr seltsam und aggressiv. Scheinbar grundlos gehen immer mehr Menschen aufeinander los und versuchen sich zu zerfleischen und die Temperatur im Krankenhaus fällt auf 13 Grad Celsius. Als sich Marcy dann aus ihrem Krankenzimmer in den Tod stürzt, dämmert es Jack: Es ist der 13. Tag, des 13. Jahres nach dem Jahrtausendwechsel. - Eine alte Legende besagt, dass an diesem Tag, um 13:13 Uhr, sich das Tor zur Hölle öffnen wird und die Dämonen Besitz von den Menschen ergreifen werden.\nJack muss nach Hause, um seine Tochter vor den dämonischen Scharen zu schützen... Doch auch Kendra hat sich verwandelt...\n#Netzkino #ganzerFilm #Horrorfilm\n\n\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinem monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum Streamen, kostenlos & legal auf http://bit.ly/NetzkinoWebsite\n✘ Abonniere unseren Trailerkanal für die neusten Kinotrailer:  http://bit.ly/NetzkinoTrailer\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nFOLGE UNS!\n✘ Facebook - https://www.facebook.com/netzkino\n✘ Twitter - https://twitter.com/netzkino\n✘ Instagram - https://www.instagram.com/netzkino/\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "ikz7a3AnX7o",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-24T00:05:26.239Z"
}