{
  "movieId": "youtube-RjD9yrbZrzY",
  "title": "Against All Hope 1982 (Biography, Drama) Michael Madsen, Maureen McCarthy, Cecil Moe | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=RjD9yrbZrzY",
      "id": "RjD9yrbZrzY",
      "title": "Against All Hope 1982 (Biography, Drama) Michael Madsen, Maureen McCarthy, Cecil Moe | Movie",
      "description": "From despair to deliverance...\nCecil (played by Madsen) is a desperate man;  in danger of losing his family, and driven to the edge of suicide by alcoholism.  But is rescued by a priest who reaches out to hear his story.\n\nOriginal title: Against All Hope (1982) AKA: One for the Road\n\nDirector: Edward T. McDougal\nWriters: Edward T. McDougal, Cecil Moe, Jean Moe, \nStars: Michael Madsen, Maureen McCarthy, Cecil Moe\nGenres: Biography, Drama\n\n\n00:00 Full Movie (with subtitles)\n01:34 Struggles with alcoholism, family conflicts, and seeking help from a preacher in a 1982 drama film.\n19:42 Family dynamics, struggles, and new beginnings unfold in a rural setting.\n22:09 Struggles of a man named Cecil Moe unfold as he faces challenges in work, family, and health.\n30:46 Family struggles with alcoholism, leading to ultimatums and tough decisions.\n43:50 A man struggles with alcoholism, promises to quit, but faces temptation and relapse, causing family distress.\n55:28 Family struggles with financial issues, marital problems, and alcoholism leading to a potential eviction.\n1:02:07 A man's life spirals out of control due to financial struggles, addiction, and family issues.\n1:12:26 A man finds redemption through faith after a life of struggle and addiction.\n1:20:17 A man finds faith and sobriety, leading to a transformed life and hope for his family.\n\n\nCCC sidenote: Michael Madsen's first film credit. Also it's no coincidence that the main character has the same name as the producer/writer/editor - and cast member.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:36:38.541Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/RjD9yrbZrzY/maxresdefault.webp?v=66569799",
      "duration": 5344,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:38.656Z"
}