{
  "imdbId": "youtube-jy7uhfy33tI",
  "title": "3 Guys Named Mike (1951) by Charles Walters | Rom-Com with Jane Wyman",
  "year": 1951,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=jy7uhfy33tI",
      "title": "3 Guys Named Mike (1951) by Charles Walters | Rom-Com with Jane Wyman",
      "description": "The riotous story of an airline stewardess! \nMarcy has fun with three very different men who happen to share the same name. They include drink-slinging science professor Mike Lawrence, wealthy executive Mike Tracy, and airline pilot Mike Jamison. When the three find out about each other, she has to decide which one she loves the most.\n\nBlack & White version: https://youtu.be/4LJRy0jtRj0\n\n\nOriginal title: Three Guys Named Mike (1951)\nThis film is subtitled in many languages\n\nDirector: Charles Walters\nWriters: Sidney Sheldon, Ruth Brooks Flippen, Ethel Wells \nStars: Jane Wyman, Van Johnson, Howard Keel, Barry Sullivan\nGenres: Classics, Comedy, Romance, Colorized\n\n\n00:00 Full Movie (with subtitles) \n01:25 A young woman named Marcy pursues her dream of becoming an airline stewardess in the 1950s.\n07:20 A group of stewardesses embark on their new journey in the airline industry.\n18:20 A stewardess named Marcy causes chaos on a flight to Nashville, but is given a second chance by the airline.\n28:42 Flight attendants Marcy and Jan prepare for a flight, interact with passengers, including a VIP named Michael Lawrence, and entertain a young girl named Natalie.\n37:36 A group of friends plans to pool their resources to find a house together in a housing shortage situation.\n44:00 A series of encounters in Chicago involving a graduate research student, a businessman, and a woman named Marcy.\n50:18 Romantic comedy film involving three individuals named Mike, logistical challenges, and unexpected help.\n1:01:51 A scientist named Mike is nominated for a prestigious fellowship, impacting his career and relationship with Marcy.\n1:03:45 A discussion about a relativity joke leads to a successful advertising idea and a dinner invitation.\n1:13:23 A chance encounter leads to a deep conversation between two individuals with a shared love for travel and exploration.\n1:16:39 A chaotic situation unfolds at a party due to a misunderstanding involving Marcy and Mike.\n1:26:56 Romantic proposal and decision to embark on a new adventure together.\n1:32:48 Opportunities for starting a business with SMC, offering support and resources for success in sales and marketing.\n\n\n@CultCinemaClassics",
      "id": "jy7uhfy33tI",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:36:15.307Z"
}