{
  "movieId": "youtube-HKjr9MSZnPo",
  "title": "Four Chaplin shorts from 1917: The Adventurer, The Cure, Easy Street and The Immigrant",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=HKjr9MSZnPo",
      "id": "HKjr9MSZnPo",
      "title": "Four Chaplin shorts from 1917: The Adventurer, The Cure, Easy Street and The Immigrant",
      "description": "Chaplin’s self-curated 1941 anthology revitalizes four 1917 films with new audio, tracing his Tramp’s law-dodging escapes, spa-induced chaos, slum taming, and immigrant grit to showcase his comedic evolution and enduring legacy.. Charlie's obsession with perfection, even in the most ordinary scenes, often exasperated his fellow artists.\n\nDirected and Written by Charlie Chaplin\n\nMain cast:\nCharles Chaplin\nEdna Purviance\nEric Campbell\nAlbert Austin\nLloyd Bacon\nHenry Bergman\nKitty Bradbury\nFrank J. Coleman\n\nBlack & White version: https://youtu.be/N9lDRiNJz3k\n\n00:31  The Immigrant - Chaplin’s penniless immigrant survives a stormy Atlantic crossing, outsmarts a thuggish waiter with a rigged coin, and impulsively drags his love interest into marriage after a restaurant showdown.\n20:27  The Adventurer - Chaplin's escaped convict dodges police through cliffside chases, rescues a drowning socialite, and wreaks havoc at a lavish party while evading capture.\n39:21  The Cure - A boozy Chaplin smuggles liquor into a health spa, triggers chaotic brawls with a gout-stricken rival, and unintentionally spikes the spa’s water supply, turning patients into drunken revelers.\n58:31  Easy Street - Chaplin’s reformed tramp-turned-cop outwits a hulking bully using a gas-powered lamppost trap, drops a stove on his head, and transforms a violent slum into a orderly haven.",
      "addedAt": "2025-12-27T00:31:07.822Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/HKjr9MSZnPo/maxresdefault.webp",
      "duration": 4646,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [
    {
      "id": "charlie-chaplin",
      "name": "Charlie Chaplin"
    }
  ],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:31:07.952Z"
}