{
  "movieId": "youtube-5306pshPP0o",
  "title": "Kenau - 300 gegen die Armee Spaniens - Historienfilm - Ganzen Film kostenlos in HD schauen Moviedome",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=5306pshPP0o",
      "id": "5306pshPP0o",
      "title": "Kenau - 300 gegen die Armee Spaniens - Historienfilm - Ganzen Film kostenlos in HD schauen Moviedome",
      "description": "*GANZER FILM - Epischer Historienfilm aus den Niederlanden*\n\nDen Spielfilm „Kenau - 300 gegen die Armee Spaniens“ kostenlos und in voller Länge auf Moviedome schauen.\n\n*So bewerten Filmfans* „Kenau - 300 gegen die Armee Spaniens“:\nIMDb: *6,5* von 10\nAmazon: *4,2* von 5\n\n*Die Handlung von „Kenau - 300 gegen die Armee Spaniens“*\n1572 liegt die holländische Festung Haarlem unter Belagerung der spanischen Armee mit Don Fadrique, dem Sohn des Herzogs von Alba, als ihren Kommandanten.\n\n►Mehr ganze Filme auf Moviedome entdecken! http://bit.ly/MoviedomeAbo\nJetzt den ganzen Spielfilm „Kenau - 300 gegen die Armee Spaniens“ kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo\n►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #ganzerFilm #Historienfilm #FilmeKostenlos #MoviedomeFilm\n\nOriginaltitel: Kenau\nLaufzeit: 113 Minuten\nRegie: Maarten Treurniet\nFSK: 12\nErstveröffentlichung: 2014\n\n\n*Das sind die Schauspieler*\nMonic Hendrickx (bekannt aus „Unfinished Sky\", \"Penoza\")\nin der Rolle der Kenau\nLisa Smit (bekannt aus „Ares\", \"Quellen des Lebens\")\nin der Rolle der Gertruide\nSallie Harmsen (bekannt aus \"Blade Runner 2049\", \"Moloch\")\nin der Rolle der Kathelijne\n\n\n*Die Handlung und Szenen von „Kenau - 300 gegen die Armee Spaniens“*\nDie niederländische Festung Haarlem wird gegen Ende des Jahres 1572 von der spanischen Armee eingenommen und belagert. Das Kommando obliegt Don Fadrique (Pau Cólera), dem Sohn des 3. Herzogs von Alba. Die Bewohner wollen ihren Unterdrückern trotz Monate währender Kämpfe weiterhin die Stirn bietet und sie in einer entscheidenden Schlacht aus der Stadt vertreiben. Angeführt wird eine Gruppe von 300 Tapferen dabei von der furchtlosen Kenau Simonsdochter Hasselaer (Monic Hendrickx), die nach der Hinrichtung ihrer jüngsten Tochter durch tiefe Trauer erschüttert und wachsenden Hass gegen die Peiniger angetrieben wird. Zusammen stürzen sie sich gemeinsam in eine schwere und heldenhafte Schlacht zur Verteidigung ihrer Heimat und tragen damit entscheidend zur Unabhängigkeit Hollands bei.\n\n\nJetzt ganze Filme bei #Moviedome anschauen\nFinde Movies in ganzer Länge diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \nJetzt den Spielfilm „Kenau - 300 gegen die Armee Spaniens“ in voller Länge auf deutsch ansehen.",
      "addedAt": "2025-12-26T00:33:39.988Z",
      "thumbnail": "https://i.ytimg.com/vi/5306pshPP0o/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLDCeZbXcI9jwxaFPJY_BGPsuE-nRQ",
      "duration": 6741,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:33:40.077Z"
}