{
  "movieId": "youtube-KELIrMhO6lM",
  "title": "Renegade Girl (1946, Western) Ann Savage, Alan Curtis, Ray Corrigan | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=KELIrMhO6lM",
      "id": "KELIrMhO6lM",
      "title": "Renegade Girl (1946, Western) Ann Savage, Alan Curtis, Ray Corrigan | Movie",
      "description": "SHE-DEVIL in war----ANGEL in LOVE!  \nSeeking revenge and driven by her family's ties to Confederate leader William Quantrill, Jean Shelby becomes an outlaw to avenge her brother's death. Complications arise when Jean falls in love with a Union captain, testing loyalties and creating a gripping narrative of love and peril amidst the chaos of war.\n\nColorized version https://youtu.be/zJAQ2xvbzGE\n\n\nOriginal title: Renegade Girl\nThis film is subtitled in many languages.\n\nDirector: William Berke\nWriter: Edwin V. Westrate\nStars: Ann Savage, Alan Curtis, Edward Brophy, Ray Corrigan\nGenres: Western\n\n00:00 Full Movie (with subtitles)\n01:46 Jean Shelby is being escorted by Sergeant James to see Major Barker, who is expecting her at headquarters.\n15:10 A young soldier named Bob Shelby is killed while trying to escape from Quantrill's men.\n18:21 Jean and Fred share a tender moment before being interrupted by gunshots.\n26:49 Jean is recovering from her injuries and expresses her desire for revenge against White Cloud.\n33:35 Jean is asked to join a group of outlaws led by Jerry, but she refuses.\n38:57 Jean Shelby, also known as Marie Carrol, seeks revenge on White Cloud and forms an outlaw gang to track him down.\n45:28 Bob expresses concerns about the White Cloud operation and the dynamics within the gang.\n51:36 Jean and Jerry's plan to capture White Cloud is jeopardized by the arrival of Yankee's Cavalry.\n59:52 Jean and Mrs. Raymond plan to get married, but Jean reveals he is involved with another woman, Marie Carrol, an outlaw who will stand trial.\n\n@CultCinemaClassics\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:38:20.729Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/KELIrMhO6lM/maxresdefault.webp?v=65dee9bd",
      "duration": 3987,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "IT"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:38:20.847Z"
}