{
  "imdbId": "youtube-PIn7mFw2TXk",
  "title": "JOHN TRAVOLTA & SHARON STONE in LIFE ON THE LINE (German Action Movies Complete 2025)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=PIn7mFw2TXk",
      "title": "JOHN TRAVOLTA & SHARON STONE in LIFE ON THE LINE (German Action Movies Complete 2025)",
      "description": "💙 Ganze Filme komplett auf Deutsch streamen - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Katastrophen-Actionfilm mit Starbesetzung - JOHN TRAVOLTA (\"Pulp Fiction\" & \"Grease\"), SHARON STONE (\"Basic Instinct\" & \"Casino\"), KATE BOSWORTH (\"Superman Returns\"), DEVON SAWA (\"Final Destination\") & JULIE BENZ (\"Dexter\"): Ein Team von Linemen - Männer, die das Stromnetz reparieren - wird plötzlich von einem katastrophalen Sturm getroffen...\n\nDER STURM – LIFE ON THE LINE (2015)\nOriginaltitel: Life on the Line\nMit: John Travolta, Sharon Stone, Kate Bosworth, Devon Sawa, Julie Benz\nRegie: David Hackl\nFSK: Freigegeben ab 12 Jahren\n\nINHALTSANGABE:\nBeau (John Travolta) ist ein „Lineman“. Wie gefährlich dieser Job wirklich ist, musste er vor einigen Jahren auf schmerzhafte Weise lernen, als sein jüngerer Bruder und dessen Frau auf tragische Weise in Ausübung ihrer Pflicht in einem Unwetter den Tod fanden. Seitdem wird er von Schuldgefühlen geplagt und kümmert sich um seine Nichte Bailey (Kate Bosworth) und zieht sie alleine groß. \nJahre später möchte Baileys Freund Duncan (Devon Sawa) ebenfalls Lineman werden, doch Beau steht ihm und seiner Mutter (Sharon Stone) skeptisch gegenüber. Als sich jedoch ein Jahrhundertsturm von geradezu apokalyptischen Ausmaßen ankündigt, müssen Beau und Duncan ihre Differenzen überwinden, denn mit dem Zusammenbruch des Stromnetzes stünden unzählige Leben auf dem Spiel, auch das von Bailey! Und so müssen Helden eben tun, was echte Helden so tun...\n#Netzkino #ganzerFilm #JohnTravolta\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@dein_filmtreff\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "PIn7mFw2TXk",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:55:16.128Z"
}