{
  "imdbId": "youtube-HZFyDUgAe40",
  "title": "A Drifting Story (Pyoludo)(1960)",
  "year": 1960,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=HZFyDUgAe40",
      "title": "A Drifting Story (Pyoludo)(1960)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요.\nFor detailed information on this film, visit :\n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/00621\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/00621\n\n감독(Director) : 권영순(Kwon Yeong-Sun)\n출연 : 문정숙,김진규,최무룡,엄앵란,박암,황정순,허장강,도금봉,김동원,이빈화,남춘역,문혜란,성소민,이경희,서민영,고선애,장민호,한미나,한은진,정애란,옥경희,남미리,김숙일,김현주,정철\n\n줄거리 : 사생아인 딸(전영선)과 어머니(황정순)를 부양하며 살고 있는 여인 강현희(문정숙)는 `마돈나'라는 다방을 운영하면서 생계를 유지한다. 현희는 생활고에 시달리지만 자존심을 잃지 않고 살아가기 위해 애쓴다. 그러나 그녀가 사생아를 낳고 다방을 경영한다는 사실만으로도 사람들은 그녀를 무시하려 한다. 강현희는 손님 중의 한 명인 신문사 논설위원 이상현(김진규)과 사랑에 빠지지만 그는 그녀의 대학동창과 결혼한 몸이다. 한편 `마돈나'의 단골손님인 젊은 시인 민우(최무룡)는 현희를 좋아하지만 현희가 받아주지 않자 술을 먹고 행패를 부린다. 민우를 좋아하는 다방종업원 광희(엄앵란)는 민우와 하룻밤을 지내고 민우가 자신의 사랑을 받아주지 않자 절망하여 현희의 도움도 거절하며 거리에서 몸을 팔다가 정신을 잃고 자살한다. \n  현희는 사랑과 윤리 사이에서 고민하면서도 상현과의 사랑을 키워나간다. 그러나 상현이 출장차 미국으로 떠난 어느 날, 손님 중의 한 명인 통역자 최영철(허장강)이 외국인에게 자신을 팔아넘기는 대화를 듣고 분노하여 우발적으로 화병을 던져 영철을 죽인다. 감옥에 수감되어 병을 앓던 현희는 병보석으로 풀려나 상현과 함께 외딴 섬으로 내려가 살게 되지만 행복한 시간도 잠시, 병으로 죽음을 맞이한다.\n\nCasts : Kim Jin-Kyu,Moon Jeong-Suk,Choi Mu-Ryong,Eom Aeng-Ran\n\nSYNOPSIS : Gang Hyeon-hui (Mun Jeong-suk), who takes care of her illegitimate daughter (Jeon Yeong-seon) and her mother (Hwang Jeong-sun), makes a living by managing a dabang (cafe) called 'Madonna.'  Hyeon-hui experiences difficulties in life, but tries not to lose her dignity. However, it is not easy, for the fact that she runs a dabang and has an illegitimate child is enough for people to treat her with disdain. Gang Hyeon-hui falls in love with one of her customers, an editorial writer named Lee Sang-hyeon (Kim Jin-gyu). However, he happens to already be married to her college schoolmate. On the other hand, a frequent customer to 'Madonna,' the young poet Min-u (Choe Mu-ryong), is attracted to Hyeon-hui, but when she does not accept him he becomes drunk and behaves badly.  An employee of the dabang, Gwang-hui (Eom Aeng-ran), likes Min-u and spends the night with him, but as he does not accept her love she becomes devastated.  Refusing Hyeon-hui's help, she sells her body to a stranger in the street, loses her mind, and commits suicide. Hyeon-hui is conflicted between love and morality, but continues to love Sang-hyeon. The day he leaves on a business trip to the U.S., Hyeon-hui overhears the conversation of one of her customers, Choe Yeong-cheol (Heo Jang-gang), who is talking about his plans to sell her to a foreigner.  Furious, she throws a vase at Yeong-cheol, accidentally killing him.  Gravely ill, Hyeon-hui is released on bail, and goes to an isolated island with Sang-hyeon. However, their happy days there are short-lived, for she dies of her illness.",
      "id": "HZFyDUgAe40",
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-26T00:25:17.410Z"
}