{
  "imdbId": "youtube-gOU1kva9BRY",
  "title": "Tekken: Kazuya’s Revenge (MARTIAL ARTS FILM auf Deutsch komplett, ganzer Actionfilm, Kampffilme)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=gOU1kva9BRY",
      "title": "Tekken: Kazuya’s Revenge (MARTIAL ARTS FILM auf Deutsch komplett, ganzer Actionfilm, Kampffilme)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 Ein junger Mann, der an Amnesie leidet und versucht, seine wahre Identität herauszufinden, wird von einer kriminellen Untergrundorganisation entführt und in einen skrupellosen Mörder verwandelt.\n\nTEKKEN: KAZUYA'S REVENGE (2014)\nOriginaltitel: Tekken: A Man Called X\nMit: Wych Kaosayananda\nRegie: Cary-Hiroyuki Tagawa, Kane Kosugi, Gary Daniels, Kelly Wenham \nFSK: Freigegeben ab 16 Jahren\n\nINHALTSANGABE:\nDie Welt ist düster - gespalten in arm und reich, Gewalt regiert. Kazuya Mishima soll von einem Einsatzkommando festgenommen werden, kann aber fliehen, doch gerät anschließend in einen schweren Unfall. Als er wieder erwacht, muss er feststellen, dass er nach Tekken City entführt wurde, wo er für einen mysteriösen Pfarrer Auftragsmorde begehen muss. Kazuya, der den Namen K bekommt, weil er keine Erinnerung an seine Vergangenheit mehr hat, wird von einer unbekannten Stimme in seinem Kopf verfolgt und versucht, sich aus den Fängen des Pfarrers zu befreien. Innerhalb der Killertruppe brodelt es und es kommt zum blutigen Aufstand, der Kazuya schließlich zum wahren Herrscher von Tekken City führt!\n#Netzkino #ganzerFilm #tekken\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@netzkino_official\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "gOU1kva9BRY",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:55:16.128Z"
}