{
  "imdbId": "youtube-LNmVnnulO8U",
  "title": "Fred Astaire | Second Chorus (1940) by H.C. Potter | Romance, Musical | Colorized Movie",
  "year": 1940,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=LNmVnnulO8U",
      "id": "LNmVnnulO8U",
      "title": "Fred Astaire | Second Chorus (1940) by H.C. Potter | Romance, Musical | Colorized Movie",
      "description": "Paulette gets hot for that cool Astaire step...  \nTwo talented musicians, Danny and Hank, compete for a job in Artie Shaw's prestigious band, and for the affections of their beautiful manager, Ellen. They come up with a plan to try and outdo each other to impress Shaw and get into the band.\n\nOriginal title: Second Chorus (1940)\nThis film is available with English, Italian & Spanish audio, and subtitled in many more language options.\n\nBlack & White version: https://youtu.be/U2sBH_P0_rM\n\n\nDirector: H.C. Potter \nWriters: Frank Cavett, Elaine Ryan \nStars: Fred Astaire, Burgess Meredith, Paulette Goddard, & Artie Shaw \nGenre: Colorized classics, Comedy, Musical, Romance\n\n\n00:00 Full Movie (with subtitles)\n01:39 A group of friends reminisce about their college days and a past due encyclopedia bill leads to a humorous confrontation.\n06:43 Musical comedy film featuring a secretary's journey in the entertainment industry.\n11:16 Discussion about music, dancing, and academic struggles among friends during a party preparation.\n19:31 Unexpected events unfold as characters navigate through a series of misunderstandings and opportunities in a musical romance film.\n26:06 Musical band auditions take place, leading to a promising opportunity for the protagonist.\n30:50 Musical audition mishaps and romantic entanglements unfold at Artie Shaw's office.\n36:48 Rivalry and romantic complications unfold as Hank Taylor navigates his relationships with Ellen and Artie Shaw.\n50:26 Romance unfolds as Ellen navigates between two suitors and Hank's unexpected visit causes tension.\n53:48 Unexpected encounters lead to revelations and decisions in a musical setting.\n58:32 A man tries to make amends for his mistakes and misjudgments in a musical setting.\n1:02:08 Musical performance rehearsal with unexpected guests and a secret plan to surprise Shaw.\n1:13:18 Preparation and arrangements for a concert, including a secret plan involving Artie and Hank.\n1:14:21 Musical performance by Danny impresses Artie Shaw, leading to a job offer.\n\n\n@CultCinemaClassics\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:37:54.139Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/LNmVnnulO8U/maxresdefault.webp",
      "duration": 5015,
      "language": "en",
      "year": 1940,
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:37:54.267Z"
}