{
  "movieId": "youtube-smwde8VJJ_s",
  "title": "The Girl in the Bikini 1952 (Adventure, Romance) Brigitte Bardot, Jean-Fra...",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=smwde8VJJ_s",
      "id": "smwde8VJJ_s",
      "title": "The Girl in the Bikini 1952 (Adventure, Romance) Brigitte Bardot, Jean-Fra...",
      "description": "Brigitte Bardot's film debut, as a light-house keeper's daughter... who believes in dressing light!\nGérard Morere, a Parisian student, becomes fixated on finding the lost treasure Troilus after discovering a Phoenician artifact in Corsica. His quest leads him to embark on a risky journey with a smuggler to Corsica island, where he meets and falls for Manina, the lightkeeper's daughter. The burgeoning romance complicates Gérard's original mission, forcing him to navigate the challenges of love and treasure hunting amidst the backdrop of scenic landscapes and perilous adventures. \n\nColorized version: https://youtu.be/qEbJVqUJCyg\n\n\nOriginal title: Manina, la fille sans voiles (1952) AKA: Manina, the Lighthouse-Keeper’s Daughter / The Girl in the Bikini\n\nThis film is available with original French audio, and dubbed Spanish & Russian. \nAlso subtitled in many languages Go to settings ⚙️  to change your audio / subtitle options.\n\nDirector & Writer: Willy Rozier\nCast: Brigitte Bardot, Jean-François Calvé, Howard Vernon\nGenres: French Cinema, Adventure, Music, Romance\n\n\n00:00 Full Movie (with subtitles).\n00:29 The discovery of a Phoenician treasure leads to a conflict over rent payment in a coastal town.\n08:53 Exploration of Phoenician treasure leads to a risky adventure with mixed reactions from friends.\n13:22 Adventure and intrigue unfold as a man plans a treasure hunt with a Parisian in Tangiers.\n22:07 Warning about a dangerous lady named Franchucha and a risky smuggling operation on a boat.\n32:25 Adventure unfolds as a group plans a treasure hunt diving expedition in the Mediterranean Sea.\n55:23 A promise of leaving the island for a new life is made, sparking hope and uncertainty.\n56:57 A heartfelt conversation between two individuals on a remote island about love, separation, and a shared quest for hidden treasure.\n1:08:35 A romantic adventure unfolds as a couple discovers a treasure hidden in ancient amphorae, solidifying their love.\n1:18:55 A tale of love, loss, and treasure hunting on the high seas unfolds as a yacht sinks in search of hidden riches.\n\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:36:45.023Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/smwde8VJJ_s/maxresdefault.webp?v=660f755a",
      "duration": 5372,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:45.141Z"
}