{
  "imdbId": "youtube-mv0U6BPVVIk",
  "title": "The Kiss (MGM, 1929) GRETA GARBO🍕 CONRAD NAGEL🍕 LEW AYRES",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=mv0U6BPVVIk",
      "id": "mv0U6BPVVIk",
      "title": "The Kiss (MGM, 1929) GRETA GARBO🍕 CONRAD NAGEL🍕 LEW AYRES",
      "description": "PizzaFLIX Presents CLASSIC MOVIE MONDAY\nStars: Greta Garbo, Conrad Nagel, Lew Ayres\nDirector: Jacques Feyde\n🍕ORIGINAL SYNCRONIZED SCORE🍕\nCan a movie revolve around a single, solitary kiss? It can—when the lips belong to the mesmerizing Greta Garbo! In her final silent film, the Silver Screen goddess is joined by Conrad Nagel and a young Lew Ayres in his breakout role. This captivating romantic drama explores themes of infidelity, rivalry, manslaughter, and the dangerous power of passion. \n\nGarbo delivers a haunting performance as a married woman trapped in a loveless marriage, caught between desire and duty. As tensions rise, a single kiss sets off a dramatic chain of events—including a shocking act of manslaughter and a gripping courtroom showdown. With early synchronized sound, moody cinematography, and a score full of tension, The Kiss is a must-watch for classic film lovers.\n\nAre you a PizzaFLIX Fanatic? Join our exclusive Fan Club for dedicated Classic movie lovers: https://www.youtube.com/channel/UCE34fwgW7kWr7tc7YiOWtRw/join\n\nRediscover this forgotten gem on PizzaFLIX, your go-to destination for timeless cinema. If you're a fan of Greta Garbo, vintage Hollywood, or 1920s romantic dramas with high emotional stakes, this is a film you won't want to miss.\n\n🍕Subscribe to PizzaFLIX for more timeless gems from the Golden Age of Hollywood! Don’t forget to like, comment, and share if you love vintage cinema.🍕\n\n#GretaGarbo #TheKiss1929 #SilentFilmEra #PreCodeHollywood #RomanticDrama  #ConradNagel #LewAyres #JacquesFeyder #CourtroomDrama #SynchronizedSound #PizzaFLIX #FilmPreservation #DramaClassics #GarboGaze #FilmBuffsUnite #MovieCollector #GretaGarboMovies #PreCodeDrama #PizzaFLIX",
      "addedAt": "2025-12-24T01:04:26.765Z",
      "thumbnail": "https://i.ytimg.com/vi/mv0U6BPVVIk/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAuH0xsrLiMehxm_L81flPTUjK6Ag",
      "duration": 3778,
      "language": "en",
      "channelName": "PizzaFlix",
      "channelId": "UCE34fwgW7kWr7tc7YiOWtRw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T01:04:26.766Z"
}