{
  "imdbId": "youtube-86ELIeyTBmU",
  "title": "Father's Little Dividend 1951 (Joan Bennett, Elizabeth Taylor) Romance, Comedy | 4k Full Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=86ELIeyTBmU",
      "title": "Father's Little Dividend 1951 (Joan Bennett, Elizabeth Taylor) Romance, Comedy | 4k Full Movie",
      "description": "Newly married Kay Dunstan announces that she and her husband are going to have a baby, leaving her father having to come to grips with the fact that he will soon be a granddad. \n\nOriginal title: Father's Little Dividend (1951)\n\nColorized version https://youtu.be/wWjznQN41s4\n\n\nDirector: Vincente Minnelli\nWriters: Albert Hackett, Frances Goodrich\nStars: Spencer Tracy, Joan Bennett, Elizabeth Taylor \nGenres: Classics, Comedy, Romance\nCCC note: sequel to \"Father of the Bride\" (1950)\n\n\nThis film is available with French, German, Italian & Spanish dubbed audio. \nGo to settings ⚙️ to modify your audio / subtitle language options\n\n\n00:00 Full Movie\n02:08  A man reflects on his life and dreams of taking a trip to Hawaii with his wife after their daughter announces she is pregnant.\n08:10  Stanley Banks is shocked to learn that his daughter is pregnant and he will become a grandfather.\n16:03  Ellie wants Kay and Buckley to move in with them to help take care of the baby, but Stanley refuses.\n20:58  A couple discusses their new house and preparations for their baby.\n26:38  A couple discusses potential names for their baby, causing chaos and comedic arguments.\n37:37  A woman goes missing after an argument with her partner, causing her family to become worried and search for her.\n39:37  A father desperately tries to find his pregnant daughter who has left her husband and is in a fragile emotional state.\n51:13  A couple prepares for the birth of their child, facing anxiety and excitement as they rush to the hospital.\n1:01:25  A man's initial dislike for his grandson turns into love and acceptance over time.\n1:17:00  A man loses his grandson in the park and frantically searches for him.\n1:20:00  The video captures the christening of a baby named Stanley Banks and the emotions of the family members involved.\n\n@CultCinemaClassics",
      "id": "86ELIeyTBmU",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:40:05.016Z"
}