{
  "imdbId": "youtube-iFFjFr4eKCs",
  "title": "백구야 훨훨 날지마라 (1983) / Sea Gull, Don't Fly Away (Baekguya hwolhwol nalji mara)",
  "year": 1983,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=iFFjFr4eKCs",
      "id": "iFFjFr4eKCs",
      "title": "백구야 훨훨 날지마라 (1983) / Sea Gull, Don't Fly Away (Baekguya hwolhwol nalji mara)",
      "description": "영화의 자세한 정보를 보려면 아래의 웹주소를 방문하세요. \nFor detailed information on this film, visit : \n(한국어) https://www.kmdb.or.kr/db/kor/detail/movie/K/03655\n(English) https://www.kmdb.or.kr/eng/db/kor/detail/movie/K/03655\n\n감독(Director) : 정진우(Chung Jin Woo)\n출연 : 나영희 , 하재영 , 신성일 , 장혁 , 이성웅 \n줄거리 :  뱃사람 두진은 흑산도 술집에서 파시아가씨 은주를 큰 백에 넣어 섬을 빠져나온다. 두진은 첫사랑 은주와 함께 선원들의 축복 속에 갑판결혼식을 올리며 행복을 만끽한다. 두 사람은 목포선창에 이르러 육지에 첫발을 내딛는 순간, 흑산도 술집의 마이고리 아줌마가 쳐놓은 연락망에 의해 사나이에게 잡혀 다른 섬으로 붙잡혀 가게 된다. 이 섬 저 섬 떠돌며 몸과 마음이 지쳐버린 은주는 연평도에 머물게 되고 두진은 은주의 행방을 수소문한다. 연평도 파시 때 각처에서 만선배 들이 몰려든다. 하룻밤의 값을 고등어 한 마리를 받던 은주는 술집에 아가씨가 모자라자 불려져 가 낯선 방에 들어선 순간 두진을 보고 소스라쳐 달아난다. 갯벌로 달아난 은주를 쫓아 두진은 달린다. 은주를 붙잡은 두진은 모든 상처와 아픔을 온 몸으로 감싸준다. 두진은 은주가 진 빚을 청산해 주고 사랑을 약속하며 출어의 배에 오른다.\n\nCasts: Na Young-hee , Ha Jae-young , Shin Seong-il , Chang Hyeok , Lee Seong-ung\nSYNOPSIS : Sailor Du-jin meets Eun-ju in a bar in Heuksan Island. Eun-ju sells fish in the fish market. She escapes as Du-jin hides her in a large bag. Amidst the sailors' congratulations, Du-jin and Eun-ju get married on the ship deck and live happily. But when they dock in Mokpo, they get caught for Madam Maigori of the bar in Heuksan Island had put the word out. Eun-ju is sent to another island. Eun-ju is sent from one island to another before finally staying put on Younpyung Island. Du-jin searches for her. Many boats dock at Younpyung Island during their fish market. At a bar, there is a shortage of women so Eun-ju is brought in. In a room, Eun-ju meets Du-jin. Eun-ju runs through the mud fields. Du-jin goes after, covering her wounds with his body. Du-jin pays back Eun-ju's debts. Promising to love one another, the two get on the leaving fishing boat.",
      "addedAt": "2025-12-26T00:21:51.416Z",
      "thumbnail": "https://i.ytimg.com/vi/iFFjFr4eKCs/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLBiBaGO95jS_F4_z2z2QZ1aw5Iecw",
      "duration": 6300,
      "language": "ko",
      "year": 1983,
      "channelName": "Korean Classic Film",
      "channelId": "UCvH6u_Qzn5RQdz9W198umDw"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:21:51.449Z"
}