{
  "imdbId": "youtube-Nn0thst9e-Y",
  "title": "The Gunmen | Bonanza 1960 (Western TV series) Michael Landon, Lorne Greene, Dan Blocker",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=Nn0thst9e-Y",
      "title": "The Gunmen | Bonanza 1960 (Western TV series) Michael Landon, Lorne Greene, Dan Blocker",
      "description": "Welcome to Kiowa Flats, where mistaking cowboys for gunslingers is just the beginning of the fun! Join Hoss and Joe as they navigate a wild mix-up involving the feuding Slade Brothers, romance, and a whole lot of poetry. It's a comedic ride you won't want to miss in this episode of laughter and mistaken identities!\n\nOriginal title: Bonanza: The Gunmen (1960)\n\nDirector: Christian Nyby\nWriters: Carey Wilber, David Dortort, Fred Hamilton\nGenre: Western, TV series \nStarring: \nDan Blocker\nMichael Landon\nLorne Greene\nPernell Roberts\nHenry Hull\nGeorge Mitchell\nDouglas Spencer\nKing Donovan\n\n00:00 Full episode (with subtitles).\n01:03 Encounter with notorious Slade boys in Kiowa Flats leads to a tense situation in a saloon.\n01:32 Warning to avoid Kiowa Flats due to Slade boys' presence.\n02:31 Reports of a giant and a small man approaching, causing concern among the townsfolk.\n08:00 Unsettling encounter in a deserted town leads to suspicions and a decision to stay despite strange vibes.\n14:16 Conflict arises as characters are accused of being hired killers in a feud between two families.\n21:03 The desire to have the tribute buried with someone.\n25:46 Black Alonzo relays message to Pa about mistaken identity and gratitude for jailbreak.\n28:22 McFadden gives ultimatum to gunmen to complete job or face consequences, leading to a standoff.\n35:43 Gramps Hadfield's search for the missing hog leads to conflict with the McFaddens.\n41:40 The Women, Ouisey and Susan, demand their husbands to put down guns.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "Nn0thst9e-Y",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:35:44.198Z"
}