{
  "imdbId": "youtube-sy_-GbVN3sE",
  "title": "EMILIA CLARKE hears a call from beyond (Mystery full movie German, German movies complete)",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=sy_-GbVN3sE",
      "title": "EMILIA CLARKE hears a call from beyond (Mystery full movie German, German movies complete)",
      "description": "💙 Ganze Filme in voller Länge komplett auf Deutsch - jetzt abonnieren: http://bit.ly/NetzkinoAbo\n📺 „Game of Thrones“-Star EMILIA CLARKE spielt Verena, eine junge Krankenschwester im Italien der 1950er. Sie kümmert sich um einen verstummten Jungen, der nach einem Trauma von einer geheimnisvollen Stimme heimgesucht wird.\n\nVOICE FROM THE STONE (2017)\nOriginaltitel: Voice From the Stone\nMit: Emilia Clarke, Edward Dring, Marton Csokas\nRegie: Eric D. Howell \nFSK: Freigegeben ab 12 Jahren\n\nINHALTSANGABE:\nDie junge und engagierte Krankenschwester Verena (Emilia Clarke) übernimmt eine neue Stelle in der italienischen Toskana der 1950er-Jahre. Ihr neuer Patient Jakob (Edward Dring) wartet innerhalb altehrwürdiger Gemäuer auf einem weitläufigen Anwesen auf sie. Der kleine Junge hat ein traumatisches Erlebnis zu verkraften - er musste den Tod seiner Mutter mitansehen und hat außerdem schreckliche Dinge gehört... Seit diesem Vorkommnis hat er kein einziges Wort mehr gesprochen. Sein Vater Klaus (Marton Csokas) glaubt jedoch, dass Jakob eine Stimme wahrnimmt und dass diese von der Mutter stammen könnte. Während Verena noch damit beschäftigt ist, auf den Jungen aufzupassen, gelangen immer mehr dunkle Geheimnisse ans Licht. Schon bald muss Verena feststellen, dass Jakob sich nichts zusammenspinnt – die Stimme existiert wirklich...\n#Netzkino #ganzerFilm #EmiliaClarke\n\nCOPYRIGHT: \nDie Lizenz zur Veröffentlichung dieses Films auf YouTube wurde ordnungsgemäß erworben. \nBei Fragen wenden Sie sich bitte an: copyright.berlin@plaion.com \n\nPLAION PICTURES is a serious and legal video on demand company located in Berlin, Germany. We are holding proper license for all of our published movies. For any questions contact copyright.berlin@plaion.com\n\nFOLGE UNS!\n✘ TikTok - https://www.tiktok.com/@netzkino_official\n✘ Instagram - https://www.instagram.com/netzkinode/\n✘ Facebook - https://www.facebook.com/netzkino\n\nUNTERSTÜTZE NETZKINO\n✘ Du willst uns unterstützen und ein cooles Badge in den Kommentaren? Dann hier entlang https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n✘ Unterstütze uns mit einem kleinen monatlichen Beitrag für mehr Filme und andere tolle Vorteile. Jetzt Netzkino Mitglied werden! https://www.youtube.com/channel/UCGkHFrwE8KEuOHPVsIOskAg/join\n\nNETZKINO WEBSITE & TRAILER\n✘ Viele weitere Filme zum kostenlosen Streamen auf: netzkino.de\n✘ Abonniere unseren Trailer-Kanal für die neusten Kinotrailer: http://bit.ly/NetzkinoTrailer\n✘ Keine Zeit für minutenlange Trailer? Dann genieße unser Kino in Kurzform auf NetzkinoClips: https://bit.ly/netzkino-clips\n\nUNSERE APPS\n✘ Android - http://bit.ly/Netzkino_AndroidApp\n✘ iOS - http://bit.ly/NetzkinoApple\n✘ Windows Phone - http://bit.ly/NetzkinoWindowsPhone\n✘ Amazon Kindle - http://bit.ly/NetzkinoAmazon\n\nNOCH MEHR FILME?\n► HD-Kino: http://bit.ly/NetzkinoHighDefinition\n► Actionfilme: http://bit.ly/NetzkinoAction\n► Komödien: http://bit.ly/NetzkinoKomoedie\n► Thriller: http://bit.ly/NetzkinoThriller\n► Alle Playlists: http://bit.ly/NetzkinoPlaylists",
      "id": "sy_-GbVN3sE",
      "channelName": "Netzkino",
      "channelId": "UCGkHFrwE8KEuOHPVsIOskAg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-25T23:55:16.126Z"
}