{
  "imdbId": "youtube-KQeEIbN296U",
  "title": "Vendetta - Alles was ihm blieb war Rache - mit Arnold Schwarzenegger - Ganzer Film kostenlos in HD",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=KQeEIbN296U",
      "id": "KQeEIbN296U",
      "title": "Vendetta - Alles was ihm blieb war Rache - mit Arnold Schwarzenegger - Ganzer Film kostenlos in HD",
      "description": "*GANZER FILM - Mitreissender Spielfilm mit Arnold Schwarzenegger in der Hauptrolle, gesprochen von Thomas Danneberg*\n\nDen Spielfilm „Vendetta - Alles was ihm blieb war Rache“ mit Arnold Schwarzenegger in der Hauptrolle kostenlos und in voller Länge auf Moviedome schauen.\n\n*So bewerten Filmfans* „Vendetta - Alles was ihm blieb war Rache“:\nIMDb: *5,7* von 10\nAmazon: *3,8* von 5\n\n*Die Handlung von „Vendetta - Alles was ihm blieb war Rache“*\nWährend seiner Schicht passiert dem Fluglotsens Jacob ein schwerer Fehler, der zur Folge hat, dass zwei Flugzeuge ineinander stoßen und abstürzen. Bei diesem Unglück gibt es keine Überlebenden. Zu den Verstorbenen gehören unter anderem die Frau und schwangere Tochter von Roman. Dieser ist zutiefst bestürzt und setzt alles daran, den Schuldigen zu finden und zur Rechenschaft zu ziehen. Beide Männer sind traumatisiert und haben alles verloren, doch während Jacob versucht, sein Leben wieder in den Griff zu bekommen, ist Roman auf Rache aus.\n\n\n►Mehr ganze Filme auf Moviedome entdecken! http://bit.ly/MoviedomeAbo\nJetzt den ganzen Spielfilm „Vendetta - Alles was ihm blieb war Rache“ kostenlos als ganzen Film auf deutsch sehen.\n\n►Abonniere Moviedome für ganze Filme auf YouTube: https://bit.ly/MoviedomeAbo\n►Mehr kostenlose HD Filme ►www.moviedome.de \n\nFolge uns auch auf unseren Social Media-Kanälen! \n► Facebook ► https://www.facebook.com/moviedome \n► Instagram ► https://www.instagram.com/moviedome_de \n\n#Moviedome #GanzerFilm #ArnoldSchwarzenegger #FilmeKostenlos\n\nOriginaltitel: Aftermath\nLaufzeit: 94\nRegie: Elliott Lester\nFSK: 16\nErstveröffentlichung: 2017\n\n\n*Das sind die Schauspieler von „Vendetta - Alles was ihm blieb war Rache“*\nArnold Schwarzenegger (bekannt aus „Terminator 2“, „The Expendables 3“)\nin der Rolle des Roman\nScoot McNairy (bekannt aus „Argo“, „Killing them Softly“)\nin der Rolle des Jake\nMaggie Grace (bekannt aus „96 Hours - Taken 3“, „Hurricane Heist“)\nin der Rolle der Christina\n\n\n*Über den Hauptdarsteller Arnold Schwarzenegger* \nArnold Schwarzenegger ist nicht nur als erfolgreichster Bodybuilder der Welt bekannt, sondern auch als erfolgreicher Schauspieler Hollywoods, Regisseur, Produzent und Politiker. 1969 trat der gebürtige Österreicher erstmals in dem Film “Hercules in New York” auf. Erst 13 Jahre später gelang ihm sein internationaler Durchbruch durch den Science-Fiction-Film “Terminator”. Obwohl Schwarzenegger sich vor allem in Action- und Science-Fiction Filmen bewiesen hat, beweist er Vielfältigkeit in seiner Schauspielkunst und ist in auch Komödien wie “Kindergarten Cop” oder \"Twins - Zwillinge\" (mit Danny DeVito) zu sehen. Da auf “Terminator” so viele positive Rezensionen folgten, gab es sechs Terminator Filme - in der Hauptrolle: Arnold Schwarzenegger. Im neuen Jahrhundert überzeugte er vor allem an der Seite von anderen Action-Legenden wie zum Beispiel mit Sylvester Stallone in „Expendables“ oder „Escape Plan“.\n\n\n*Die Synchronsprecher in „Vendetta - Alles was ihm blieb war Rache“*\nThomas Danneberg in der Rolle des Roman\nMatthias Deutelmoser in der Rolle des Jacob, Jake Bonanos\nMareile Moeller in der Rolle der Christina\nJennifer Böttcher in der Rolle der Eve\nMartin Sabel in der Rolle des James\nMartin May in der Rolle des Matt\n\n\nJetzt ganze Filme bei #Moviedome anschauen\nFinde Movies in ganzer Länge diverser Genres bei Moviedome. Ob Action, Komödien, Kinderfilme oder Thriller - finde Deinen Lieblingsfilm hier. Jetzt Film und Trailer kostenlos auf deutsch schauen.\n\nGanzer Film auf deutsch \nJetzt den Spielfilm „Vendetta - Alles was ihm blieb war Rache“ in voller Länge auf deutsch ansehen.",
      "addedAt": "2025-12-26T00:35:58.593Z",
      "thumbnail": "https://i.ytimg.com/vi/KQeEIbN296U/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLAHDrab1YK0fNwmz0Bm1O97RfRk1A",
      "duration": 5584,
      "language": "de",
      "channelName": "Moviedome",
      "channelId": "UCh4JH8axA_jUjB8YoRnm0cg",
      "regionRestriction": {
        "allowed": [
          "AT",
          "CH",
          "DE",
          "LI",
          "LU"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T00:35:58.689Z"
}