{
  "imdbId": "youtube-NiYJliPNlhQ",
  "title": "Carole Lombard | Made for Each Other (1939) directed by John Cromwell | Colorized Movie",
  "year": 1939,
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=NiYJliPNlhQ",
      "title": "Carole Lombard | Made for Each Other (1939) directed by John Cromwell | Colorized Movie",
      "description": "John Mason, a passionate and ambitious young lawyer, swiftly falls in love with the vivacious Jane and hastily ties the knot. Their blossoming love faces a tumultuous journey as they combat a disapproving mother, financial strain, and the arrival of a baby. Amidst the backdrop of unpaid bills and familial discord, John's dedication is put to the test when he must plead with his formidable boss, Judge Doolittle, for financial aid. As they navigate the trials of marriage and career, unexpected tragedy strikes, challenging the young couple to confront their deepest vulnerabilities and fight to preserve their love and future together.\n\nOriginal title: Made for Each Other (1939)\nThis film is available with English, Italian & German audio options, and subtitled in many languages.\n\nBlack & White version: https://youtu.be/peDN9L2_Gbc\n\nDirector: John Cromwell\nWriters: Jo Swerling, Rose Franken \nStars: Carole Lombard, James Stewart, Charles Coburn \nGenre:  Colorized, Comedy, Drama, Romance\n\n\n00:00 Full Movie (with dubbed audio & subtitles)\n00:33 John and Jane's sudden marriage sparks a whirlwind of unexpected consequences.\n09:21 A young couple faces family pressures, navigating marriage and fresh starts under surprising circumstances.\n16:21 Chaos ensues as the couple scrambles to host a dinner party amidst a scheduling mix-up.\n22:47 A dinner party turns eventful with unexpected revelations, including the announcement of a new law firm partner.\n30:36 A fierce legal battle over water rights leads into the joys and trials of new parenthood.\n40:02 Balancing career ambition and personal life becomes a struggle as recognition at work is pursued.\n46:43 Two colleagues discuss work challenges and offer personal reassurances amid growing tension.\n58:06 A New Year’s Eve at home unravels with missing guests and unexpected family drama.\n1:05:02 The family faces illness and miscommunication, straining relationships and testing their bonds.\n1:14:26 A desperate father searches for life-saving serum for his sick baby, confronting emotional and physical challenges.\n1:21:02 Loneliness, communication breakdown, and family tensions boil over during a critical crisis.\n\n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "NiYJliPNlhQ",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:36:23.556Z"
}