{
  "movieId": "youtube-QIKQ5jsm6q0",
  "title": "The Killer She Accidentally Made Famous | Full Romance Crime Movie | Please Kill Mr. Know It All",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QIKQ5jsm6q0",
      "id": "QIKQ5jsm6q0",
      "title": "The Killer She Accidentally Made Famous | Full Romance Crime Movie | Please Kill Mr. Know It All",
      "description": "Cynical Sally lives a life free of excitement and romance and that’s just the way she likes it. Although she’d like to be a novelist, she makes ends meet ghostwriting a local advice column under the pseudonym Mr. Know-It-All.  After a celebrity endorsement turns her column into an overnight success, the newspaper requests a photo of the author. Unfortunately, Patti has been lying to the newspaper and they believe that a man has been writing the column all along.  Sally submits a sketch of a handsome stranger she spots in a movie theatre. Not such a bad thing, unless the handsome stranger happens to be a contract killer. Once the picture is published, Albert cannot walk down the street without being recognized, and so, for the sake of his livelihood, he decides he must kill Mr. Know-It-All. While Albert is determined to find Mr. Know-It-All, Sally conducts a hidden camera interview with Albert to satisfy the press’s need to know more about the popular columnist. As Albert and Sally begin to spend more and more time together, ulterior motives quickly turn into mutual attraction and Sally decides to confess that she is Mr. Know-It-All. At this point, Albert doesn’t know whether to kiss her or kill her and his seeming indifference causes her to push him away. Meanwhile, the girlfriend of Albert’s MOB BOSS (AL SAPIENZA) decides to pack up and leave after being inspired by one of Mr. Know it All’s columns. The MOB BOSS is heart broken and contracts a hit on Mr Know-It-All by his go-to hit man, none other than Albert. Albert is torn between love and responsibility. Will Albert do the hit? Or will they find happiness in the end? Can they outwit the mob? Will the one-legged man find revenge?\n\n2012.  Stars: Lara Jean Chorostecki, Jefferson Brown, Kristina Pesic\n*Licensed from Syndicado. All rights reserved*\n\n*Welcome to Movie Central, SUBSCRIBE NOW!* - https://bit.ly/3mRDJox\n*MORE FREE MOVIES  on YouTube!* - \n🌟 Free Action Movies: https://bit.ly/3uMwRxq\n🌟 Free Sci-Fi Movies: https://bit.ly/3o3lLAm\n🌟 Free Horror Movies: https://bit.ly/3aBBt2J\n🌟 Free Asylum Movies: https://bit.ly/3cipzeI\n🌟 Free Crime/Thriller: https://bit.ly/3o01prJ\n🌟 Free Drama Movies: https://bit.ly/3Pu4mN9\n🌟 Free Comedy Movies: https://bit.ly/3IE0wPd\n🌟 Free Western Movies: https://bit.ly/3RqTX6u\n🌟 Free Adventure Movies: https://bit.ly/3yHolAT\n🌟 MOVIE CENTRAL Channel: https://bit.ly/3o27Fze\n\n** All of the content on this channel is under legal license from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - you_tube@valleyarm.com  **\n\n#romancecrime #romancethriller #FullFreeMovies #MovieCentral #FreeYouTubeMovies",
      "addedAt": "2025-12-24T01:37:57.722Z",
      "thumbnail": "https://i.ytimg.com/vi/QIKQ5jsm6q0/hqdefault.jpg?sqp=-oaymwEjCPYBEIoBSFryq4qpAxUIARUAAAAAGAElAADIQj0AgKJDeAE=&rs=AOn4CLCu_1VImX_YPv9vjNLREPQEIAAAzg",
      "duration": 5162,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-24T01:37:57.722Z"
}