{
  "imdbId": "youtube-QJK5EiB98cw",
  "title": "From the Earth to the Moon 1958 (Adventure, Sci-Fi) Joseph Cotten, George Sanders, Debra Paget",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=QJK5EiB98cw",
      "title": "From the Earth to the Moon 1958 (Adventure, Sci-Fi) Joseph Cotten, George Sanders, Debra Paget",
      "description": "The amazing story of the boldest adventure dared by man!\nIn 1868, American inventor Victor Barbicane develops a powerful military explosive that he also uses as fuel for a moon-bound rocket manned by himself and a motley crew.\n\nDirector: Byron Haskin\nWriters: Jules Verne, Robert Blees, James Leicester\nStars: Joseph Cotten, George Sanders, Debra Paget\nGenres: Literary, Adventure, Fantasy, Sci-Fi\n\n00:00 Full Movie (with subtitles)\n01:12 A secret armament club unveils a weapon powerful enough to reach the Moon.\n12:07 A daring mission is launched to destroy a dangerous invention, sparking conflict.\n16:06 American scientists race to build a Moon-bound cannon as international pressure mounts.\n28:11 A government official pressures a scientist to stop the project, fearing global catastrophe.\n35:19 A new energy source revives the Moon project, and a top scientist is recruited for the mission.\n42:50 Preparations for a groundbreaking space mission begin, with uncertainty looming.\n1:01:30 The Moon mission faces sabotage, putting the crew’s lives in peril.\n1:06:19 High-stakes drama as the crew confronts life-threatening danger in space.\n1:16:39 Mysterious challenges emerge as the crew nears the Moon.\n1:24:29 Tragedy strikes the Moon mission, as unforeseen obstacles arise.\n1:31:40 The journey ends in mystery, with signals exchanged and rumors of a hoax swirling.\n \n\n@CultCinemaClassics\n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "QJK5EiB98cw",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA",
      "regionRestriction": {
        "blocked": [
          "AR",
          "BO",
          "BR",
          "CA",
          "CL",
          "CO",
          "CR",
          "IT",
          "MX",
          "PE",
          "PY",
          "US",
          "VE"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:36:58.660Z"
}