{
  "movieId": "youtube-YptW5s86oNQ",
  "title": "A Kidnapping Sparks A War | Layers of Lies | HD 2025 Action Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=YptW5s86oNQ",
      "id": "YptW5s86oNQ",
      "title": "A Kidnapping Sparks A War | Layers of Lies | HD 2025 Action Movie",
      "description": "A Kidnapping Sparks A War | Layers of Lies | HD 2025 Action Movie - Returning to Iran after many years in exile in Finland, Sam (Ramin Sohrab) finds that he has not yet escaped his past. A shady figure kidnaps his wife Emma (Jessica Wolff) in order to drag him into a violent scheme for revenge. But Sam is a relentless fighting machine who will stop at nothing to rescue the woman he loves. When it comes to deciding their future, the past will not stand in their way.\n\nLayers of Lies full movie follows Sam as he returns to Iran after years in exile, stepping straight into a dangerous world of revenge and violence when his wife Emma is kidnapped by a mysterious enemy from his past. This action thriller movie 2025 delivers intense hand to hand combat, high stakes rescue missions, and a relentless hero who refuses to back down. Perfect for fans of full free action movies, revenge thriller films, international action adventure, crime drama full movies, high intensity fight films, and emotional action stories, Layers of Lies blends brutal action with a powerful love driven mission. Experience a gripping action thriller full movie where past secrets, deadly enemies, and unstoppable determination collide in one explosive journey.\n\nWatch one of our brand new 2025 Action Movies Here - https://youtu.be/seeEhOxdeGQ\r\n\r\nStars: Ramin Sohrab, Jessica Wolff, Arsalan Ghasemi\n*Licensed from Entertainment Studios. All rights reserved*\n\nAll of the content on this channel is UNDER LEGAL LICENSE (We have written contracts) from various copyright holders and distributors. We ask you to please contact us if you believe there are any copyright issues via - rights@vamedianetwork.com\r\nMovie Central is owned and operated by VA Media Ltd. All rights reserved.\r\n\r\n#FullFreeMovies #MovieCentral #FreeYouTubeMovies\n00:00:00 Skip the opening credits\n00:01:57 Full Layers Of Lies Movie\n01:22:50 Skip the ending credits",
      "addedAt": "2025-12-26T23:59:33.958Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/YptW5s86oNQ/maxresdefault.webp",
      "duration": 5271,
      "language": "en",
      "channelName": "Movie Central",
      "channelId": "UCGBzBkV-MinlBvHBzZawfLQ",
      "regionRestriction": {
        "allowed": [
          "US"
        ]
      }
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-26T23:59:34.026Z"
}