{
  "imdbId": "youtube-FFOuw6KkGxQ",
  "title": "Peopletoys (Horror, 1974) Sorrell Booke, Gene Evans, Taylor Lacher | Movie",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=FFOuw6KkGxQ",
      "title": "Peopletoys (Horror, 1974) Sorrell Booke, Gene Evans, Taylor Lacher | Movie",
      "description": "What Wendy just saw them do will make you sick to your stomach...if it doesn't make you faint first!\nAfter five deranged children are involved in a bus wreck they start killing people at the lodge who insulted them or were rude to them.\n\nPeopletoys (1974) Also known as: The Horrible House on the Hill / Devil Times Five\n\nDirectors: Sean MacGregor, David Sheldon\nWriters: John Durren, Dylan Jones, Sandra Lee Blowitz\nStars: Sorrell Booke, Gene Evans, Taylor Lacher, Leif Garrett\nGenre: Horror Movie\n\n\n00:00 Full Movie (with subtitles)\n01:24 A group prepares for a trip to the mountains, facing challenges and discussing family dynamics.\n13:07 Disturbing events unfold in a house involving manipulation, power play, and dark secrets.\n19:48 A group faces mysterious events and struggles to survive in a remote lodge during a snowstorm.\n34:07 A group of survivors in a secluded location deal with sickness, power struggles, and mysterious events.\n41:21 A group of individuals, including a nun, face challenges and secrets in a remote location.\n49:48 A group of adults discuss strange behaviors among children in a remote location.\n55:42 A group faces mysterious events in a secluded location, leading to suspicion and tension.\n1:05:28 A chilling tale of betrayal, fear, and revenge unfolds in a secluded setting.\n1:15:23 A group of people in a snowy location face danger and betrayal, leading to a deadly confrontation.\n\n\n@CultCinemaClassics \n\nhttps://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "id": "FFOuw6KkGxQ",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "qualityLabels": [],
  "lastUpdated": "2025-12-27T00:36:34.741Z"
}