{
  "movieId": "youtube-BdD-LUG6_yk",
  "title": "Of Human Bondage (Romance, 1934) with Bette Davis & Leslie Howard | Cinema",
  "sources": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=BdD-LUG6_yk",
      "id": "BdD-LUG6_yk",
      "title": "Of Human Bondage (Romance, 1934) with Bette Davis & Leslie Howard | Cinema",
      "description": "A young man finds himself attracted to a cold, unfeeling waitress who might ultimately destroy them both.\n\nOriginal title: Of Human Bondage (1934)\nThis film is available with subtitles in many languages. Go to video settings ⚙️  to change your subtitle language options.\n\nColorized version https://youtu.be/XQPfpHvR-wk\n\n\nDirector: John Cromwell\nWriters: Lester Cohen, W. Somerset Maugham, Ann Coleman\nStars: Bette Davis, Leslie Howard, Frances Dee\nGenre:  Classics, Drama, Pre-Code, Romance\n\n00:00 Full Movie\n01:52 Struggling artist receives harsh criticism and learns about a congenital foot deformity.\n07:34 Romantic interactions between characters at a cafe and making plans for a date at the cinema.\n15:05 A romantic drama unfolds between two characters, Mildred and Philip, with emotional complexities and unrequited love.\n22:50 Drama unfolds as characters navigate love, rejection, and self-discovery in 1930s London.\n34:08 A complicated love story unfolds between Philip and Mildred, with emotions and misunderstandings leading to heartbreak.\n41:43 A complex love triangle unfolds, with one-sided affection, unexpected reunions, and conflicting emotions.\n47:58 A dramatic conversation between characters about love, friendship, and social norms in the 1934 film.\n54:12 Sally and Philip navigate their complex relationship, while Jack and Carey offer their perspectives.\n1:05:54 Philip confronts Mildred's betrayal and his own feelings in 'Of Human Bondage'.\n1:10:34 A complex interaction between Philip and Sally, as they discuss emotions.\n1:17:44 Unrequited love, marriage proposal, and realization of freedom and beauty in life.\n\n\n@CultCinemaClassics .\nMembers-only videos https://www.youtube.com/playlist?list=UUMOycDFnpMeWzaITQSD1dWsOA",
      "addedAt": "2025-12-27T00:38:51.033Z",
      "thumbnail": "https://i.ytimg.com/vi_webp/BdD-LUG6_yk/maxresdefault.webp?v=65c9a5b1",
      "duration": 4974,
      "language": "en",
      "channelName": "Cult Cinema Classics",
      "channelId": "UCycDFnpMeWzaITQSD1dWsOA"
    }
  ],
  "relatedMovies": [],
  "collections": [],
  "is_curated": false,
  "verified": false,
  "lastUpdated": "2025-12-27T00:38:51.158Z"
}